podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Signal mapping for PTA24 pin
//   <o> PTA24 [GPIOA_24, MII0_TXD2, FB_A29]<name=PTA24_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA24 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOA_24<selection=GPIOA_24_PIN_SEL,PTA24>
//     <4=> MII0_TXD2<selection=MII0_TXD2_PIN_SEL,PTA24>
//     <6=> FB_A29<selection=FB_A29_PIN_SEL,PTA24>
//     <-2=> Default
#define PTA24_SIG_SEL        -2

// Signal mapping for PTA25 pin
//   <o> PTA25 [GPIOA_25, MII0_TXCLK, FB_A28]<name=PTA25_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA25 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOA_25<selection=GPIOA_25_PIN_SEL,PTA25>
//     <4=> MII0_TXCLK<selection=MII0_TXCLK_PIN_SEL,PTA25>
//     <6=> FB_A28<selection=FB_A28_PIN_SEL,PTA25>
//     <-2=> Default
#define PTA25_SIG_SEL        -2

// Signal mapping for PTA26 pin
//   <o> PTA26 [GPIOA_26, MII0_TXD3, FB_A27]<name=PTA26_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA26 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOA_26<selection=GPIOA_26_PIN_SEL,PTA26>
//     <4=> MII0_TXD3<selection=MII0_TXD3_PIN_SEL,PTA26>
//     <6=> FB_A27<selection=FB_A27_PIN_SEL,PTA26>
//     <-2=> Default
#define PTA26_SIG_SEL        -2

// Signal mapping for PTA27 pin
//   <o> PTA27 [GPIOA_27, MII0_CRS, FB_A26]<name=PTA27_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA27 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOA_27<selection=GPIOA_27_PIN_SEL,PTA27>
//     <4=> MII0_CRS<selection=MII0_CRS_PIN_SEL,PTA27>
//     <6=> FB_A26<selection=FB_A26_PIN_SEL,PTA27>
//     <-2=> Default
#define PTA27_SIG_SEL        -2

// Signal mapping for PTA28 pin
//   <o> PTA28 [GPIOA_28, MII0_TXER, FB_A25]<name=PTA28_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA28 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOA_28<selection=GPIOA_28_PIN_SEL,PTA28>
//     <4=> MII0_TXER<selection=MII0_TXER_PIN_SEL,PTA28>
//     <6=> FB_A25<selection=FB_A25_PIN_SEL,PTA28>
//     <-2=> Default
#define PTA28_SIG_SEL        -2

// Signal mapping for PTA29 pin
//   <o> PTA29 [GPIOA_29, MII0_COL, FB_A24]<name=PTA29_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTA29 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOA_29<selection=GPIOA_29_PIN_SEL,PTA29>
//     <4=> MII0_COL<selection=MII0_COL_PIN_SEL,PTA29>
//     <6=> FB_A24<selection=FB_A24_PIN_SEL,PTA29>
//     <-2=> Default
#define PTA29_SIG_SEL        -2

// </h>

// <h> Port B Pins

// Signal mapping for PTB0 pin
//   <o> PTB0 [ADC0_SE8/ADC1_SE8, GPIOB_0/LLWU_P5, I2C0_SCL, FTM1_CH0, RMII0_MDIO/MII0_MDIO, FTM1_QD_PHA]<name=PTB0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB0 pin
//     <-2=> ADC0_SE8/ADC1_SE8 (reset default)<selection=ADC0_SE8_PIN_SEL,PTB0 (reset default)><selection=ADC1_SE8_PIN_SEL,PTB0 (reset default)>
//     <0=> ADC0_SE8/ADC1_SE8<selection=ADC0_SE8_PIN_SEL,PTB0><selection=ADC1_SE8_PIN_SEL,PTB0>
//     <1=> GPIOB_0/LLWU_P5<selection=GPIOB_0_PIN_SEL,PTB0><selection=LLWU_P5_PIN_SEL,PTB0>
//     <2=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTB0>
//     <3=> FTM1_CH0<selection=FTM1_CH0_PIN_SEL,PTB0>
//     <4=> RMII0_MDIO/MII0_MDIO<selection=RMII0_MDIO_PIN_SEL,PTB0><selection=MII0_MDIO_PIN_SEL,PTB0>
//     <6=> FTM1_QD_PHA<selection=FTM1_QD_PHA_PIN_SEL,PTB0>
//     <-2=> Default
#define PTB0_SIG_SEL         -2

// Signal mapping for PTB1 pin
//   <o> PTB1 [ADC0_SE9/ADC1_SE9, GPIOB_1, I2C0_SDA, FTM1_CH1, RMII0_MDC/MII0_MDC, FTM1_QD_PHB]<name=PTB1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB1 pin
//     <-2=> ADC0_SE9/ADC1_SE9 (reset default)<selection=ADC0_SE9_PIN_SEL,PTB1 (reset default)><selection=ADC1_SE9_PIN_SEL,PTB1 (reset default)>
//     <0=> ADC0_SE9/ADC1_SE9<selection=ADC0_SE9_PIN_SEL,PTB1><selection=ADC1_SE9_PIN_SEL,PTB1>
//     <1=> GPIOB_1<selection=GPIOB_1_PIN_SEL,PTB1>
//     <2=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTB1>
//     <3=> FTM1_CH1<selection=FTM1_CH1_PIN_SEL,PTB1>
//     <4=> RMII0_MDC/MII0_MDC<selection=RMII0_MDC_PIN_SEL,PTB1><selection=MII0_MDC_PIN_SEL,PTB1>
//     <6=> FTM1_QD_PHB<selection=FTM1_QD_PHB_PIN_SEL,PTB1>
//     <-2=> Default
#define PTB1_SIG_SEL         -2

// Signal mapping for PTB2 pin
//   <o> PTB2 (Alias:A0) [ADC0_SE12, GPIOB_2, I2C0_SCL, UART0_RTS_b, ENET0_1588_TMR0, FTM0_FLT3]<name=PTB2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB2 pin
//     <-2=> ADC0_SE12 (reset default)<selection=ADC0_SE12_PIN_SEL,PTB2 (Alias:A0) (reset default)>
//     <0=> ADC0_SE12<selection=ADC0_SE12_PIN_SEL,PTB2 (Alias:A0)>
//     <1=> GPIOB_2<selection=GPIOB_2_PIN_SEL,PTB2 (Alias:A0)>
//     <2=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTB2 (Alias:A0)>
//     <3=> UART0_RTS_b<selection=UART0_RTS_b_PIN_SEL,PTB2 (Alias:A0)>
//     <4=> ENET0_1588_TMR0<selection=ENET0_1588_TMR0_PIN_SEL,PTB2 (Alias:A0)>
//     <6=> FTM0_FLT3<selection=FTM0_FLT3_PIN_SEL,PTB2 (Alias:A0)>
//     <0=> Default
#define PTB2_SIG_SEL         0

// Signal mapping for PTB3 pin
//   <o> PTB3 (Alias:A1) [ADC0_SE13, GPIOB_3, I2C0_SDA, UART0_CTS_b/UART0_COL_b, ENET0_1588_TMR1, FTM0_FLT0]<name=PTB3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB3 pin
//     <-2=> ADC0_SE13 (reset default)<selection=ADC0_SE13_PIN_SEL,PTB3 (Alias:A1) (reset default)>
//     <0=> ADC0_SE13<selection=ADC0_SE13_PIN_SEL,PTB3 (Alias:A1)>
//     <1=> GPIOB_3<selection=GPIOB_3_PIN_SEL,PTB3 (Alias:A1)>
//     <2=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTB3 (Alias:A1)>
//     <3=> UART0_CTS_b/UART0_COL_b<selection=UART0_CTS_b_PIN_SEL,PTB3 (Alias:A1)><selection=UART0_COL_b_PIN_SEL,PTB3 (Alias:A1)>
//     <4=> ENET0_1588_TMR1<selection=ENET0_1588_TMR1_PIN_SEL,PTB3 (Alias:A1)>
//     <6=> FTM0_FLT0<selection=FTM0_FLT0_PIN_SEL,PTB3 (Alias:A1)>
//     <0=> Default
#define PTB3_SIG_SEL         0

// Signal mapping for PTB4 pin
//   <o> PTB4 [ADC1_SE10, GPIOB_4, ENET0_1588_TMR2, FTM1_FLT0]<name=PTB4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB4 pin
//     <-2=> ADC1_SE10 (reset default)<selection=ADC1_SE10_PIN_SEL,PTB4 (reset default)>
//     <0=> ADC1_SE10<selection=ADC1_SE10_PIN_SEL,PTB4>
//     <1=> GPIOB_4<selection=GPIOB_4_PIN_SEL,PTB4>
//     <4=> ENET0_1588_TMR2<selection=ENET0_1588_TMR2_PIN_SEL,PTB4>
//     <6=> FTM1_FLT0<selection=FTM1_FLT0_PIN_SEL,PTB4>
//     <-2=> Default
#define PTB4_SIG_SEL         -2

// Signal mapping for PTB5 pin
//   <o> PTB5 [ADC1_SE11, GPIOB_5, ENET0_1588_TMR3, FTM2_FLT0]<name=PTB5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB5 pin
//     <-2=> ADC1_SE11 (reset default)<selection=ADC1_SE11_PIN_SEL,PTB5 (reset default)>
//     <0=> ADC1_SE11<selection=ADC1_SE11_PIN_SEL,PTB5>
//     <1=> GPIOB_5<selection=GPIOB_5_PIN_SEL,PTB5>
//     <4=> ENET0_1588_TMR3<selection=ENET0_1588_TMR3_PIN_SEL,PTB5>
//     <6=> FTM2_FLT0<selection=FTM2_FLT0_PIN_SEL,PTB5>
//     <-2=> Default
#define PTB5_SIG_SEL         -2

// Signal mapping for PTB6 pin
//   <o> PTB6 [ADC1_SE12, GPIOB_6, FB_AD23]<name=PTB6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB6 pin
//     <-2=> ADC1_SE12 (reset default)<selection=ADC1_SE12_PIN_SEL,PTB6 (reset default)>
//     <0=> ADC1_SE12<selection=ADC1_SE12_PIN_SEL,PTB6>
//     <1=> GPIOB_6<selection=GPIOB_6_PIN_SEL,PTB6>
//     <5=> FB_AD23<selection=FB_AD23_PIN_SEL,PTB6>
//     <-2=> Default
#define PTB6_SIG_SEL         -2

// Signal mapping for PTB7 pin
//   <o> PTB7 [ADC1_SE13, GPIOB_7, FB_AD22]<name=PTB7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB7 pin
//     <-2=> ADC1_SE13 (reset default)<selection=ADC1_SE13_PIN_SEL,PTB7 (reset default)>
//     <0=> ADC1_SE13<selection=ADC1_SE13_PIN_SEL,PTB7>
//     <1=> GPIOB_7<selection=GPIOB_7_PIN_SEL,PTB7>
//     <5=> FB_AD22<selection=FB_AD22_PIN_SEL,PTB7>
//     <-2=> Default
#define PTB7_SIG_SEL         -2

// Signal mapping for PTB8 pin
//   <o> PTB8 [GPIOB_8, UART3_RTS_b, FB_AD21]<name=PTB8_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB8 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_8<selection=GPIOB_8_PIN_SEL,PTB8>
//     <3=> UART3_RTS_b<selection=UART3_RTS_b_PIN_SEL,PTB8>
//     <5=> FB_AD21<selection=FB_AD21_PIN_SEL,PTB8>
//     <-2=> Default
#define PTB8_SIG_SEL         -2

// Signal mapping for PTB9 pin
//   <o> PTB9 (Alias:D2) [GPIOB_9, SPI1_PCS1, UART3_CTS_b, FB_AD20]<name=PTB9_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB9 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_9<selection=GPIOB_9_PIN_SEL,PTB9 (Alias:D2)>
//     <2=> SPI1_PCS1<selection=SPI1_PCS1_PIN_SEL,PTB9 (Alias:D2)>
//     <3=> UART3_CTS_b<selection=UART3_CTS_b_PIN_SEL,PTB9 (Alias:D2)>
//     <5=> FB_AD20<selection=FB_AD20_PIN_SEL,PTB9 (Alias:D2)>
//     <1=> Default
#define PTB9_SIG_SEL         1

// Signal mapping for PTB10 pin
//   <o> PTB10 (Alias:A2) [ADC1_SE14, GPIOB_10, SPI1_PCS0, UART3_RX, FB_AD19, FTM0_FLT1]<name=PTB10_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB10 pin
//     <-2=> ADC1_SE14 (reset default)<selection=ADC1_SE14_PIN_SEL,PTB10 (Alias:A2) (reset default)>
//     <0=> ADC1_SE14<selection=ADC1_SE14_PIN_SEL,PTB10 (Alias:A2)>
//     <1=> GPIOB_10<selection=GPIOB_10_PIN_SEL,PTB10 (Alias:A2)>
//     <2=> SPI1_PCS0<selection=SPI1_PCS0_PIN_SEL,PTB10 (Alias:A2)>
//     <3=> UART3_RX<selection=UART3_RX_PIN_SEL,PTB10 (Alias:A2)>
//     <5=> FB_AD19<selection=FB_AD19_PIN_SEL,PTB10 (Alias:A2)>
//     <6=> FTM0_FLT1<selection=FTM0_FLT1_PIN_SEL,PTB10 (Alias:A2)>
//     <0=> Default
#define PTB10_SIG_SEL        0

// Signal mapping for PTB11 pin
//   <o> PTB11 (Alias:A3) [ADC1_SE15, GPIOB_11, SPI1_SCK, UART3_TX, FB_AD18, FTM0_FLT2]<name=PTB11_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB11 pin
//     <-2=> ADC1_SE15 (reset default)<selection=ADC1_SE15_PIN_SEL,PTB11 (Alias:A3) (reset default)>
//     <0=> ADC1_SE15<selection=ADC1_SE15_PIN_SEL,PTB11 (Alias:A3)>
//     <1=> GPIOB_11<selection=GPIOB_11_PIN_SEL,PTB11 (Alias:A3)>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTB11 (Alias:A3)>
//     <3=> UART3_TX<selection=UART3_TX_PIN_SEL,PTB11 (Alias:A3)>
//     <5=> FB_AD18<selection=FB_AD18_PIN_SEL,PTB11 (Alias:A3)>
//     <6=> FTM0_FLT2<selection=FTM0_FLT2_PIN_SEL,PTB11 (Alias:A3)>
//     <0=> Default
#define PTB11_SIG_SEL        0

// Signal mapping for PTB12 pin
//   <o> PTB12 [GPIOB_12, UART3_RTS_b, FTM1_CH0, FTM0_CH4, FTM1_QD_PHA]<name=PTB12_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB12 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_12<selection=GPIOB_12_PIN_SEL,PTB12>
//     <2=> UART3_RTS_b<selection=UART3_RTS_b_PIN_SEL,PTB12>
//     <3=> FTM1_CH0<selection=FTM1_CH0_PIN_SEL,PTB12>
//     <4=> FTM0_CH4<selection=FTM0_CH4_PIN_SEL,PTB12>
//     <6=> FTM1_QD_PHA<selection=FTM1_QD_PHA_PIN_SEL,PTB12>
//     <-2=> Default
#define PTB12_SIG_SEL        -2

// Signal mapping for PTB13 pin
//   <o> PTB13 [GPIOB_13, UART3_CTS_b, FTM1_CH1, FTM0_CH5, FTM1_QD_PHB]<name=PTB13_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB13 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_13<selection=GPIOB_13_PIN_SEL,PTB13>
//     <2=> UART3_CTS_b<selection=UART3_CTS_b_PIN_SEL,PTB13>
//     <3=> FTM1_CH1<selection=FTM1_CH1_PIN_SEL,PTB13>
//     <4=> FTM0_CH5<selection=FTM0_CH5_PIN_SEL,PTB13>
//     <6=> FTM1_QD_PHB<selection=FTM1_QD_PHB_PIN_SEL,PTB13>
//     <-2=> Default
#define PTB13_SIG_SEL        -2

// Signal mapping for PTB16 pin
//   <o> PTB16 [GPIOB_16, SPI1_SOUT, UART0_RX, FTM_CLKIN0, FB_AD17, EWM_IN]<name=PTB16_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB16 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_16<selection=GPIOB_16_PIN_SEL,PTB16>
//     <2=> SPI1_SOUT<selection=SPI1_SOUT_PIN_SEL,PTB16>
//     <3=> UART0_RX<selection=UART0_RX_PIN_SEL,PTB16>
//     <4=> FTM_CLKIN0<selection=FTM_CLKIN0_PIN_SEL,PTB16>
//     <5=> FB_AD17<selection=FB_AD17_PIN_SEL,PTB16>
//     <6=> EWM_IN<selection=EWM_IN_PIN_SEL,PTB16>
//     <-2=> Default
#define PTB16_SIG_SEL        -2

// Signal mapping for PTB17 pin
//   <o> PTB17 [GPIOB_17, SPI1_SIN, UART0_TX, FTM_CLKIN1, FB_AD16, EWM_OUT_b]<name=PTB17_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB17 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_17<selection=GPIOB_17_PIN_SEL,PTB17>
//     <2=> SPI1_SIN<selection=SPI1_SIN_PIN_SEL,PTB17>
//     <3=> UART0_TX<selection=UART0_TX_PIN_SEL,PTB17>
//     <4=> FTM_CLKIN1<selection=FTM_CLKIN1_PIN_SEL,PTB17>
//     <5=> FB_AD16<selection=FB_AD16_PIN_SEL,PTB17>
//     <6=> EWM_OUT_b<selection=EWM_OUT_b_PIN_SEL,PTB17>
//     <-2=> Default
#define PTB17_SIG_SEL        -2

// Signal mapping for PTB18 pin
//   <o> PTB18 [GPIOB_18, CAN0_TX, FTM2_CH0, I2S0_TX_BCLK, FB_AD15, FTM2_QD_PHA]<name=PTB18_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB18 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_18<selection=GPIOB_18_PIN_SEL,PTB18>
//     <2=> CAN0_TX<selection=CAN0_TX_PIN_SEL,PTB18>
//     <3=> FTM2_CH0<selection=FTM2_CH0_PIN_SEL,PTB18>
//     <4=> I2S0_TX_BCLK<selection=I2S0_TX_BCLK_PIN_SEL,PTB18>
//     <5=> FB_AD15<selection=FB_AD15_PIN_SEL,PTB18>
//     <6=> FTM2_QD_PHA<selection=FTM2_QD_PHA_PIN_SEL,PTB18>
//     <-2=> Default
#define PTB18_SIG_SEL        -2

// Signal mapping for PTB19 pin
//   <o> PTB19 [GPIOB_19, CAN0_RX, FTM2_CH1, I2S0_TX_FS, FB_OE_b, FTM2_QD_PHB]<name=PTB19_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB19 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_19<selection=GPIOB_19_PIN_SEL,PTB19>
//     <2=> CAN0_RX<selection=CAN0_RX_PIN_SEL,PTB19>
//     <3=> FTM2_CH1<selection=FTM2_CH1_PIN_SEL,PTB19>
//     <4=> I2S0_TX_FS<selection=I2S0_TX_FS_PIN_SEL,PTB19>
//     <5=> FB_OE_b<selection=FB_OE_b_PIN_SEL,PTB19>
//     <6=> FTM2_QD_PHB<selection=FTM2_QD_PHB_PIN_SEL,PTB19>
//     <-2=> Default
#define PTB19_SIG_SEL        -2

// Signal mapping for PTB20 pin
//   <o> PTB20 [GPIOB_20, SPI2_PCS0, FB_AD31, CMP0_OUT]<name=PTB20_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB20 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_20<selection=GPIOB_20_PIN_SEL,PTB20>
//     <2=> SPI2_PCS0<selection=SPI2_PCS0_PIN_SEL,PTB20>
//     <5=> FB_AD31<selection=FB_AD31_PIN_SEL,PTB20>
//     <6=> CMP0_OUT<selection=CMP0_OUT_PIN_SEL,PTB20>
//     <-2=> Default
#define PTB20_SIG_SEL        -2

// Signal mapping for PTB21 pin
//   <o> PTB21 (Alias:LED_BLUE) [GPIOB_21, SPI2_SCK, FB_AD30, CMP1_OUT]<name=PTB21_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB21 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_21<selection=GPIOB_21_PIN_SEL,PTB21 (Alias:LED_BLUE)>
//     <2=> SPI2_SCK<selection=SPI2_SCK_PIN_SEL,PTB21 (Alias:LED_BLUE)>
//     <5=> FB_AD30<selection=FB_AD30_PIN_SEL,PTB21 (Alias:LED_BLUE)>
//     <6=> CMP1_OUT<selection=CMP1_OUT_PIN_SEL,PTB21 (Alias:LED_BLUE)>
//     <1=> Default
#define PTB21_SIG_SEL        1

// Signal mapping for PTB22 pin
//   <o> PTB22 (Alias:LED_RED) [GPIOB_22, SPI2_SOUT, FB_AD29, CMP2_OUT]<name=PTB22_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB22 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_22<selection=GPIOB_22_PIN_SEL,PTB22 (Alias:LED_RED)>
//     <2=> SPI2_SOUT<selection=SPI2_SOUT_PIN_SEL,PTB22 (Alias:LED_RED)>
//     <5=> FB_AD29<selection=FB_AD29_PIN_SEL,PTB22 (Alias:LED_RED)>
//     <6=> CMP2_OUT<selection=CMP2_OUT_PIN_SEL,PTB22 (Alias:LED_RED)>
//     <1=> Default
#define PTB22_SIG_SEL        1

// Signal mapping for PTB23 pin
//   <o> PTB23 (Alias:D4) [GPIOB_23, SPI2_SIN, SPI0_PCS5, FB_AD28]<name=PTB23_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB23 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOB_23<selection=GPIOB_23_PIN_SEL,PTB23 (Alias:D4)>
//     <2=> SPI2_SIN<selection=SPI2_SIN_PIN_SEL,PTB23 (Alias:D4)>
//     <3=> SPI0_PCS5<selection=SPI0_PCS5_PIN_SEL,PTB23 (Alias:D4)>
//     <5=> FB_AD28<selection=FB_AD28_PIN_SEL,PTB23 (Alias:D4)>
//     <1=> Default
#define PTB23_SIG_SEL        1

