podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// </h>

// <h> Port D Pins

// Signal mapping for PTD0 pin
//   <o> PTD0 (Alias:D10) [GPIOD_0/LLWU_P12, SPI0_PCS0, UART2_RTS_b, FTM3_CH0, FB_ALE/FB_CS1_b/FB_TS_b]<name=PTD0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD0 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_0/LLWU_P12<selection=GPIOD_0_PIN_SEL,PTD0 (Alias:D10)><selection=LLWU_P12_PIN_SEL,PTD0 (Alias:D10)>
//     <2=> SPI0_PCS0<selection=SPI0_PCS0_PIN_SEL,PTD0 (Alias:D10)>
//     <3=> UART2_RTS_b<selection=UART2_RTS_b_PIN_SEL,PTD0 (Alias:D10)>
//     <4=> FTM3_CH0<selection=FTM3_CH0_PIN_SEL,PTD0 (Alias:D10)>
//     <5=> FB_ALE/FB_CS1_b/FB_TS_b<selection=FB_ALE_PIN_SEL,PTD0 (Alias:D10)><selection=FB_CS1_b_PIN_SEL,PTD0 (Alias:D10)><selection=FB_TS_b_PIN_SEL,PTD0 (Alias:D10)>
//     <1=> Default
#define PTD0_SIG_SEL         1

// Signal mapping for PTD1 pin
//   <o> PTD1 (Alias:D13) [ADC0_SE5b, GPIOD_1, SPI0_SCK, UART2_CTS_b, FTM3_CH1, FB_CS0_b]<name=PTD1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD1 pin
//     <-2=> ADC0_SE5b (reset default)<selection=ADC0_SE5b_PIN_SEL,PTD1 (Alias:D13) (reset default)>
//     <0=> ADC0_SE5b<selection=ADC0_SE5b_PIN_SEL,PTD1 (Alias:D13)>
//     <1=> GPIOD_1<selection=GPIOD_1_PIN_SEL,PTD1 (Alias:D13)>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTD1 (Alias:D13)>
//     <3=> UART2_CTS_b<selection=UART2_CTS_b_PIN_SEL,PTD1 (Alias:D13)>
//     <4=> FTM3_CH1<selection=FTM3_CH1_PIN_SEL,PTD1 (Alias:D13)>
//     <5=> FB_CS0_b<selection=FB_CS0_b_PIN_SEL,PTD1 (Alias:D13)>
//     <1=> Default
#define PTD1_SIG_SEL         1

// Signal mapping for PTD2 pin
//   <o> PTD2 (Alias:D11) [GPIOD_2/LLWU_P13, SPI0_SOUT, UART2_RX, FTM3_CH2, FB_AD4, I2C0_SCL]<name=PTD2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD2 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_2/LLWU_P13<selection=GPIOD_2_PIN_SEL,PTD2 (Alias:D11)><selection=LLWU_P13_PIN_SEL,PTD2 (Alias:D11)>
//     <2=> SPI0_SOUT<selection=SPI0_SOUT_PIN_SEL,PTD2 (Alias:D11)>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTD2 (Alias:D11)>
//     <4=> FTM3_CH2<selection=FTM3_CH2_PIN_SEL,PTD2 (Alias:D11)>
//     <5=> FB_AD4<selection=FB_AD4_PIN_SEL,PTD2 (Alias:D11)>
//     <7=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTD2 (Alias:D11)>
//     <1=> Default
#define PTD2_SIG_SEL         1

// Signal mapping for PTD3 pin
//   <o> PTD3 (Alias:D12) [GPIOD_3, SPI0_SIN, UART2_TX, FTM3_CH3, FB_AD3, I2C0_SDA]<name=PTD3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD3 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_3<selection=GPIOD_3_PIN_SEL,PTD3 (Alias:D12)>
//     <2=> SPI0_SIN<selection=SPI0_SIN_PIN_SEL,PTD3 (Alias:D12)>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTD3 (Alias:D12)>
//     <4=> FTM3_CH3<selection=FTM3_CH3_PIN_SEL,PTD3 (Alias:D12)>
//     <5=> FB_AD3<selection=FB_AD3_PIN_SEL,PTD3 (Alias:D12)>
//     <7=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTD3 (Alias:D12)>
//     <1=> Default
#define PTD3_SIG_SEL         1

// Signal mapping for PTD4 pin
//   <o> PTD4 (Alias:nRF24L01_cs) [GPIOD_4/LLWU_P14, SPI0_PCS1, UART0_RTS_b, FTM0_CH4, FB_AD2, EWM_IN, SPI1_PCS0]<name=PTD4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD4 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_4/LLWU_P14<selection=GPIOD_4_PIN_SEL,PTD4 (Alias:nRF24L01_cs)><selection=LLWU_P14_PIN_SEL,PTD4 (Alias:nRF24L01_cs)>
//     <2=> SPI0_PCS1<selection=SPI0_PCS1_PIN_SEL,PTD4 (Alias:nRF24L01_cs)>
//     <3=> UART0_RTS_b<selection=UART0_RTS_b_PIN_SEL,PTD4 (Alias:nRF24L01_cs)>
//     <4=> FTM0_CH4<selection=FTM0_CH4_PIN_SEL,PTD4 (Alias:nRF24L01_cs)>
//     <5=> FB_AD2<selection=FB_AD2_PIN_SEL,PTD4 (Alias:nRF24L01_cs)>
//     <6=> EWM_IN<selection=EWM_IN_PIN_SEL,PTD4 (Alias:nRF24L01_cs)>
//     <7=> SPI1_PCS0<selection=SPI1_PCS0_PIN_SEL,PTD4 (Alias:nRF24L01_cs)>
//     <7=> Default
#define PTD4_SIG_SEL         7

// Signal mapping for PTD5 pin
//   <o> PTD5 (Alias:nRF24L01_sck) [ADC0_SE6b, GPIOD_5, SPI0_PCS2, UART0_CTS_b/UART0_COL_b, FTM0_CH5, FB_AD1, EWM_OUT_b, SPI1_SCK]<name=PTD5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD5 pin
//     <-2=> ADC0_SE6b (reset default)<selection=ADC0_SE6b_PIN_SEL,PTD5 (Alias:nRF24L01_sck) (reset default)>
//     <0=> ADC0_SE6b<selection=ADC0_SE6b_PIN_SEL,PTD5 (Alias:nRF24L01_sck)>
//     <1=> GPIOD_5<selection=GPIOD_5_PIN_SEL,PTD5 (Alias:nRF24L01_sck)>
//     <2=> SPI0_PCS2<selection=SPI0_PCS2_PIN_SEL,PTD5 (Alias:nRF24L01_sck)>
//     <3=> UART0_CTS_b/UART0_COL_b<selection=UART0_CTS_b_PIN_SEL,PTD5 (Alias:nRF24L01_sck)><selection=UART0_COL_b_PIN_SEL,PTD5 (Alias:nRF24L01_sck)>
//     <4=> FTM0_CH5<selection=FTM0_CH5_PIN_SEL,PTD5 (Alias:nRF24L01_sck)>
//     <5=> FB_AD1<selection=FB_AD1_PIN_SEL,PTD5 (Alias:nRF24L01_sck)>
//     <6=> EWM_OUT_b<selection=EWM_OUT_b_PIN_SEL,PTD5 (Alias:nRF24L01_sck)>
//     <7=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTD5 (Alias:nRF24L01_sck)>
//     <7=> Default
#define PTD5_SIG_SEL         7

// Signal mapping for PTD6 pin
//   <o> PTD6 (Alias:nRF24L01_mosi) [ADC0_SE7b, GPIOD_6/LLWU_P15, SPI0_PCS3, UART0_RX, FTM0_CH6, FB_AD0, FTM0_FLT0, SPI1_SOUT]<name=PTD6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD6 pin
//     <-2=> ADC0_SE7b (reset default)<selection=ADC0_SE7b_PIN_SEL,PTD6 (Alias:nRF24L01_mosi) (reset default)>
//     <0=> ADC0_SE7b<selection=ADC0_SE7b_PIN_SEL,PTD6 (Alias:nRF24L01_mosi)>
//     <1=> GPIOD_6/LLWU_P15<selection=GPIOD_6_PIN_SEL,PTD6 (Alias:nRF24L01_mosi)><selection=LLWU_P15_PIN_SEL,PTD6 (Alias:nRF24L01_mosi)>
//     <2=> SPI0_PCS3<selection=SPI0_PCS3_PIN_SEL,PTD6 (Alias:nRF24L01_mosi)>
//     <3=> UART0_RX<selection=UART0_RX_PIN_SEL,PTD6 (Alias:nRF24L01_mosi)>
//     <4=> FTM0_CH6<selection=FTM0_CH6_PIN_SEL,PTD6 (Alias:nRF24L01_mosi)>
//     <5=> FB_AD0<selection=FB_AD0_PIN_SEL,PTD6 (Alias:nRF24L01_mosi)>
//     <6=> FTM0_FLT0<selection=FTM0_FLT0_PIN_SEL,PTD6 (Alias:nRF24L01_mosi)>
//     <7=> SPI1_SOUT<selection=SPI1_SOUT_PIN_SEL,PTD6 (Alias:nRF24L01_mosi)>
//     <7=> Default
#define PTD6_SIG_SEL         7

// Signal mapping for PTD7 pin
//   <o> PTD7 (Alias:nRF24L01_miso) [GPIOD_7, CMT_IRO, UART0_TX, FTM0_CH7, FTM0_FLT1, SPI1_SIN]<name=PTD7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD7 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_7<selection=GPIOD_7_PIN_SEL,PTD7 (Alias:nRF24L01_miso)>
//     <2=> CMT_IRO<selection=CMT_IRO_PIN_SEL,PTD7 (Alias:nRF24L01_miso)>
//     <3=> UART0_TX<selection=UART0_TX_PIN_SEL,PTD7 (Alias:nRF24L01_miso)>
//     <4=> FTM0_CH7<selection=FTM0_CH7_PIN_SEL,PTD7 (Alias:nRF24L01_miso)>
//     <6=> FTM0_FLT1<selection=FTM0_FLT1_PIN_SEL,PTD7 (Alias:nRF24L01_miso)>
//     <7=> SPI1_SIN<selection=SPI1_SIN_PIN_SEL,PTD7 (Alias:nRF24L01_miso)>
//     <7=> Default
#define PTD7_SIG_SEL         7

// Signal mapping for PTD8 pin
//   <o> PTD8 [GPIOD_8, I2C0_SCL, UART5_RX, FB_A16]<name=PTD8_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD8 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_8<selection=GPIOD_8_PIN_SEL,PTD8>
//     <2=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTD8>
//     <3=> UART5_RX<selection=UART5_RX_PIN_SEL,PTD8>
//     <6=> FB_A16<selection=FB_A16_PIN_SEL,PTD8>
//     <-2=> Default
#define PTD8_SIG_SEL         -2

// Signal mapping for PTD9 pin
//   <o> PTD9 [GPIOD_9, I2C0_SDA, UART5_TX, FB_A17]<name=PTD9_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD9 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_9<selection=GPIOD_9_PIN_SEL,PTD9>
//     <2=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTD9>
//     <3=> UART5_TX<selection=UART5_TX_PIN_SEL,PTD9>
//     <6=> FB_A17<selection=FB_A17_PIN_SEL,PTD9>
//     <-2=> Default
#define PTD9_SIG_SEL         -2

// Signal mapping for PTD10 pin
//   <o> PTD10 [GPIOD_10, UART5_RTS_b, FB_A18]<name=PTD10_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD10 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_10<selection=GPIOD_10_PIN_SEL,PTD10>
//     <3=> UART5_RTS_b<selection=UART5_RTS_b_PIN_SEL,PTD10>
//     <6=> FB_A18<selection=FB_A18_PIN_SEL,PTD10>
//     <-2=> Default
#define PTD10_SIG_SEL        -2

// Signal mapping for PTD11 pin
//   <o> PTD11 [GPIOD_11, SPI2_PCS0, UART5_CTS_b, SDHC0_CLKIN, FB_A19]<name=PTD11_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD11 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_11<selection=GPIOD_11_PIN_SEL,PTD11>
//     <2=> SPI2_PCS0<selection=SPI2_PCS0_PIN_SEL,PTD11>
//     <3=> UART5_CTS_b<selection=UART5_CTS_b_PIN_SEL,PTD11>
//     <4=> SDHC0_CLKIN<selection=SDHC0_CLKIN_PIN_SEL,PTD11>
//     <6=> FB_A19<selection=FB_A19_PIN_SEL,PTD11>
//     <-2=> Default
#define PTD11_SIG_SEL        -2

// Signal mapping for PTD12 pin
//   <o> PTD12 [GPIOD_12, SPI2_SCK, FTM3_FLT0, SDHC0_D4, FB_A20]<name=PTD12_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD12 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_12<selection=GPIOD_12_PIN_SEL,PTD12>
//     <2=> SPI2_SCK<selection=SPI2_SCK_PIN_SEL,PTD12>
//     <3=> FTM3_FLT0<selection=FTM3_FLT0_PIN_SEL,PTD12>
//     <4=> SDHC0_D4<selection=SDHC0_D4_PIN_SEL,PTD12>
//     <6=> FB_A20<selection=FB_A20_PIN_SEL,PTD12>
//     <-2=> Default
#define PTD12_SIG_SEL        -2

// Signal mapping for PTD13 pin
//   <o> PTD13 [GPIOD_13, SPI2_SOUT, SDHC0_D5, FB_A21]<name=PTD13_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD13 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_13<selection=GPIOD_13_PIN_SEL,PTD13>
//     <2=> SPI2_SOUT<selection=SPI2_SOUT_PIN_SEL,PTD13>
//     <4=> SDHC0_D5<selection=SDHC0_D5_PIN_SEL,PTD13>
//     <6=> FB_A21<selection=FB_A21_PIN_SEL,PTD13>
//     <-2=> Default
#define PTD13_SIG_SEL        -2

// Signal mapping for PTD14 pin
//   <o> PTD14 [GPIOD_14, SPI2_SIN, SDHC0_D6, FB_A22]<name=PTD14_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD14 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_14<selection=GPIOD_14_PIN_SEL,PTD14>
//     <2=> SPI2_SIN<selection=SPI2_SIN_PIN_SEL,PTD14>
//     <4=> SDHC0_D6<selection=SDHC0_D6_PIN_SEL,PTD14>
//     <6=> FB_A22<selection=FB_A22_PIN_SEL,PTD14>
//     <-2=> Default
#define PTD14_SIG_SEL        -2

// Signal mapping for PTD15 pin
//   <o> PTD15 [GPIOD_15, SPI2_PCS1, SDHC0_D7, FB_A23]<name=PTD15_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD15 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOD_15<selection=GPIOD_15_PIN_SEL,PTD15>
//     <2=> SPI2_PCS1<selection=SPI2_PCS1_PIN_SEL,PTD15>
//     <4=> SDHC0_D7<selection=SDHC0_D7_PIN_SEL,PTD15>
//     <6=> FB_A23<selection=FB_A23_PIN_SEL,PTD15>
//     <-2=> Default
#define PTD15_SIG_SEL        -2

