podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// </h>

// <h> Port E Pins

// Signal mapping for PTE0 pin
//   <o> PTE0 [ADC1_SE4a, GPIOE_0, SPI1_PCS1, UART1_TX, SDHC0_D1, TRACE_CLKOUT, I2C1_SDA, RTC_CLKOUT]<name=PTE0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE0 pin
//     <-2=> ADC1_SE4a (reset default)<selection=ADC1_SE4a_PIN_SEL,PTE0 (reset default)>
//     <0=> ADC1_SE4a<selection=ADC1_SE4a_PIN_SEL,PTE0>
//     <1=> GPIOE_0<selection=GPIOE_0_PIN_SEL,PTE0>
//     <2=> SPI1_PCS1<selection=SPI1_PCS1_PIN_SEL,PTE0>
//     <3=> UART1_TX<selection=UART1_TX_PIN_SEL,PTE0>
//     <4=> SDHC0_D1<selection=SDHC0_D1_PIN_SEL,PTE0>
//     <5=> TRACE_CLKOUT<selection=TRACE_CLKOUT_PIN_SEL,PTE0>
//     <6=> I2C1_SDA<selection=I2C1_SDA_PIN_SEL,PTE0>
//     <7=> RTC_CLKOUT<selection=RTC_CLKOUT_PIN_SEL,PTE0>
//     <-2=> Default
#define PTE0_SIG_SEL         -2

// Signal mapping for PTE1 pin
//   <o> PTE1 [ADC1_SE5a, GPIOE_1/LLWU_P0, SPI1_SOUT, UART1_RX, SDHC0_D0, TRACE_D3, I2C1_SCL, SPI1_SIN]<name=PTE1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE1 pin
//     <-2=> ADC1_SE5a (reset default)<selection=ADC1_SE5a_PIN_SEL,PTE1 (reset default)>
//     <0=> ADC1_SE5a<selection=ADC1_SE5a_PIN_SEL,PTE1>
//     <1=> GPIOE_1/LLWU_P0<selection=GPIOE_1_PIN_SEL,PTE1><selection=LLWU_P0_PIN_SEL,PTE1>
//     <2=> SPI1_SOUT<selection=SPI1_SOUT_PIN_SEL,PTE1>
//     <3=> UART1_RX<selection=UART1_RX_PIN_SEL,PTE1>
//     <4=> SDHC0_D0<selection=SDHC0_D0_PIN_SEL,PTE1>
//     <5=> TRACE_D3<selection=TRACE_D3_PIN_SEL,PTE1>
//     <6=> I2C1_SCL<selection=I2C1_SCL_PIN_SEL,PTE1>
//     <7=> SPI1_SIN<selection=SPI1_SIN_PIN_SEL,PTE1>
//     <-2=> Default
#define PTE1_SIG_SEL         -2

// Signal mapping for PTE2 pin
//   <o> PTE2 [ADC0_DP2/ADC1_SE6a/ADC0_SE2, GPIOE_2/LLWU_P1, SPI1_SCK, UART1_CTS_b, SDHC0_DCLK, TRACE_D2]<name=PTE2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE2 pin
//     <-2=> ADC0_DP2/ADC1_SE6a/ADC0_SE2 (reset default)<selection=ADC0_DP2_PIN_SEL,PTE2 (reset default)><selection=ADC1_SE6a_PIN_SEL,PTE2 (reset default)><selection=ADC0_SE2_PIN_SEL,PTE2 (reset default)>
//     <0=> ADC0_DP2/ADC1_SE6a/ADC0_SE2<selection=ADC0_DP2_PIN_SEL,PTE2><selection=ADC1_SE6a_PIN_SEL,PTE2><selection=ADC0_SE2_PIN_SEL,PTE2>
//     <1=> GPIOE_2/LLWU_P1<selection=GPIOE_2_PIN_SEL,PTE2><selection=LLWU_P1_PIN_SEL,PTE2>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTE2>
//     <3=> UART1_CTS_b<selection=UART1_CTS_b_PIN_SEL,PTE2>
//     <4=> SDHC0_DCLK<selection=SDHC0_DCLK_PIN_SEL,PTE2>
//     <5=> TRACE_D2<selection=TRACE_D2_PIN_SEL,PTE2>
//     <-2=> Default
#define PTE2_SIG_SEL         -2

// Signal mapping for PTE3 pin
//   <o> PTE3 [ADC0_DM2/ADC1_SE7a, GPIOE_3, SPI1_SIN, UART1_RTS_b, SDHC0_CMD, TRACE_D1, SPI1_SOUT]<name=PTE3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE3 pin
//     <-2=> ADC0_DM2/ADC1_SE7a (reset default)<selection=ADC0_DM2_PIN_SEL,PTE3 (reset default)><selection=ADC1_SE7a_PIN_SEL,PTE3 (reset default)>
//     <0=> ADC0_DM2/ADC1_SE7a<selection=ADC0_DM2_PIN_SEL,PTE3><selection=ADC1_SE7a_PIN_SEL,PTE3>
//     <1=> GPIOE_3<selection=GPIOE_3_PIN_SEL,PTE3>
//     <2=> SPI1_SIN<selection=SPI1_SIN_PIN_SEL,PTE3>
//     <3=> UART1_RTS_b<selection=UART1_RTS_b_PIN_SEL,PTE3>
//     <4=> SDHC0_CMD<selection=SDHC0_CMD_PIN_SEL,PTE3>
//     <5=> TRACE_D1<selection=TRACE_D1_PIN_SEL,PTE3>
//     <7=> SPI1_SOUT<selection=SPI1_SOUT_PIN_SEL,PTE3>
//     <-2=> Default
#define PTE3_SIG_SEL         -2

// Signal mapping for PTE4 pin
//   <o> PTE4 [GPIOE_4/LLWU_P2, SPI1_PCS0, UART3_TX, SDHC0_D3, TRACE_D0]<name=PTE4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE4 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_4/LLWU_P2<selection=GPIOE_4_PIN_SEL,PTE4><selection=LLWU_P2_PIN_SEL,PTE4>
//     <2=> SPI1_PCS0<selection=SPI1_PCS0_PIN_SEL,PTE4>
//     <3=> UART3_TX<selection=UART3_TX_PIN_SEL,PTE4>
//     <4=> SDHC0_D3<selection=SDHC0_D3_PIN_SEL,PTE4>
//     <5=> TRACE_D0<selection=TRACE_D0_PIN_SEL,PTE4>
//     <-2=> Default
#define PTE4_SIG_SEL         -2

// Signal mapping for PTE5 pin
//   <o> PTE5 [GPIOE_5, SPI1_PCS2, UART3_RX, SDHC0_D2, FTM3_CH0]<name=PTE5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE5 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_5<selection=GPIOE_5_PIN_SEL,PTE5>
//     <2=> SPI1_PCS2<selection=SPI1_PCS2_PIN_SEL,PTE5>
//     <3=> UART3_RX<selection=UART3_RX_PIN_SEL,PTE5>
//     <4=> SDHC0_D2<selection=SDHC0_D2_PIN_SEL,PTE5>
//     <6=> FTM3_CH0<selection=FTM3_CH0_PIN_SEL,PTE5>
//     <-2=> Default
#define PTE5_SIG_SEL         -2

// Signal mapping for PTE6 pin
//   <o> PTE6 [GPIOE_6, SPI1_PCS3, UART3_CTS_b, I2S0_MCLK, FTM3_CH1, USB_SOF_OUT]<name=PTE6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE6 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_6<selection=GPIOE_6_PIN_SEL,PTE6>
//     <2=> SPI1_PCS3<selection=SPI1_PCS3_PIN_SEL,PTE6>
//     <3=> UART3_CTS_b<selection=UART3_CTS_b_PIN_SEL,PTE6>
//     <4=> I2S0_MCLK<selection=I2S0_MCLK_PIN_SEL,PTE6>
//     <6=> FTM3_CH1<selection=FTM3_CH1_PIN_SEL,PTE6>
//     <7=> USB_SOF_OUT<selection=USB_SOF_OUT_PIN_SEL,PTE6>
//     <-2=> Default
#define PTE6_SIG_SEL         -2

// Signal mapping for PTE7 pin
//   <o> PTE7 [GPIOE_7, UART3_RTS_b, I2S0_RXD0, FTM3_CH2]<name=PTE7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE7 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_7<selection=GPIOE_7_PIN_SEL,PTE7>
//     <3=> UART3_RTS_b<selection=UART3_RTS_b_PIN_SEL,PTE7>
//     <4=> I2S0_RXD0<selection=I2S0_RXD0_PIN_SEL,PTE7>
//     <6=> FTM3_CH2<selection=FTM3_CH2_PIN_SEL,PTE7>
//     <-2=> Default
#define PTE7_SIG_SEL         -2

// Signal mapping for PTE8 pin
//   <o> PTE8 [GPIOE_8, I2S0_RXD1, UART5_TX, I2S0_RX_FS, FTM3_CH3]<name=PTE8_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE8 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_8<selection=GPIOE_8_PIN_SEL,PTE8>
//     <2=> I2S0_RXD1<selection=I2S0_RXD1_PIN_SEL,PTE8>
//     <3=> UART5_TX<selection=UART5_TX_PIN_SEL,PTE8>
//     <4=> I2S0_RX_FS<selection=I2S0_RX_FS_PIN_SEL,PTE8>
//     <6=> FTM3_CH3<selection=FTM3_CH3_PIN_SEL,PTE8>
//     <-2=> Default
#define PTE8_SIG_SEL         -2

// Signal mapping for PTE9 pin
//   <o> PTE9 [GPIOE_9, I2S0_TXD1, UART5_RX, I2S0_RX_BCLK, FTM3_CH4]<name=PTE9_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE9 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_9<selection=GPIOE_9_PIN_SEL,PTE9>
//     <2=> I2S0_TXD1<selection=I2S0_TXD1_PIN_SEL,PTE9>
//     <3=> UART5_RX<selection=UART5_RX_PIN_SEL,PTE9>
//     <4=> I2S0_RX_BCLK<selection=I2S0_RX_BCLK_PIN_SEL,PTE9>
//     <6=> FTM3_CH4<selection=FTM3_CH4_PIN_SEL,PTE9>
//     <-2=> Default
#define PTE9_SIG_SEL         -2

// Signal mapping for PTE10 pin
//   <o> PTE10 [GPIOE_10, UART5_CTS_b, I2S0_TXD0, FTM3_CH5]<name=PTE10_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE10 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_10<selection=GPIOE_10_PIN_SEL,PTE10>
//     <3=> UART5_CTS_b<selection=UART5_CTS_b_PIN_SEL,PTE10>
//     <4=> I2S0_TXD0<selection=I2S0_TXD0_PIN_SEL,PTE10>
//     <6=> FTM3_CH5<selection=FTM3_CH5_PIN_SEL,PTE10>
//     <-2=> Default
#define PTE10_SIG_SEL        -2

// Signal mapping for PTE11 pin
//   <o> PTE11 [GPIOE_11, UART5_RTS_b, I2S0_TX_FS, FTM3_CH6]<name=PTE11_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE11 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_11<selection=GPIOE_11_PIN_SEL,PTE11>
//     <3=> UART5_RTS_b<selection=UART5_RTS_b_PIN_SEL,PTE11>
//     <4=> I2S0_TX_FS<selection=I2S0_TX_FS_PIN_SEL,PTE11>
//     <6=> FTM3_CH6<selection=FTM3_CH6_PIN_SEL,PTE11>
//     <-2=> Default
#define PTE11_SIG_SEL        -2

// Signal mapping for PTE12 pin
//   <o> PTE12 [GPIOE_12, I2S0_TX_BCLK, FTM3_CH7]<name=PTE12_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE12 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_12<selection=GPIOE_12_PIN_SEL,PTE12>
//     <4=> I2S0_TX_BCLK<selection=I2S0_TX_BCLK_PIN_SEL,PTE12>
//     <6=> FTM3_CH7<selection=FTM3_CH7_PIN_SEL,PTE12>
//     <-2=> Default
#define PTE12_SIG_SEL        -2

// Signal mapping for PTE24 pin
//   <o> PTE24 (Alias:D15) [ADC0_SE17, GPIOE_24, UART4_TX, I2C0_SCL, EWM_OUT_b]<name=PTE24_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE24 pin
//     <-2=> ADC0_SE17 (reset default)<selection=ADC0_SE17_PIN_SEL,PTE24 (Alias:D15) (reset default)>
//     <0=> ADC0_SE17<selection=ADC0_SE17_PIN_SEL,PTE24 (Alias:D15)>
//     <1=> GPIOE_24<selection=GPIOE_24_PIN_SEL,PTE24 (Alias:D15)>
//     <3=> UART4_TX<selection=UART4_TX_PIN_SEL,PTE24 (Alias:D15)>
//     <5=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTE24 (Alias:D15)>
//     <6=> EWM_OUT_b<selection=EWM_OUT_b_PIN_SEL,PTE24 (Alias:D15)>
//     <1=> Default
#define PTE24_SIG_SEL        1

// Signal mapping for PTE25 pin
//   <o> PTE25 (Alias:D14) [ADC0_SE18, GPIOE_25, UART4_RX, I2C0_SDA, EWM_IN]<name=PTE25_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE25 pin
//     <-2=> ADC0_SE18 (reset default)<selection=ADC0_SE18_PIN_SEL,PTE25 (Alias:D14) (reset default)>
//     <0=> ADC0_SE18<selection=ADC0_SE18_PIN_SEL,PTE25 (Alias:D14)>
//     <1=> GPIOE_25<selection=GPIOE_25_PIN_SEL,PTE25 (Alias:D14)>
//     <3=> UART4_RX<selection=UART4_RX_PIN_SEL,PTE25 (Alias:D14)>
//     <5=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTE25 (Alias:D14)>
//     <6=> EWM_IN<selection=EWM_IN_PIN_SEL,PTE25 (Alias:D14)>
//     <1=> Default
#define PTE25_SIG_SEL        1

// Signal mapping for PTE26 pin
//   <o> PTE26 (Alias:LED_GREEN) [GPIOE_26, ENET_1588_CLKIN, UART4_CTS_b, RTC_CLKOUT, USB_CLKIN]<name=PTE26_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE26 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_26<selection=GPIOE_26_PIN_SEL,PTE26 (Alias:LED_GREEN)>
//     <2=> ENET_1588_CLKIN<selection=ENET_1588_CLKIN_PIN_SEL,PTE26 (Alias:LED_GREEN)>
//     <3=> UART4_CTS_b<selection=UART4_CTS_b_PIN_SEL,PTE26 (Alias:LED_GREEN)>
//     <6=> RTC_CLKOUT<selection=RTC_CLKOUT_PIN_SEL,PTE26 (Alias:LED_GREEN)>
//     <7=> USB_CLKIN<selection=USB_CLKIN_PIN_SEL,PTE26 (Alias:LED_GREEN)>
//     <1=> Default
#define PTE26_SIG_SEL        1

// Signal mapping for PTE27 pin
//   <o> PTE27 [GPIOE_27, UART4_RTS_b]<name=PTE27_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE27 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_27<selection=GPIOE_27_PIN_SEL,PTE27>
//     <3=> UART4_RTS_b<selection=UART4_RTS_b_PIN_SEL,PTE27>
//     <-2=> Default
#define PTE27_SIG_SEL        -2

// Signal mapping for PTE28 pin
//   <o> PTE28 [GPIOE_28]<name=PTE28_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE28 pin
//     <-2=> Disabled (reset default)
//     <1=> GPIOE_28<selection=GPIOE_28_PIN_SEL,PTE28>
//     <-2=> Default
#define PTE28_SIG_SEL        -2

