podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for ADC0_SE11 signal
//   <o> ADC0_SE11 [PTA8]<name=ADC0_SE11_PIN_SEL>
//   <i> Shows which pin ADC0_SE11 is mapped to
//     <0=> Disabled
//     <1=> PTA8 (reset default)<selection=PTA8_SIG_SEL,ADC0_SE11 (reset default)>
//     <2=> PTA8<selection=PTA8_SIG_SEL,ADC0_SE11>
//     <1=> Default
#define ADC0_SE11_PIN_SEL    1
#if ADC0_SE11_PIN_SEL == 2
#define ADC0_SE11_GPIO       USBDM::GpioA<8>
#define ADC0_SE11_FN         0
#endif

// Pin Mapping for ADC0_SE12 signal
//   <o> ADC0_SE12 [PTB2]<name=ADC0_SE12_PIN_SEL>
//   <i> Shows which pin ADC0_SE12 is mapped to
//     <0=> Disabled
//     <1=> PTB2 (Alias:A0) (reset default)<selection=PTB2_SIG_SEL,ADC0_SE12 (reset default)>
//     <2=> PTB2 (Alias:A0)<selection=PTB2_SIG_SEL,ADC0_SE12>
//     <2=> Default
#define ADC0_SE12_PIN_SEL    2
#if ADC0_SE12_PIN_SEL == 2
#define ADC0_SE12_GPIO       USBDM::GpioB<2>
#define ADC0_SE12_FN         0
#endif

// Pin Mapping for ADC0_SE13 signal
//   <o> ADC0_SE13 [PTB3]<name=ADC0_SE13_PIN_SEL>
//   <i> Shows which pin ADC0_SE13 is mapped to
//     <0=> Disabled
//     <1=> PTB3 (Alias:A1) (reset default)<selection=PTB3_SIG_SEL,ADC0_SE13 (reset default)>
//     <2=> PTB3 (Alias:A1)<selection=PTB3_SIG_SEL,ADC0_SE13>
//     <2=> Default
#define ADC0_SE13_PIN_SEL    2
#if ADC0_SE13_PIN_SEL == 2
#define ADC0_SE13_GPIO       USBDM::GpioB<3>
#define ADC0_SE13_FN         0
#endif

// Pin Mapping for ADC0_SE14 signal
//   <o> ADC0_SE14 [PTC0]<name=ADC0_SE14_PIN_SEL>
//   <i> Shows which pin ADC0_SE14 is mapped to
//     <0=> Disabled
//     <1=> PTC0 (reset default)<selection=PTC0_SIG_SEL,ADC0_SE14 (reset default)>
//     <2=> PTC0<selection=PTC0_SIG_SEL,ADC0_SE14>
//     <1=> Default
#define ADC0_SE14_PIN_SEL    1
#if ADC0_SE14_PIN_SEL == 2
#define ADC0_SE14_GPIO       USBDM::GpioC<0>
#define ADC0_SE14_FN         0
#endif

// Pin Mapping for ADC0_SE15 signal
//   <o> ADC0_SE15 [PTC1]<name=ADC0_SE15_PIN_SEL>
//   <i> Shows which pin ADC0_SE15 is mapped to
//     <0=> Disabled
//     <1=> PTC1 (reset default)<selection=PTC1_SIG_SEL,ADC0_SE15 (reset default)>
//     <2=> PTC1<selection=PTC1_SIG_SEL,ADC0_SE15>
//     <1=> Default
#define ADC0_SE15_PIN_SEL    1
#if ADC0_SE15_PIN_SEL == 2
#define ADC0_SE15_GPIO       USBDM::GpioC<1>
#define ADC0_SE15_FN         0
#endif

// Pin Mapping for ADC0_SE16 signal
//   <o> ADC0_SE16 [ADC0_SE16]<name=ADC0_SE16_PIN_SEL><constant>
//   <i> Shows which pin ADC0_SE16 is mapped to
//     <0=> ADC0_SE16<selection=ADC0_SE16_SIG_SEL,ADC0_SE16/CMP1_IN2/ADC0_SE21>
//     <0=> Default
#define ADC0_SE16_PIN_SEL    0
#define ADC0_SE16_GPIO       0
#define ADC0_SE16_FN         0

// Pin Mapping for ADC0_SE17 signal
//   <o> ADC0_SE17 [PTE24]<name=ADC0_SE17_PIN_SEL>
//   <i> Shows which pin ADC0_SE17 is mapped to
//     <0=> Disabled
//     <1=> PTE24 (Alias:D15) (reset default)<selection=PTE24_SIG_SEL,ADC0_SE17 (reset default)>
//     <2=> PTE24 (Alias:D15)<selection=PTE24_SIG_SEL,ADC0_SE17>
//     <0=> Default
#define ADC0_SE17_PIN_SEL    0
#if ADC0_SE17_PIN_SEL == 2
#define ADC0_SE17_GPIO       USBDM::GpioE<24>
#define ADC0_SE17_FN         0
#endif

// Pin Mapping for ADC0_SE18 signal
//   <o> ADC0_SE18 [PTE25]<name=ADC0_SE18_PIN_SEL>
//   <i> Shows which pin ADC0_SE18 is mapped to
//     <0=> Disabled
//     <1=> PTE25 (Alias:D14) (reset default)<selection=PTE25_SIG_SEL,ADC0_SE18 (reset default)>
//     <2=> PTE25 (Alias:D14)<selection=PTE25_SIG_SEL,ADC0_SE18>
//     <0=> Default
#define ADC0_SE18_PIN_SEL    0
#if ADC0_SE18_PIN_SEL == 2
#define ADC0_SE18_GPIO       USBDM::GpioE<25>
#define ADC0_SE18_FN         0
#endif

// Pin Mapping for ADC0_SE19 signal
//   <o> ADC0_SE19 [ADC0_DM0]<name=ADC0_SE19_PIN_SEL><constant>
//   <i> Shows which pin ADC0_SE19 is mapped to
//     <0=> ADC0_DM0<selection=ADC0_DM0_SIG_SEL,ADC0_DM0/ADC1_DM3/ADC0_SE19>
//     <0=> Default
#define ADC0_SE19_PIN_SEL    0
#define ADC0_SE19_GPIO       0
#define ADC0_SE19_FN         0

// Pin Mapping for ADC0_SE20 signal
//   <o> ADC0_SE20 [ADC0_DM1]<name=ADC0_SE20_PIN_SEL><constant>
//   <i> Shows which pin ADC0_SE20 is mapped to
//     <0=> ADC0_DM1<selection=ADC0_DM1_SIG_SEL,ADC0_DM1/ADC0_SE20>
//     <0=> Default
#define ADC0_SE20_PIN_SEL    0
#define ADC0_SE20_GPIO       0
#define ADC0_SE20_FN         0

// Pin Mapping for ADC0_SE21 signal
//   <o> ADC0_SE21 [ADC0_SE16]<name=ADC0_SE21_PIN_SEL><constant>
//   <i> Shows which pin ADC0_SE21 is mapped to
//     <0=> ADC0_SE16<selection=ADC0_SE16_SIG_SEL,ADC0_SE16/CMP1_IN2/ADC0_SE21>
//     <0=> Default
#define ADC0_SE21_PIN_SEL    0
#define ADC0_SE21_GPIO       0
#define ADC0_SE21_FN         0

// Pin Mapping for ADC0_SE22 signal
//   <o> ADC0_SE22 [ADC1_SE16]<name=ADC0_SE22_PIN_SEL><constant>
//   <i> Shows which pin ADC0_SE22 is mapped to
//     <0=> ADC1_SE16<selection=ADC1_SE16_SIG_SEL,ADC1_SE16/CMP2_IN2/ADC0_SE22>
//     <0=> Default
#define ADC0_SE22_PIN_SEL    0
#define ADC0_SE22_GPIO       0
#define ADC0_SE22_FN         0

// Pin Mapping for ADC0_SE23 signal
//   <o> ADC0_SE23 [ADC0_SE23]<name=ADC0_SE23_PIN_SEL><constant>
//   <i> Shows which pin ADC0_SE23 is mapped to
//     <0=> ADC0_SE23<selection=ADC0_SE23_SIG_SEL,DAC0_OUT/CMP1_IN3/ADC0_SE23>
//     <0=> Default
#define ADC0_SE23_PIN_SEL    0
#define ADC0_SE23_GPIO       0
#define ADC0_SE23_FN         0

// </h>

// <h> Analogue to Digital (ADC1)

// Pin Mapping for ADC1_DM0 signal
//   <o> ADC1_DM0 [ADC1_DM0]<name=ADC1_DM0_PIN_SEL><constant>
//   <i> Shows which pin ADC1_DM0 is mapped to
//     <0=> ADC1_DM0<selection=ADC1_DM0_SIG_SEL,ADC1_DM0/ADC0_DM3/ADC1_SE19>
//     <0=> Default
#define ADC1_DM0_PIN_SEL     0
#define ADC1_DM0_GPIO        0
#define ADC1_DM0_FN          0

// Pin Mapping for ADC1_DM1 signal
//   <o> ADC1_DM1 [ADC1_DM1]<name=ADC1_DM1_PIN_SEL><constant>
//   <i> Shows which pin ADC1_DM1 is mapped to
//     <0=> ADC1_DM1<selection=ADC1_DM1_SIG_SEL,ADC1_DM1/ADC1_SE20>
//     <0=> Default
#define ADC1_DM1_PIN_SEL     0
#define ADC1_DM1_GPIO        0
#define ADC1_DM1_FN          0

// Pin Mapping for ADC1_DM3 signal
//   <o> ADC1_DM3 [ADC0_DM0]<name=ADC1_DM3_PIN_SEL><constant>
//   <i> Shows which pin ADC1_DM3 is mapped to
//     <0=> ADC0_DM0<selection=ADC0_DM0_SIG_SEL,ADC0_DM0/ADC1_DM3/ADC0_SE19>
//     <0=> Default
#define ADC1_DM3_PIN_SEL     0
#define ADC1_DM3_GPIO        0
#define ADC1_DM3_FN          0

