podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for ADC1_DP0 signal
//   <o> ADC1_DP0 [ADC1_DP0]<name=ADC1_DP0_PIN_SEL><constant>
//   <i> Shows which pin ADC1_DP0 is mapped to
//     <0=> ADC1_DP0<selection=ADC1_DP0_SIG_SEL,ADC1_DP0/ADC0_DP3/ADC1_SE0/ADC0_SE3>
//     <0=> Default
#define ADC1_DP0_PIN_SEL     0
#define ADC1_DP0_GPIO        0
#define ADC1_DP0_FN          0

// Pin Mapping for ADC1_DP1 signal
//   <o> ADC1_DP1 [ADC1_DP1]<name=ADC1_DP1_PIN_SEL><constant>
//   <i> Shows which pin ADC1_DP1 is mapped to
//     <0=> ADC1_DP1<selection=ADC1_DP1_SIG_SEL,ADC1_DP1/ADC1_SE1>
//     <0=> Default
#define ADC1_DP1_PIN_SEL     0
#define ADC1_DP1_GPIO        0
#define ADC1_DP1_FN          0

// Pin Mapping for ADC1_DP3 signal
//   <o> ADC1_DP3 [ADC0_DP0]<name=ADC1_DP3_PIN_SEL><constant>
//   <i> Shows which pin ADC1_DP3 is mapped to
//     <0=> ADC0_DP0<selection=ADC0_DP0_SIG_SEL,ADC0_DP0/ADC1_DP3/ADC0_SE0>
//     <0=> Default
#define ADC1_DP3_PIN_SEL     0
#define ADC1_DP3_GPIO        0
#define ADC1_DP3_FN          0

// Pin Mapping for ADC1_SE0 signal
//   <o> ADC1_SE0 [ADC1_DP0]<name=ADC1_SE0_PIN_SEL><constant>
//   <i> Shows which pin ADC1_SE0 is mapped to
//     <0=> ADC1_DP0<selection=ADC1_DP0_SIG_SEL,ADC1_DP0/ADC0_DP3/ADC1_SE0/ADC0_SE3>
//     <0=> Default
#define ADC1_SE0_PIN_SEL     0
#define ADC1_SE0_GPIO        0
#define ADC1_SE0_FN          0

// Pin Mapping for ADC1_SE1 signal
//   <o> ADC1_SE1 [ADC1_DP1]<name=ADC1_SE1_PIN_SEL><constant>
//   <i> Shows which pin ADC1_SE1 is mapped to
//     <0=> ADC1_DP1<selection=ADC1_DP1_SIG_SEL,ADC1_DP1/ADC1_SE1>
//     <0=> Default
#define ADC1_SE1_PIN_SEL     0
#define ADC1_SE1_GPIO        0
#define ADC1_SE1_FN          0

// Pin Mapping for ADC1_SE4a signal
//   <o> ADC1_SE4a [PTE0]<name=ADC1_SE4a_PIN_SEL>
//   <i> Shows which pin ADC1_SE4a is mapped to
//     <0=> Disabled
//     <1=> PTE0 (reset default)<selection=PTE0_SIG_SEL,ADC1_SE4a (reset default)>
//     <2=> PTE0<selection=PTE0_SIG_SEL,ADC1_SE4a>
//     <1=> Default
#define ADC1_SE4a_PIN_SEL    1
#if ADC1_SE4a_PIN_SEL == 2
#define ADC1_SE4a_GPIO       USBDM::GpioE<0>
#define ADC1_SE4a_FN         0
#endif

// Pin Mapping for ADC1_SE4b signal
//   <o> ADC1_SE4b [PTC8]<name=ADC1_SE4b_PIN_SEL>
//   <i> Shows which pin ADC1_SE4b is mapped to
//     <0=> Disabled
//     <1=> PTC8 (reset default)<selection=PTC8_SIG_SEL,ADC1_SE4b/CMP0_IN2 (reset default)>
//     <2=> PTC8<selection=PTC8_SIG_SEL,ADC1_SE4b/CMP0_IN2>
//     <1=> Default
#define ADC1_SE4b_PIN_SEL    1
#if ADC1_SE4b_PIN_SEL == 2
#define ADC1_SE4b_GPIO       USBDM::GpioC<8>
#define ADC1_SE4b_FN         0
#endif

// Pin Mapping for ADC1_SE5a signal
//   <o> ADC1_SE5a [PTE1]<name=ADC1_SE5a_PIN_SEL>
//   <i> Shows which pin ADC1_SE5a is mapped to
//     <0=> Disabled
//     <1=> PTE1 (reset default)<selection=PTE1_SIG_SEL,ADC1_SE5a (reset default)>
//     <2=> PTE1<selection=PTE1_SIG_SEL,ADC1_SE5a>
//     <1=> Default
#define ADC1_SE5a_PIN_SEL    1
#if ADC1_SE5a_PIN_SEL == 2
#define ADC1_SE5a_GPIO       USBDM::GpioE<1>
#define ADC1_SE5a_FN         0
#endif

// Pin Mapping for ADC1_SE5b signal
//   <o> ADC1_SE5b [PTC9]<name=ADC1_SE5b_PIN_SEL>
//   <i> Shows which pin ADC1_SE5b is mapped to
//     <0=> Disabled
//     <1=> PTC9 (reset default)<selection=PTC9_SIG_SEL,ADC1_SE5b/CMP0_IN3 (reset default)>
//     <2=> PTC9<selection=PTC9_SIG_SEL,ADC1_SE5b/CMP0_IN3>
//     <1=> Default
#define ADC1_SE5b_PIN_SEL    1
#if ADC1_SE5b_PIN_SEL == 2
#define ADC1_SE5b_GPIO       USBDM::GpioC<9>
#define ADC1_SE5b_FN         0
#endif

// Pin Mapping for ADC1_SE6a signal
//   <o> ADC1_SE6a [PTE2]<name=ADC1_SE6a_PIN_SEL>
//   <i> Shows which pin ADC1_SE6a is mapped to
//     <0=> Disabled
//     <1=> PTE2 (reset default)<selection=PTE2_SIG_SEL,ADC0_DP2/ADC1_SE6a/ADC0_SE2 (reset default)>
//     <2=> PTE2<selection=PTE2_SIG_SEL,ADC0_DP2/ADC1_SE6a/ADC0_SE2>
//     <1=> Default
#define ADC1_SE6a_PIN_SEL    1
#if ADC1_SE6a_PIN_SEL == 2
#define ADC1_SE6a_GPIO       USBDM::GpioE<2>
#define ADC1_SE6a_FN         0
#endif

// Pin Mapping for ADC1_SE6b signal
//   <o> ADC1_SE6b [PTC10]<name=ADC1_SE6b_PIN_SEL>
//   <i> Shows which pin ADC1_SE6b is mapped to
//     <0=> Disabled
//     <1=> PTC10 (Alias:A5) (reset default)<selection=PTC10_SIG_SEL,ADC1_SE6b (reset default)>
//     <2=> PTC10 (Alias:A5)<selection=PTC10_SIG_SEL,ADC1_SE6b>
//     <0=> Default
#define ADC1_SE6b_PIN_SEL    0
#if ADC1_SE6b_PIN_SEL == 2
#define ADC1_SE6b_GPIO       USBDM::GpioC<10>
#define ADC1_SE6b_FN         0
#endif

// Pin Mapping for ADC1_SE7a signal
//   <o> ADC1_SE7a [PTE3]<name=ADC1_SE7a_PIN_SEL>
//   <i> Shows which pin ADC1_SE7a is mapped to
//     <0=> Disabled
//     <1=> PTE3 (reset default)<selection=PTE3_SIG_SEL,ADC0_DM2/ADC1_SE7a (reset default)>
//     <2=> PTE3<selection=PTE3_SIG_SEL,ADC0_DM2/ADC1_SE7a>
//     <1=> Default
#define ADC1_SE7a_PIN_SEL    1
#if ADC1_SE7a_PIN_SEL == 2
#define ADC1_SE7a_GPIO       USBDM::GpioE<3>
#define ADC1_SE7a_FN         0
#endif

// Pin Mapping for ADC1_SE7b signal
//   <o> ADC1_SE7b [PTC11]<name=ADC1_SE7b_PIN_SEL>
//   <i> Shows which pin ADC1_SE7b is mapped to
//     <0=> Disabled
//     <1=> PTC11 (Alias:A4) (reset default)<selection=PTC11_SIG_SEL,ADC1_SE7b (reset default)>
//     <2=> PTC11 (Alias:A4)<selection=PTC11_SIG_SEL,ADC1_SE7b>
//     <0=> Default
#define ADC1_SE7b_PIN_SEL    0
#if ADC1_SE7b_PIN_SEL == 2
#define ADC1_SE7b_GPIO       USBDM::GpioC<11>
#define ADC1_SE7b_FN         0
#endif

// Pin Mapping for ADC1_SE8 signal
//   <o> ADC1_SE8 [PTB0]<name=ADC1_SE8_PIN_SEL>
//   <i> Shows which pin ADC1_SE8 is mapped to
//     <0=> Disabled
//     <1=> PTB0 (reset default)<selection=PTB0_SIG_SEL,ADC0_SE8/ADC1_SE8 (reset default)>
//     <2=> PTB0<selection=PTB0_SIG_SEL,ADC0_SE8/ADC1_SE8>
//     <1=> Default
#define ADC1_SE8_PIN_SEL     1
#if ADC1_SE8_PIN_SEL == 2
#define ADC1_SE8_GPIO        USBDM::GpioB<0>
#define ADC1_SE8_FN          0
#endif

// Pin Mapping for ADC1_SE9 signal
//   <o> ADC1_SE9 [PTB1]<name=ADC1_SE9_PIN_SEL>
//   <i> Shows which pin ADC1_SE9 is mapped to
//     <0=> Disabled
//     <1=> PTB1 (reset default)<selection=PTB1_SIG_SEL,ADC0_SE9/ADC1_SE9 (reset default)>
//     <2=> PTB1<selection=PTB1_SIG_SEL,ADC0_SE9/ADC1_SE9>
//     <1=> Default
#define ADC1_SE9_PIN_SEL     1
#if ADC1_SE9_PIN_SEL == 2
#define ADC1_SE9_GPIO        USBDM::GpioB<1>
#define ADC1_SE9_FN          0
#endif

// Pin Mapping for ADC1_SE10 signal
//   <o> ADC1_SE10 [PTB4]<name=ADC1_SE10_PIN_SEL>
//   <i> Shows which pin ADC1_SE10 is mapped to
//     <0=> Disabled
//     <1=> PTB4 (reset default)<selection=PTB4_SIG_SEL,ADC1_SE10 (reset default)>
//     <2=> PTB4<selection=PTB4_SIG_SEL,ADC1_SE10>
//     <1=> Default
#define ADC1_SE10_PIN_SEL    1
#if ADC1_SE10_PIN_SEL == 2
#define ADC1_SE10_GPIO       USBDM::GpioB<4>
#define ADC1_SE10_FN         0
#endif

// Pin Mapping for ADC1_SE11 signal
//   <o> ADC1_SE11 [PTB5]<name=ADC1_SE11_PIN_SEL>
//   <i> Shows which pin ADC1_SE11 is mapped to
//     <0=> Disabled
//     <1=> PTB5 (reset default)<selection=PTB5_SIG_SEL,ADC1_SE11 (reset default)>
//     <2=> PTB5<selection=PTB5_SIG_SEL,ADC1_SE11>
//     <1=> Default
#define ADC1_SE11_PIN_SEL    1
#if ADC1_SE11_PIN_SEL == 2
#define ADC1_SE11_GPIO       USBDM::GpioB<5>
#define ADC1_SE11_FN         0
#endif

// Pin Mapping for ADC1_SE12 signal
//   <o> ADC1_SE12 [PTB6]<name=ADC1_SE12_PIN_SEL>
//   <i> Shows which pin ADC1_SE12 is mapped to
//     <0=> Disabled
//     <1=> PTB6 (reset default)<selection=PTB6_SIG_SEL,ADC1_SE12 (reset default)>
//     <2=> PTB6<selection=PTB6_SIG_SEL,ADC1_SE12>
//     <1=> Default
#define ADC1_SE12_PIN_SEL    1
#if ADC1_SE12_PIN_SEL == 2
#define ADC1_SE12_GPIO       USBDM::GpioB<6>
#define ADC1_SE12_FN         0
#endif

