podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for CMP2_IN1 signal
//   <o> CMP2_IN1 [PTA13]<name=CMP2_IN1_PIN_SEL>
//   <i> Shows which pin CMP2_IN1 is mapped to
//     <0=> Disabled
//     <1=> PTA13 (reset default)<selection=PTA13_SIG_SEL,CMP2_IN1 (reset default)>
//     <2=> PTA13<selection=PTA13_SIG_SEL,CMP2_IN1>
//     <1=> Default
#define CMP2_IN1_PIN_SEL     1
#if CMP2_IN1_PIN_SEL == 2
#define CMP2_IN1_GPIO        USBDM::GpioA<13>
#define CMP2_IN1_FN          0
#endif

// Pin Mapping for CMP2_IN2 signal
//   <o> CMP2_IN2 [ADC1_SE16]<name=CMP2_IN2_PIN_SEL><constant>
//   <i> Shows which pin CMP2_IN2 is mapped to
//     <0=> ADC1_SE16<selection=ADC1_SE16_SIG_SEL,ADC1_SE16/CMP2_IN2/ADC0_SE22>
//     <0=> Default
#define CMP2_IN2_PIN_SEL     0
#define CMP2_IN2_GPIO        0
#define CMP2_IN2_FN          0

// Pin Mapping for CMP2_IN3 signal
//   <o> CMP2_IN3 [ADC1_SE23]<name=CMP2_IN3_PIN_SEL><constant>
//   <i> Shows which pin CMP2_IN3 is mapped to
//     <0=> ADC1_SE23<selection=ADC1_SE23_SIG_SEL,DAC1_OUT/CMP0_IN4/CMP2_IN3/ADC1_SE23>
//     <0=> Default
#define CMP2_IN3_PIN_SEL     0
#define CMP2_IN3_GPIO        0
#define CMP2_IN3_FN          0

// Pin Mapping for CMP2_OUT signal
//   <o> CMP2_OUT [PTA5, PTB22]<name=CMP2_OUT_PIN_SEL>
//   <i> Shows which pin CMP2_OUT is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,CMP2_OUT>
//     <2=> PTB22 (Alias:LED_RED)<selection=PTB22_SIG_SEL,CMP2_OUT>
//     <0=> Default
#define CMP2_OUT_PIN_SEL     0
#if CMP2_OUT_PIN_SEL == 1
#define CMP2_OUT_GPIO        USBDM::GpioA<5>
#define CMP2_OUT_FN          5
#elif CMP2_OUT_PIN_SEL == 2
#define CMP2_OUT_GPIO        USBDM::GpioB<22>
#define CMP2_OUT_FN          6
#endif

// </h>

// <h> Carrier Modulator Transmitter (CMT)

// Pin Mapping for CMT_IRO signal
//   <o> CMT_IRO [PTD7]<name=CMT_IRO_PIN_SEL>
//   <i> Shows which pin CMT_IRO is mapped to
//     <0=> Disabled
//     <1=> PTD7 (Alias:nRF24L01_miso)<selection=PTD7_SIG_SEL,CMT_IRO>
//     <0=> Default
#define CMT_IRO_PIN_SEL      0
#if CMT_IRO_PIN_SEL == 1
#define CMT_IRO_GPIO         USBDM::GpioD<7>
#define CMT_IRO_FN           2
#endif

// </h>

// <h> Digital to Analogue (DAC0)

// Pin Mapping for DAC0_OUT signal
//   <o> DAC0_OUT [ADC0_SE23]<name=DAC0_OUT_PIN_SEL><constant>
//   <i> Shows which pin DAC0_OUT is mapped to
//     <0=> ADC0_SE23<selection=ADC0_SE23_SIG_SEL,DAC0_OUT/CMP1_IN3/ADC0_SE23>
//     <0=> Default
#define DAC0_OUT_PIN_SEL     0
#define DAC0_OUT_GPIO        0
#define DAC0_OUT_FN          0

// </h>

// <h> Digital to Analogue (DAC1)

// Pin Mapping for DAC1_OUT signal
//   <o> DAC1_OUT [ADC1_SE23]<name=DAC1_OUT_PIN_SEL><constant>
//   <i> Shows which pin DAC1_OUT is mapped to
//     <0=> ADC1_SE23<selection=ADC1_SE23_SIG_SEL,DAC1_OUT/CMP0_IN4/CMP2_IN3/ADC1_SE23>
//     <0=> Default
#define DAC1_OUT_PIN_SEL     0
#define DAC1_OUT_GPIO        0
#define DAC1_OUT_FN          0

// </h>

// <h> Ethernet (ENET0)

// Pin Mapping for ENET0_1588_TMR0 signal
//   <o> ENET0_1588_TMR0 [PTB2, PTC16]<name=ENET0_1588_TMR0_PIN_SEL>
//   <i> Shows which pin ENET0_1588_TMR0 is mapped to
//     <0=> Disabled
//     <1=> PTB2 (Alias:A0)<selection=PTB2_SIG_SEL,ENET0_1588_TMR0>
//     <2=> PTC16 (Alias:D0)<selection=PTC16_SIG_SEL,ENET0_1588_TMR0>
//     <0=> Default
#define ENET0_1588_TMR0_PIN_SEL 0
#if ENET0_1588_TMR0_PIN_SEL == 1
#define ENET0_1588_TMR0_GPIO USBDM::GpioB<2>
#define ENET0_1588_TMR0_FN   4
#elif ENET0_1588_TMR0_PIN_SEL == 2
#define ENET0_1588_TMR0_GPIO USBDM::GpioC<16>
#define ENET0_1588_TMR0_FN   4
#endif

// Pin Mapping for ENET0_1588_TMR3 signal
//   <o> ENET0_1588_TMR3 [PTB5, PTC19]<name=ENET0_1588_TMR3_PIN_SEL>
//   <i> Shows which pin ENET0_1588_TMR3 is mapped to
//     <0=> Disabled
//     <1=> PTB5<selection=PTB5_SIG_SEL,ENET0_1588_TMR3>
//     <2=> PTC19<selection=PTC19_SIG_SEL,ENET0_1588_TMR3>
//     <0=> Default
#define ENET0_1588_TMR3_PIN_SEL 0
#if ENET0_1588_TMR3_PIN_SEL == 1
#define ENET0_1588_TMR3_GPIO USBDM::GpioB<5>
#define ENET0_1588_TMR3_FN   4
#elif ENET0_1588_TMR3_PIN_SEL == 2
#define ENET0_1588_TMR3_GPIO USBDM::GpioC<19>
#define ENET0_1588_TMR3_FN   4
#endif

// Pin Mapping for ENET0_1588_TMR1 signal
//   <o> ENET0_1588_TMR1 [PTB3, PTC17]<name=ENET0_1588_TMR1_PIN_SEL>
//   <i> Shows which pin ENET0_1588_TMR1 is mapped to
//     <0=> Disabled
//     <1=> PTB3 (Alias:A1)<selection=PTB3_SIG_SEL,ENET0_1588_TMR1>
//     <2=> PTC17 (Alias:D1)<selection=PTC17_SIG_SEL,ENET0_1588_TMR1>
//     <0=> Default
#define ENET0_1588_TMR1_PIN_SEL 0
#if ENET0_1588_TMR1_PIN_SEL == 1
#define ENET0_1588_TMR1_GPIO USBDM::GpioB<3>
#define ENET0_1588_TMR1_FN   4
#elif ENET0_1588_TMR1_PIN_SEL == 2
#define ENET0_1588_TMR1_GPIO USBDM::GpioC<17>
#define ENET0_1588_TMR1_FN   4
#endif

// Pin Mapping for ENET0_1588_TMR2 signal
//   <o> ENET0_1588_TMR2 [PTB4, PTC18]<name=ENET0_1588_TMR2_PIN_SEL>
//   <i> Shows which pin ENET0_1588_TMR2 is mapped to
//     <0=> Disabled
//     <1=> PTB4<selection=PTB4_SIG_SEL,ENET0_1588_TMR2>
//     <2=> PTC18<selection=PTC18_SIG_SEL,ENET0_1588_TMR2>
//     <0=> Default
#define ENET0_1588_TMR2_PIN_SEL 0
#if ENET0_1588_TMR2_PIN_SEL == 1
#define ENET0_1588_TMR2_GPIO USBDM::GpioB<4>
#define ENET0_1588_TMR2_FN   4
#elif ENET0_1588_TMR2_PIN_SEL == 2
#define ENET0_1588_TMR2_GPIO USBDM::GpioC<18>
#define ENET0_1588_TMR2_FN   4
#endif

// </h>

// <h> Ethernet (ENET)

// Pin Mapping for ENET_1588_CLKIN signal
//   <o> ENET_1588_CLKIN [PTE26]<name=ENET_1588_CLKIN_PIN_SEL>
//   <i> Shows which pin ENET_1588_CLKIN is mapped to
//     <0=> Disabled
//     <1=> PTE26 (Alias:LED_GREEN)<selection=PTE26_SIG_SEL,ENET_1588_CLKIN>
//     <0=> Default
#define ENET_1588_CLKIN_PIN_SEL 0
#if ENET_1588_CLKIN_PIN_SEL == 1
#define ENET_1588_CLKIN_GPIO USBDM::GpioE<26>
#define ENET_1588_CLKIN_FN   2
#endif

// </h>

// <h> External Watchdog Monitor (EWM)

// Pin Mapping for EWM_IN signal
//   <o> EWM_IN [PTB16, PTD4, PTE25]<name=EWM_IN_PIN_SEL>
//   <i> Shows which pin EWM_IN is mapped to
//     <0=> Disabled
//     <1=> PTB16<selection=PTB16_SIG_SEL,EWM_IN>
//     <2=> PTD4 (Alias:nRF24L01_cs)<selection=PTD4_SIG_SEL,EWM_IN>
//     <3=> PTE25 (Alias:D14)<selection=PTE25_SIG_SEL,EWM_IN>
//     <0=> Default
#define EWM_IN_PIN_SEL       0
#if EWM_IN_PIN_SEL == 1
#define EWM_IN_GPIO          USBDM::GpioB<16>
#define EWM_IN_FN            6
#elif EWM_IN_PIN_SEL == 2
#define EWM_IN_GPIO          USBDM::GpioD<4>
#define EWM_IN_FN            6
#elif EWM_IN_PIN_SEL == 3
#define EWM_IN_GPIO          USBDM::GpioE<25>
#define EWM_IN_FN            6
#endif

