podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for EWM_OUT_b signal
//   <o> EWM_OUT_b [PTB17, PTD5, PTE24]<name=EWM_OUT_b_PIN_SEL>
//   <i> Shows which pin EWM_OUT_b is mapped to
//     <0=> Disabled
//     <1=> PTB17<selection=PTB17_SIG_SEL,EWM_OUT_b>
//     <2=> PTD5 (Alias:nRF24L01_sck)<selection=PTD5_SIG_SEL,EWM_OUT_b>
//     <3=> PTE24 (Alias:D15)<selection=PTE24_SIG_SEL,EWM_OUT_b>
//     <0=> Default
#define EWM_OUT_b_PIN_SEL    0
#if EWM_OUT_b_PIN_SEL == 1
#define EWM_OUT_b_GPIO       USBDM::GpioB<17>
#define EWM_OUT_b_FN         6
#elif EWM_OUT_b_PIN_SEL == 2
#define EWM_OUT_b_GPIO       USBDM::GpioD<5>
#define EWM_OUT_b_FN         6
#elif EWM_OUT_b_PIN_SEL == 3
#define EWM_OUT_b_GPIO       USBDM::GpioE<24>
#define EWM_OUT_b_FN         6
#endif

// </h>

// <h> Flexbus

// Pin Mapping for FB_A16 signal
//   <o> FB_A16 [PTD8]<name=FB_A16_PIN_SEL>
//   <i> Shows which pin FB_A16 is mapped to
//     <0=> Disabled
//     <1=> PTD8<selection=PTD8_SIG_SEL,FB_A16>
//     <0=> Default
#define FB_A16_PIN_SEL       0
#if FB_A16_PIN_SEL == 1
#define FB_A16_GPIO          USBDM::GpioD<8>
#define FB_A16_FN            6
#endif

// Pin Mapping for FB_A17 signal
//   <o> FB_A17 [PTD9]<name=FB_A17_PIN_SEL>
//   <i> Shows which pin FB_A17 is mapped to
//     <0=> Disabled
//     <1=> PTD9<selection=PTD9_SIG_SEL,FB_A17>
//     <0=> Default
#define FB_A17_PIN_SEL       0
#if FB_A17_PIN_SEL == 1
#define FB_A17_GPIO          USBDM::GpioD<9>
#define FB_A17_FN            6
#endif

// Pin Mapping for FB_A18 signal
//   <o> FB_A18 [PTD10]<name=FB_A18_PIN_SEL>
//   <i> Shows which pin FB_A18 is mapped to
//     <0=> Disabled
//     <1=> PTD10<selection=PTD10_SIG_SEL,FB_A18>
//     <0=> Default
#define FB_A18_PIN_SEL       0
#if FB_A18_PIN_SEL == 1
#define FB_A18_GPIO          USBDM::GpioD<10>
#define FB_A18_FN            6
#endif

// Pin Mapping for FB_A19 signal
//   <o> FB_A19 [PTD11]<name=FB_A19_PIN_SEL>
//   <i> Shows which pin FB_A19 is mapped to
//     <0=> Disabled
//     <1=> PTD11<selection=PTD11_SIG_SEL,FB_A19>
//     <0=> Default
#define FB_A19_PIN_SEL       0
#if FB_A19_PIN_SEL == 1
#define FB_A19_GPIO          USBDM::GpioD<11>
#define FB_A19_FN            6
#endif

// Pin Mapping for FB_A20 signal
//   <o> FB_A20 [PTD12]<name=FB_A20_PIN_SEL>
//   <i> Shows which pin FB_A20 is mapped to
//     <0=> Disabled
//     <1=> PTD12<selection=PTD12_SIG_SEL,FB_A20>
//     <0=> Default
#define FB_A20_PIN_SEL       0
#if FB_A20_PIN_SEL == 1
#define FB_A20_GPIO          USBDM::GpioD<12>
#define FB_A20_FN            6
#endif

// Pin Mapping for FB_A21 signal
//   <o> FB_A21 [PTD13]<name=FB_A21_PIN_SEL>
//   <i> Shows which pin FB_A21 is mapped to
//     <0=> Disabled
//     <1=> PTD13<selection=PTD13_SIG_SEL,FB_A21>
//     <0=> Default
#define FB_A21_PIN_SEL       0
#if FB_A21_PIN_SEL == 1
#define FB_A21_GPIO          USBDM::GpioD<13>
#define FB_A21_FN            6
#endif

// Pin Mapping for FB_A22 signal
//   <o> FB_A22 [PTD14]<name=FB_A22_PIN_SEL>
//   <i> Shows which pin FB_A22 is mapped to
//     <0=> Disabled
//     <1=> PTD14<selection=PTD14_SIG_SEL,FB_A22>
//     <0=> Default
#define FB_A22_PIN_SEL       0
#if FB_A22_PIN_SEL == 1
#define FB_A22_GPIO          USBDM::GpioD<14>
#define FB_A22_FN            6
#endif

// Pin Mapping for FB_A23 signal
//   <o> FB_A23 [PTD15]<name=FB_A23_PIN_SEL>
//   <i> Shows which pin FB_A23 is mapped to
//     <0=> Disabled
//     <1=> PTD15<selection=PTD15_SIG_SEL,FB_A23>
//     <0=> Default
#define FB_A23_PIN_SEL       0
#if FB_A23_PIN_SEL == 1
#define FB_A23_GPIO          USBDM::GpioD<15>
#define FB_A23_FN            6
#endif

// Pin Mapping for FB_A24 signal
//   <o> FB_A24 [PTA29]<name=FB_A24_PIN_SEL>
//   <i> Shows which pin FB_A24 is mapped to
//     <0=> Disabled
//     <1=> PTA29<selection=PTA29_SIG_SEL,FB_A24>
//     <0=> Default
#define FB_A24_PIN_SEL       0
#if FB_A24_PIN_SEL == 1
#define FB_A24_GPIO          USBDM::GpioA<29>
#define FB_A24_FN            6
#endif

// Pin Mapping for FB_A25 signal
//   <o> FB_A25 [PTA28]<name=FB_A25_PIN_SEL>
//   <i> Shows which pin FB_A25 is mapped to
//     <0=> Disabled
//     <1=> PTA28<selection=PTA28_SIG_SEL,FB_A25>
//     <0=> Default
#define FB_A25_PIN_SEL       0
#if FB_A25_PIN_SEL == 1
#define FB_A25_GPIO          USBDM::GpioA<28>
#define FB_A25_FN            6
#endif

// Pin Mapping for FB_A26 signal
//   <o> FB_A26 [PTA27]<name=FB_A26_PIN_SEL>
//   <i> Shows which pin FB_A26 is mapped to
//     <0=> Disabled
//     <1=> PTA27<selection=PTA27_SIG_SEL,FB_A26>
//     <0=> Default
#define FB_A26_PIN_SEL       0
#if FB_A26_PIN_SEL == 1
#define FB_A26_GPIO          USBDM::GpioA<27>
#define FB_A26_FN            6
#endif

// Pin Mapping for FB_A27 signal
//   <o> FB_A27 [PTA26]<name=FB_A27_PIN_SEL>
//   <i> Shows which pin FB_A27 is mapped to
//     <0=> Disabled
//     <1=> PTA26<selection=PTA26_SIG_SEL,FB_A27>
//     <0=> Default
#define FB_A27_PIN_SEL       0
#if FB_A27_PIN_SEL == 1
#define FB_A27_GPIO          USBDM::GpioA<26>
#define FB_A27_FN            6
#endif

// Pin Mapping for FB_A28 signal
//   <o> FB_A28 [PTA25]<name=FB_A28_PIN_SEL>
//   <i> Shows which pin FB_A28 is mapped to
//     <0=> Disabled
//     <1=> PTA25<selection=PTA25_SIG_SEL,FB_A28>
//     <0=> Default
#define FB_A28_PIN_SEL       0
#if FB_A28_PIN_SEL == 1
#define FB_A28_GPIO          USBDM::GpioA<25>
#define FB_A28_FN            6
#endif

// Pin Mapping for FB_A29 signal
//   <o> FB_A29 [PTA24]<name=FB_A29_PIN_SEL>
//   <i> Shows which pin FB_A29 is mapped to
//     <0=> Disabled
//     <1=> PTA24<selection=PTA24_SIG_SEL,FB_A29>
//     <0=> Default
#define FB_A29_PIN_SEL       0
#if FB_A29_PIN_SEL == 1
#define FB_A29_GPIO          USBDM::GpioA<24>
#define FB_A29_FN            6
#endif

// Pin Mapping for FB_AD0 signal
//   <o> FB_AD0 [PTD6]<name=FB_AD0_PIN_SEL>
//   <i> Shows which pin FB_AD0 is mapped to
//     <0=> Disabled
//     <1=> PTD6 (Alias:nRF24L01_mosi)<selection=PTD6_SIG_SEL,FB_AD0>
//     <0=> Default
#define FB_AD0_PIN_SEL       0
#if FB_AD0_PIN_SEL == 1
#define FB_AD0_GPIO          USBDM::GpioD<6>
#define FB_AD0_FN            5
#endif

// Pin Mapping for FB_AD1 signal
//   <o> FB_AD1 [PTD5]<name=FB_AD1_PIN_SEL>
//   <i> Shows which pin FB_AD1 is mapped to
//     <0=> Disabled
//     <1=> PTD5 (Alias:nRF24L01_sck)<selection=PTD5_SIG_SEL,FB_AD1>
//     <0=> Default
#define FB_AD1_PIN_SEL       0
#if FB_AD1_PIN_SEL == 1
#define FB_AD1_GPIO          USBDM::GpioD<5>
#define FB_AD1_FN            5
#endif

