podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for FB_AD2 signal
//   <o> FB_AD2 [PTD4]<name=FB_AD2_PIN_SEL>
//   <i> Shows which pin FB_AD2 is mapped to
//     <0=> Disabled
//     <1=> PTD4 (Alias:nRF24L01_cs)<selection=PTD4_SIG_SEL,FB_AD2>
//     <0=> Default
#define FB_AD2_PIN_SEL       0
#if FB_AD2_PIN_SEL == 1
#define FB_AD2_GPIO          USBDM::GpioD<4>
#define FB_AD2_FN            5
#endif

// Pin Mapping for FB_AD3 signal
//   <o> FB_AD3 [PTD3]<name=FB_AD3_PIN_SEL>
//   <i> Shows which pin FB_AD3 is mapped to
//     <0=> Disabled
//     <1=> PTD3 (Alias:D12)<selection=PTD3_SIG_SEL,FB_AD3>
//     <0=> Default
#define FB_AD3_PIN_SEL       0
#if FB_AD3_PIN_SEL == 1
#define FB_AD3_GPIO          USBDM::GpioD<3>
#define FB_AD3_FN            5
#endif

// Pin Mapping for FB_AD4 signal
//   <o> FB_AD4 [PTD2]<name=FB_AD4_PIN_SEL>
//   <i> Shows which pin FB_AD4 is mapped to
//     <0=> Disabled
//     <1=> PTD2 (Alias:D11)<selection=PTD2_SIG_SEL,FB_AD4>
//     <0=> Default
#define FB_AD4_PIN_SEL       0
#if FB_AD4_PIN_SEL == 1
#define FB_AD4_GPIO          USBDM::GpioD<2>
#define FB_AD4_FN            5
#endif

// Pin Mapping for FB_AD5 signal
//   <o> FB_AD5 [PTC10]<name=FB_AD5_PIN_SEL>
//   <i> Shows which pin FB_AD5 is mapped to
//     <0=> Disabled
//     <1=> PTC10 (Alias:A5)<selection=PTC10_SIG_SEL,FB_AD5>
//     <0=> Default
#define FB_AD5_PIN_SEL       0
#if FB_AD5_PIN_SEL == 1
#define FB_AD5_GPIO          USBDM::GpioC<10>
#define FB_AD5_FN            5
#endif

// Pin Mapping for FB_AD6 signal
//   <o> FB_AD6 [PTC9]<name=FB_AD6_PIN_SEL>
//   <i> Shows which pin FB_AD6 is mapped to
//     <0=> Disabled
//     <1=> PTC9<selection=PTC9_SIG_SEL,FB_AD6>
//     <0=> Default
#define FB_AD6_PIN_SEL       0
#if FB_AD6_PIN_SEL == 1
#define FB_AD6_GPIO          USBDM::GpioC<9>
#define FB_AD6_FN            5
#endif

// Pin Mapping for FB_AD7 signal
//   <o> FB_AD7 [PTC8]<name=FB_AD7_PIN_SEL>
//   <i> Shows which pin FB_AD7 is mapped to
//     <0=> Disabled
//     <1=> PTC8<selection=PTC8_SIG_SEL,FB_AD7>
//     <0=> Default
#define FB_AD7_PIN_SEL       0
#if FB_AD7_PIN_SEL == 1
#define FB_AD7_GPIO          USBDM::GpioC<8>
#define FB_AD7_FN            5
#endif

// Pin Mapping for FB_AD8 signal
//   <o> FB_AD8 [PTC7]<name=FB_AD8_PIN_SEL>
//   <i> Shows which pin FB_AD8 is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,FB_AD8>
//     <0=> Default
#define FB_AD8_PIN_SEL       0
#if FB_AD8_PIN_SEL == 1
#define FB_AD8_GPIO          USBDM::GpioC<7>
#define FB_AD8_FN            5
#endif

// Pin Mapping for FB_AD9 signal
//   <o> FB_AD9 [PTC6]<name=FB_AD9_PIN_SEL>
//   <i> Shows which pin FB_AD9 is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,FB_AD9>
//     <0=> Default
#define FB_AD9_PIN_SEL       0
#if FB_AD9_PIN_SEL == 1
#define FB_AD9_GPIO          USBDM::GpioC<6>
#define FB_AD9_FN            5
#endif

// Pin Mapping for FB_AD10 signal
//   <o> FB_AD10 [PTC5]<name=FB_AD10_PIN_SEL>
//   <i> Shows which pin FB_AD10 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,FB_AD10>
//     <0=> Default
#define FB_AD10_PIN_SEL      0
#if FB_AD10_PIN_SEL == 1
#define FB_AD10_GPIO         USBDM::GpioC<5>
#define FB_AD10_FN           5
#endif

// Pin Mapping for FB_AD11 signal
//   <o> FB_AD11 [PTC4]<name=FB_AD11_PIN_SEL>
//   <i> Shows which pin FB_AD11 is mapped to
//     <0=> Disabled
//     <1=> PTC4 (Alias:D9)<selection=PTC4_SIG_SEL,FB_AD11>
//     <0=> Default
#define FB_AD11_PIN_SEL      0
#if FB_AD11_PIN_SEL == 1
#define FB_AD11_GPIO         USBDM::GpioC<4>
#define FB_AD11_FN           5
#endif

// Pin Mapping for FB_AD12 signal
//   <o> FB_AD12 [PTC2]<name=FB_AD12_PIN_SEL>
//   <i> Shows which pin FB_AD12 is mapped to
//     <0=> Disabled
//     <1=> PTC2 (Alias:D6)<selection=PTC2_SIG_SEL,FB_AD12>
//     <0=> Default
#define FB_AD12_PIN_SEL      0
#if FB_AD12_PIN_SEL == 1
#define FB_AD12_GPIO         USBDM::GpioC<2>
#define FB_AD12_FN           5
#endif

// Pin Mapping for FB_AD13 signal
//   <o> FB_AD13 [PTC1]<name=FB_AD13_PIN_SEL>
//   <i> Shows which pin FB_AD13 is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,FB_AD13>
//     <0=> Default
#define FB_AD13_PIN_SEL      0
#if FB_AD13_PIN_SEL == 1
#define FB_AD13_GPIO         USBDM::GpioC<1>
#define FB_AD13_FN           5
#endif

// Pin Mapping for FB_AD14 signal
//   <o> FB_AD14 [PTC0]<name=FB_AD14_PIN_SEL>
//   <i> Shows which pin FB_AD14 is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,FB_AD14>
//     <0=> Default
#define FB_AD14_PIN_SEL      0
#if FB_AD14_PIN_SEL == 1
#define FB_AD14_GPIO         USBDM::GpioC<0>
#define FB_AD14_FN           5
#endif

// Pin Mapping for FB_AD15 signal
//   <o> FB_AD15 [PTB18]<name=FB_AD15_PIN_SEL>
//   <i> Shows which pin FB_AD15 is mapped to
//     <0=> Disabled
//     <1=> PTB18<selection=PTB18_SIG_SEL,FB_AD15>
//     <0=> Default
#define FB_AD15_PIN_SEL      0
#if FB_AD15_PIN_SEL == 1
#define FB_AD15_GPIO         USBDM::GpioB<18>
#define FB_AD15_FN           5
#endif

// Pin Mapping for FB_AD16 signal
//   <o> FB_AD16 [PTB17]<name=FB_AD16_PIN_SEL>
//   <i> Shows which pin FB_AD16 is mapped to
//     <0=> Disabled
//     <1=> PTB17<selection=PTB17_SIG_SEL,FB_AD16>
//     <0=> Default
#define FB_AD16_PIN_SEL      0
#if FB_AD16_PIN_SEL == 1
#define FB_AD16_GPIO         USBDM::GpioB<17>
#define FB_AD16_FN           5
#endif

// Pin Mapping for FB_AD17 signal
//   <o> FB_AD17 [PTB16]<name=FB_AD17_PIN_SEL>
//   <i> Shows which pin FB_AD17 is mapped to
//     <0=> Disabled
//     <1=> PTB16<selection=PTB16_SIG_SEL,FB_AD17>
//     <0=> Default
#define FB_AD17_PIN_SEL      0
#if FB_AD17_PIN_SEL == 1
#define FB_AD17_GPIO         USBDM::GpioB<16>
#define FB_AD17_FN           5
#endif

// Pin Mapping for FB_AD18 signal
//   <o> FB_AD18 [PTB11]<name=FB_AD18_PIN_SEL>
//   <i> Shows which pin FB_AD18 is mapped to
//     <0=> Disabled
//     <1=> PTB11 (Alias:A3)<selection=PTB11_SIG_SEL,FB_AD18>
//     <0=> Default
#define FB_AD18_PIN_SEL      0
#if FB_AD18_PIN_SEL == 1
#define FB_AD18_GPIO         USBDM::GpioB<11>
#define FB_AD18_FN           5
#endif

// Pin Mapping for FB_AD19 signal
//   <o> FB_AD19 [PTB10]<name=FB_AD19_PIN_SEL>
//   <i> Shows which pin FB_AD19 is mapped to
//     <0=> Disabled
//     <1=> PTB10 (Alias:A2)<selection=PTB10_SIG_SEL,FB_AD19>
//     <0=> Default
#define FB_AD19_PIN_SEL      0
#if FB_AD19_PIN_SEL == 1
#define FB_AD19_GPIO         USBDM::GpioB<10>
#define FB_AD19_FN           5
#endif

// Pin Mapping for FB_AD20 signal
//   <o> FB_AD20 [PTB9]<name=FB_AD20_PIN_SEL>
//   <i> Shows which pin FB_AD20 is mapped to
//     <0=> Disabled
//     <1=> PTB9 (Alias:D2)<selection=PTB9_SIG_SEL,FB_AD20>
//     <0=> Default
#define FB_AD20_PIN_SEL      0
#if FB_AD20_PIN_SEL == 1
#define FB_AD20_GPIO         USBDM::GpioB<9>
#define FB_AD20_FN           5
#endif

// Pin Mapping for FB_AD21 signal
//   <o> FB_AD21 [PTB8]<name=FB_AD21_PIN_SEL>
//   <i> Shows which pin FB_AD21 is mapped to
//     <0=> Disabled
//     <1=> PTB8<selection=PTB8_SIG_SEL,FB_AD21>
//     <0=> Default
#define FB_AD21_PIN_SEL      0
#if FB_AD21_PIN_SEL == 1
#define FB_AD21_GPIO         USBDM::GpioB<8>
#define FB_AD21_FN           5
#endif

