podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for FB_AD22 signal
//   <o> FB_AD22 [PTB7]<name=FB_AD22_PIN_SEL>
//   <i> Shows which pin FB_AD22 is mapped to
//     <0=> Disabled
//     <1=> PTB7<selection=PTB7_SIG_SEL,FB_AD22>
//     <0=> Default
#define FB_AD22_PIN_SEL      0
#if FB_AD22_PIN_SEL == 1
#define FB_AD22_GPIO         USBDM::GpioB<7>
#define FB_AD22_FN           5
#endif

// Pin Mapping for FB_AD23 signal
//   <o> FB_AD23 [PTB6]<name=FB_AD23_PIN_SEL>
//   <i> Shows which pin FB_AD23 is mapped to
//     <0=> Disabled
//     <1=> PTB6<selection=PTB6_SIG_SEL,FB_AD23>
//     <0=> Default
#define FB_AD23_PIN_SEL      0
#if FB_AD23_PIN_SEL == 1
#define FB_AD23_GPIO         USBDM::GpioB<6>
#define FB_AD23_FN           5
#endif

// Pin Mapping for FB_AD24 signal
//   <o> FB_AD24 [PTC15]<name=FB_AD24_PIN_SEL>
//   <i> Shows which pin FB_AD24 is mapped to
//     <0=> Disabled
//     <1=> PTC15<selection=PTC15_SIG_SEL,FB_AD24>
//     <0=> Default
#define FB_AD24_PIN_SEL      0
#if FB_AD24_PIN_SEL == 1
#define FB_AD24_GPIO         USBDM::GpioC<15>
#define FB_AD24_FN           5
#endif

// Pin Mapping for FB_AD25 signal
//   <o> FB_AD25 [PTC14]<name=FB_AD25_PIN_SEL>
//   <i> Shows which pin FB_AD25 is mapped to
//     <0=> Disabled
//     <1=> PTC14<selection=PTC14_SIG_SEL,FB_AD25>
//     <0=> Default
#define FB_AD25_PIN_SEL      0
#if FB_AD25_PIN_SEL == 1
#define FB_AD25_GPIO         USBDM::GpioC<14>
#define FB_AD25_FN           5
#endif

// Pin Mapping for FB_AD26 signal
//   <o> FB_AD26 [PTC13]<name=FB_AD26_PIN_SEL>
//   <i> Shows which pin FB_AD26 is mapped to
//     <0=> Disabled
//     <1=> PTC13<selection=PTC13_SIG_SEL,FB_AD26>
//     <0=> Default
#define FB_AD26_PIN_SEL      0
#if FB_AD26_PIN_SEL == 1
#define FB_AD26_GPIO         USBDM::GpioC<13>
#define FB_AD26_FN           5
#endif

// Pin Mapping for FB_AD27 signal
//   <o> FB_AD27 [PTC12]<name=FB_AD27_PIN_SEL>
//   <i> Shows which pin FB_AD27 is mapped to
//     <0=> Disabled
//     <1=> PTC12<selection=PTC12_SIG_SEL,FB_AD27>
//     <0=> Default
#define FB_AD27_PIN_SEL      0
#if FB_AD27_PIN_SEL == 1
#define FB_AD27_GPIO         USBDM::GpioC<12>
#define FB_AD27_FN           5
#endif

// Pin Mapping for FB_AD28 signal
//   <o> FB_AD28 [PTB23]<name=FB_AD28_PIN_SEL>
//   <i> Shows which pin FB_AD28 is mapped to
//     <0=> Disabled
//     <1=> PTB23 (Alias:D4)<selection=PTB23_SIG_SEL,FB_AD28>
//     <0=> Default
#define FB_AD28_PIN_SEL      0
#if FB_AD28_PIN_SEL == 1
#define FB_AD28_GPIO         USBDM::GpioB<23>
#define FB_AD28_FN           5
#endif

// Pin Mapping for FB_AD29 signal
//   <o> FB_AD29 [PTB22]<name=FB_AD29_PIN_SEL>
//   <i> Shows which pin FB_AD29 is mapped to
//     <0=> Disabled
//     <1=> PTB22 (Alias:LED_RED)<selection=PTB22_SIG_SEL,FB_AD29>
//     <0=> Default
#define FB_AD29_PIN_SEL      0
#if FB_AD29_PIN_SEL == 1
#define FB_AD29_GPIO         USBDM::GpioB<22>
#define FB_AD29_FN           5
#endif

// Pin Mapping for FB_AD30 signal
//   <o> FB_AD30 [PTB21]<name=FB_AD30_PIN_SEL>
//   <i> Shows which pin FB_AD30 is mapped to
//     <0=> Disabled
//     <1=> PTB21 (Alias:LED_BLUE)<selection=PTB21_SIG_SEL,FB_AD30>
//     <0=> Default
#define FB_AD30_PIN_SEL      0
#if FB_AD30_PIN_SEL == 1
#define FB_AD30_GPIO         USBDM::GpioB<21>
#define FB_AD30_FN           5
#endif

// Pin Mapping for FB_AD31 signal
//   <o> FB_AD31 [PTB20]<name=FB_AD31_PIN_SEL>
//   <i> Shows which pin FB_AD31 is mapped to
//     <0=> Disabled
//     <1=> PTB20<selection=PTB20_SIG_SEL,FB_AD31>
//     <0=> Default
#define FB_AD31_PIN_SEL      0
#if FB_AD31_PIN_SEL == 1
#define FB_AD31_GPIO         USBDM::GpioB<20>
#define FB_AD31_FN           5
#endif

// Pin Mapping for FB_ALE signal
//   <o> FB_ALE [PTD0]<name=FB_ALE_PIN_SEL>
//   <i> Shows which pin FB_ALE is mapped to
//     <0=> Disabled
//     <1=> PTD0 (Alias:D10)<selection=PTD0_SIG_SEL,FB_ALE/FB_CS1_b/FB_TS_b>
//     <0=> Default
#define FB_ALE_PIN_SEL       0
#if FB_ALE_PIN_SEL == 1
#define FB_ALE_GPIO          USBDM::GpioD<0>
#define FB_ALE_FN            5
#endif

// Pin Mapping for FB_BE7_0_BLS31_24_b signal
//   <o> FB_BE7_0_BLS31_24_b [PTC19]<name=FB_BE7_0_BLS31_24_b_PIN_SEL>
//   <i> Shows which pin FB_BE7_0_BLS31_24_b is mapped to
//     <0=> Disabled
//     <1=> PTC19<selection=PTC19_SIG_SEL,FB_CS3_b/FB_BE7_0_BLS31_24_b>
//     <0=> Default
#define FB_BE7_0_BLS31_24_b_PIN_SEL 0
#if FB_BE7_0_BLS31_24_b_PIN_SEL == 1
#define FB_BE7_0_BLS31_24_b_GPIO USBDM::GpioC<19>
#define FB_BE7_0_BLS31_24_b_FN 5
#endif

// Pin Mapping for FB_BE15_8_BLS23_16_b signal
//   <o> FB_BE15_8_BLS23_16_b [PTC18]<name=FB_BE15_8_BLS23_16_b_PIN_SEL>
//   <i> Shows which pin FB_BE15_8_BLS23_16_b is mapped to
//     <0=> Disabled
//     <1=> PTC18<selection=PTC18_SIG_SEL,FB_TBST_b/FB_CS2_b/FB_BE15_8_BLS23_16_b>
//     <0=> Default
#define FB_BE15_8_BLS23_16_b_PIN_SEL 0
#if FB_BE15_8_BLS23_16_b_PIN_SEL == 1
#define FB_BE15_8_BLS23_16_b_GPIO USBDM::GpioC<18>
#define FB_BE15_8_BLS23_16_b_FN 5
#endif

// Pin Mapping for FB_BE23_16_BLS15_8_b signal
//   <o> FB_BE23_16_BLS15_8_b [PTC16]<name=FB_BE23_16_BLS15_8_b_PIN_SEL>
//   <i> Shows which pin FB_BE23_16_BLS15_8_b is mapped to
//     <0=> Disabled
//     <1=> PTC16 (Alias:D0)<selection=PTC16_SIG_SEL,FB_CS5_b/FB_TSIZ1/FB_BE23_16_BLS15_8_b>
//     <0=> Default
#define FB_BE23_16_BLS15_8_b_PIN_SEL 0
#if FB_BE23_16_BLS15_8_b_PIN_SEL == 1
#define FB_BE23_16_BLS15_8_b_GPIO USBDM::GpioC<16>
#define FB_BE23_16_BLS15_8_b_FN 5
#endif

// Pin Mapping for FB_BE31_24_BLS7_0_b signal
//   <o> FB_BE31_24_BLS7_0_b [PTC17]<name=FB_BE31_24_BLS7_0_b_PIN_SEL>
//   <i> Shows which pin FB_BE31_24_BLS7_0_b is mapped to
//     <0=> Disabled
//     <1=> PTC17 (Alias:D1)<selection=PTC17_SIG_SEL,FB_CS4_b/FB_TSIZ0/FB_BE31_24_BLS7_0_b>
//     <0=> Default
#define FB_BE31_24_BLS7_0_b_PIN_SEL 0
#if FB_BE31_24_BLS7_0_b_PIN_SEL == 1
#define FB_BE31_24_BLS7_0_b_GPIO USBDM::GpioC<17>
#define FB_BE31_24_BLS7_0_b_FN 5
#endif

// Pin Mapping for FB_CS0_b signal
//   <o> FB_CS0_b [PTD1]<name=FB_CS0_b_PIN_SEL>
//   <i> Shows which pin FB_CS0_b is mapped to
//     <0=> Disabled
//     <1=> PTD1 (Alias:D13)<selection=PTD1_SIG_SEL,FB_CS0_b>
//     <0=> Default
#define FB_CS0_b_PIN_SEL     0
#if FB_CS0_b_PIN_SEL == 1
#define FB_CS0_b_GPIO        USBDM::GpioD<1>
#define FB_CS0_b_FN          5
#endif

// Pin Mapping for FB_CS1_b signal
//   <o> FB_CS1_b [PTD0]<name=FB_CS1_b_PIN_SEL>
//   <i> Shows which pin FB_CS1_b is mapped to
//     <0=> Disabled
//     <1=> PTD0 (Alias:D10)<selection=PTD0_SIG_SEL,FB_ALE/FB_CS1_b/FB_TS_b>
//     <0=> Default
#define FB_CS1_b_PIN_SEL     0
#if FB_CS1_b_PIN_SEL == 1
#define FB_CS1_b_GPIO        USBDM::GpioD<0>
#define FB_CS1_b_FN          5
#endif

