podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for FB_CS2_b signal
//   <o> FB_CS2_b [PTC18]<name=FB_CS2_b_PIN_SEL>
//   <i> Shows which pin FB_CS2_b is mapped to
//     <0=> Disabled
//     <1=> PTC18<selection=PTC18_SIG_SEL,FB_TBST_b/FB_CS2_b/FB_BE15_8_BLS23_16_b>
//     <0=> Default
#define FB_CS2_b_PIN_SEL     0
#if FB_CS2_b_PIN_SEL == 1
#define FB_CS2_b_GPIO        USBDM::GpioC<18>
#define FB_CS2_b_FN          5
#endif

// Pin Mapping for FB_CS3_b signal
//   <o> FB_CS3_b [PTC19]<name=FB_CS3_b_PIN_SEL>
//   <i> Shows which pin FB_CS3_b is mapped to
//     <0=> Disabled
//     <1=> PTC19<selection=PTC19_SIG_SEL,FB_CS3_b/FB_BE7_0_BLS31_24_b>
//     <0=> Default
#define FB_CS3_b_PIN_SEL     0
#if FB_CS3_b_PIN_SEL == 1
#define FB_CS3_b_GPIO        USBDM::GpioC<19>
#define FB_CS3_b_FN          5
#endif

// Pin Mapping for FB_CS4_b signal
//   <o> FB_CS4_b [PTC17]<name=FB_CS4_b_PIN_SEL>
//   <i> Shows which pin FB_CS4_b is mapped to
//     <0=> Disabled
//     <1=> PTC17 (Alias:D1)<selection=PTC17_SIG_SEL,FB_CS4_b/FB_TSIZ0/FB_BE31_24_BLS7_0_b>
//     <0=> Default
#define FB_CS4_b_PIN_SEL     0
#if FB_CS4_b_PIN_SEL == 1
#define FB_CS4_b_GPIO        USBDM::GpioC<17>
#define FB_CS4_b_FN          5
#endif

// Pin Mapping for FB_CS5_b signal
//   <o> FB_CS5_b [PTC16]<name=FB_CS5_b_PIN_SEL>
//   <i> Shows which pin FB_CS5_b is mapped to
//     <0=> Disabled
//     <1=> PTC16 (Alias:D0)<selection=PTC16_SIG_SEL,FB_CS5_b/FB_TSIZ1/FB_BE23_16_BLS15_8_b>
//     <0=> Default
#define FB_CS5_b_PIN_SEL     0
#if FB_CS5_b_PIN_SEL == 1
#define FB_CS5_b_GPIO        USBDM::GpioC<16>
#define FB_CS5_b_FN          5
#endif

// Pin Mapping for FB_OE_b signal
//   <o> FB_OE_b [PTB19]<name=FB_OE_b_PIN_SEL>
//   <i> Shows which pin FB_OE_b is mapped to
//     <0=> Disabled
//     <1=> PTB19<selection=PTB19_SIG_SEL,FB_OE_b>
//     <0=> Default
#define FB_OE_b_PIN_SEL      0
#if FB_OE_b_PIN_SEL == 1
#define FB_OE_b_GPIO         USBDM::GpioB<19>
#define FB_OE_b_FN           5
#endif

// Pin Mapping for FB_RW_b signal
//   <o> FB_RW_b [PTC11]<name=FB_RW_b_PIN_SEL>
//   <i> Shows which pin FB_RW_b is mapped to
//     <0=> Disabled
//     <1=> PTC11 (Alias:A4)<selection=PTC11_SIG_SEL,FB_RW_b>
//     <0=> Default
#define FB_RW_b_PIN_SEL      0
#if FB_RW_b_PIN_SEL == 1
#define FB_RW_b_GPIO         USBDM::GpioC<11>
#define FB_RW_b_FN           5
#endif

// Pin Mapping for FB_TA_b signal
//   <o> FB_TA_b [PTC19]<name=FB_TA_b_PIN_SEL>
//   <i> Shows which pin FB_TA_b is mapped to
//     <0=> Disabled
//     <1=> PTC19<selection=PTC19_SIG_SEL,FB_TA_b>
//     <0=> Default
#define FB_TA_b_PIN_SEL      0
#if FB_TA_b_PIN_SEL == 1
#define FB_TA_b_GPIO         USBDM::GpioC<19>
#define FB_TA_b_FN           6
#endif

// Pin Mapping for FB_TBST_b signal
//   <o> FB_TBST_b [PTC18]<name=FB_TBST_b_PIN_SEL>
//   <i> Shows which pin FB_TBST_b is mapped to
//     <0=> Disabled
//     <1=> PTC18<selection=PTC18_SIG_SEL,FB_TBST_b/FB_CS2_b/FB_BE15_8_BLS23_16_b>
//     <0=> Default
#define FB_TBST_b_PIN_SEL    0
#if FB_TBST_b_PIN_SEL == 1
#define FB_TBST_b_GPIO       USBDM::GpioC<18>
#define FB_TBST_b_FN         5
#endif

// Pin Mapping for FB_TSIZ0 signal
//   <o> FB_TSIZ0 [PTC17]<name=FB_TSIZ0_PIN_SEL>
//   <i> Shows which pin FB_TSIZ0 is mapped to
//     <0=> Disabled
//     <1=> PTC17 (Alias:D1)<selection=PTC17_SIG_SEL,FB_CS4_b/FB_TSIZ0/FB_BE31_24_BLS7_0_b>
//     <0=> Default
#define FB_TSIZ0_PIN_SEL     0
#if FB_TSIZ0_PIN_SEL == 1
#define FB_TSIZ0_GPIO        USBDM::GpioC<17>
#define FB_TSIZ0_FN          5
#endif

// Pin Mapping for FB_TSIZ1 signal
//   <o> FB_TSIZ1 [PTC16]<name=FB_TSIZ1_PIN_SEL>
//   <i> Shows which pin FB_TSIZ1 is mapped to
//     <0=> Disabled
//     <1=> PTC16 (Alias:D0)<selection=PTC16_SIG_SEL,FB_CS5_b/FB_TSIZ1/FB_BE23_16_BLS15_8_b>
//     <0=> Default
#define FB_TSIZ1_PIN_SEL     0
#if FB_TSIZ1_PIN_SEL == 1
#define FB_TSIZ1_GPIO        USBDM::GpioC<16>
#define FB_TSIZ1_FN          5
#endif

// Pin Mapping for FB_TS_b signal
//   <o> FB_TS_b [PTD0]<name=FB_TS_b_PIN_SEL>
//   <i> Shows which pin FB_TS_b is mapped to
//     <0=> Disabled
//     <1=> PTD0 (Alias:D10)<selection=PTD0_SIG_SEL,FB_ALE/FB_CS1_b/FB_TS_b>
//     <0=> Default
#define FB_TS_b_PIN_SEL      0
#if FB_TS_b_PIN_SEL == 1
#define FB_TS_b_GPIO         USBDM::GpioD<0>
#define FB_TS_b_FN           5
#endif

// </h>

// <h> FlexTimer (FTM0)

// Pin Mapping for FTM0_CH0 signal
//   <o> FTM0_CH0 [PTA3, PTC1]<name=FTM0_CH0_PIN_SEL>
//   <i> Shows which pin FTM0_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,FTM0_CH0>
//     <2=> PTC1<selection=PTC1_SIG_SEL,FTM0_CH0>
//     <0=> Default
#define FTM0_CH0_PIN_SEL     0
#if FTM0_CH0_PIN_SEL == 1
#define FTM0_CH0_GPIO        USBDM::GpioA<3>
#define FTM0_CH0_FN          3
#elif FTM0_CH0_PIN_SEL == 2
#define FTM0_CH0_GPIO        USBDM::GpioC<1>
#define FTM0_CH0_FN          4
#endif

// Pin Mapping for FTM0_CH1 signal
//   <o> FTM0_CH1 [PTA4, PTC2]<name=FTM0_CH1_PIN_SEL>
//   <i> Shows which pin FTM0_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,FTM0_CH1>
//     <2=> PTC2 (Alias:D6)<selection=PTC2_SIG_SEL,FTM0_CH1>
//     <0=> Default
#define FTM0_CH1_PIN_SEL     0
#if FTM0_CH1_PIN_SEL == 1
#define FTM0_CH1_GPIO        USBDM::GpioA<4>
#define FTM0_CH1_FN          3
#elif FTM0_CH1_PIN_SEL == 2
#define FTM0_CH1_GPIO        USBDM::GpioC<2>
#define FTM0_CH1_FN          4
#endif

// Pin Mapping for FTM0_CH2 signal
//   <o> FTM0_CH2 [PTA5, PTC3, PTC5]<name=FTM0_CH2_PIN_SEL>
//   <i> Shows which pin FTM0_CH2 is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,FTM0_CH2>
//     <2=> PTC3 (Alias:D7)<selection=PTC3_SIG_SEL,FTM0_CH2>
//     <3=> PTC5<selection=PTC5_SIG_SEL,FTM0_CH2>
//     <0=> Default
#define FTM0_CH2_PIN_SEL     0
#if FTM0_CH2_PIN_SEL == 1
#define FTM0_CH2_GPIO        USBDM::GpioA<5>
#define FTM0_CH2_FN          3
#elif FTM0_CH2_PIN_SEL == 2
#define FTM0_CH2_GPIO        USBDM::GpioC<3>
#define FTM0_CH2_FN          4
#elif FTM0_CH2_PIN_SEL == 3
#define FTM0_CH2_GPIO        USBDM::GpioC<5>
#define FTM0_CH2_FN          7
#endif

// Pin Mapping for FTM0_CH3 signal
//   <o> FTM0_CH3 [PTA6, PTC4]<name=FTM0_CH3_PIN_SEL>
//   <i> Shows which pin FTM0_CH3 is mapped to
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,FTM0_CH3>
//     <2=> PTC4 (Alias:D9)<selection=PTC4_SIG_SEL,FTM0_CH3>
//     <0=> Default
#define FTM0_CH3_PIN_SEL     0
#if FTM0_CH3_PIN_SEL == 1
#define FTM0_CH3_GPIO        USBDM::GpioA<6>
#define FTM0_CH3_FN          3
#elif FTM0_CH3_PIN_SEL == 2
#define FTM0_CH3_GPIO        USBDM::GpioC<4>
#define FTM0_CH3_FN          4
#endif

// Pin Mapping for FTM0_CH4 signal
//   <o> FTM0_CH4 [PTA7, PTB12, PTD4]<name=FTM0_CH4_PIN_SEL>
//   <i> Shows which pin FTM0_CH4 is mapped to
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,FTM0_CH4>
//     <2=> PTB12<selection=PTB12_SIG_SEL,FTM0_CH4>
//     <3=> PTD4 (Alias:nRF24L01_cs)<selection=PTD4_SIG_SEL,FTM0_CH4>
//     <0=> Default
#define FTM0_CH4_PIN_SEL     0
#if FTM0_CH4_PIN_SEL == 1
#define FTM0_CH4_GPIO        USBDM::GpioA<7>
#define FTM0_CH4_FN          3
#elif FTM0_CH4_PIN_SEL == 2
#define FTM0_CH4_GPIO        USBDM::GpioB<12>
#define FTM0_CH4_FN          4
#elif FTM0_CH4_PIN_SEL == 3
#define FTM0_CH4_GPIO        USBDM::GpioD<4>
#define FTM0_CH4_FN          4
#endif

// Pin Mapping for FTM0_CH5 signal
//   <o> FTM0_CH5 [PTA0, PTB13, PTD5]<name=FTM0_CH5_PIN_SEL>
//   <i> Shows which pin FTM0_CH5 is mapped to
//     <0=> Disabled
//     <1=> PTA0 (Alias:D8)<selection=PTA0_SIG_SEL,FTM0_CH5>
//     <2=> PTB13<selection=PTB13_SIG_SEL,FTM0_CH5>
//     <3=> PTD5 (Alias:nRF24L01_sck)<selection=PTD5_SIG_SEL,FTM0_CH5>
//     <0=> Default
#define FTM0_CH5_PIN_SEL     0
#if FTM0_CH5_PIN_SEL == 1
#define FTM0_CH5_GPIO        USBDM::GpioA<0>
#define FTM0_CH5_FN          3
#elif FTM0_CH5_PIN_SEL == 2
#define FTM0_CH5_GPIO        USBDM::GpioB<13>
#define FTM0_CH5_FN          4
#elif FTM0_CH5_PIN_SEL == 3
#define FTM0_CH5_GPIO        USBDM::GpioD<5>
#define FTM0_CH5_FN          4
#endif

// Pin Mapping for FTM0_CH6 signal
//   <o> FTM0_CH6 [PTA1, PTD6]<name=FTM0_CH6_PIN_SEL>
//   <i> Shows which pin FTM0_CH6 is mapped to
//     <0=> Disabled
//     <1=> PTA1 (Alias:D3)<selection=PTA1_SIG_SEL,FTM0_CH6>
//     <2=> PTD6 (Alias:nRF24L01_mosi)<selection=PTD6_SIG_SEL,FTM0_CH6>
//     <0=> Default
#define FTM0_CH6_PIN_SEL     0
#if FTM0_CH6_PIN_SEL == 1
#define FTM0_CH6_GPIO        USBDM::GpioA<1>
#define FTM0_CH6_FN          3
#elif FTM0_CH6_PIN_SEL == 2
#define FTM0_CH6_GPIO        USBDM::GpioD<6>
#define FTM0_CH6_FN          4
#endif

