podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for FTM0_CH7 signal
//   <o> FTM0_CH7 [PTA2, PTD7]<name=FTM0_CH7_PIN_SEL>
//   <i> Shows which pin FTM0_CH7 is mapped to
//     <0=> Disabled
//     <1=> PTA2 (Alias:D5)<selection=PTA2_SIG_SEL,FTM0_CH7>
//     <2=> PTD7 (Alias:nRF24L01_miso)<selection=PTD7_SIG_SEL,FTM0_CH7>
//     <0=> Default
#define FTM0_CH7_PIN_SEL     0
#if FTM0_CH7_PIN_SEL == 1
#define FTM0_CH7_GPIO        USBDM::GpioA<2>
#define FTM0_CH7_FN          3
#elif FTM0_CH7_PIN_SEL == 2
#define FTM0_CH7_GPIO        USBDM::GpioD<7>
#define FTM0_CH7_FN          4
#endif

// Pin Mapping for FTM0_FLT0 signal
//   <o> FTM0_FLT0 [PTB3, PTD6]<name=FTM0_FLT0_PIN_SEL>
//   <i> Shows which pin FTM0_FLT0 is mapped to
//     <0=> Disabled
//     <1=> PTB3 (Alias:A1)<selection=PTB3_SIG_SEL,FTM0_FLT0>
//     <2=> PTD6 (Alias:nRF24L01_mosi)<selection=PTD6_SIG_SEL,FTM0_FLT0>
//     <0=> Default
#define FTM0_FLT0_PIN_SEL    0
#if FTM0_FLT0_PIN_SEL == 1
#define FTM0_FLT0_GPIO       USBDM::GpioB<3>
#define FTM0_FLT0_FN         6
#elif FTM0_FLT0_PIN_SEL == 2
#define FTM0_FLT0_GPIO       USBDM::GpioD<6>
#define FTM0_FLT0_FN         6
#endif

// Pin Mapping for FTM0_FLT1 signal
//   <o> FTM0_FLT1 [PTB10, PTD7]<name=FTM0_FLT1_PIN_SEL>
//   <i> Shows which pin FTM0_FLT1 is mapped to
//     <0=> Disabled
//     <1=> PTB10 (Alias:A2)<selection=PTB10_SIG_SEL,FTM0_FLT1>
//     <2=> PTD7 (Alias:nRF24L01_miso)<selection=PTD7_SIG_SEL,FTM0_FLT1>
//     <0=> Default
#define FTM0_FLT1_PIN_SEL    0
#if FTM0_FLT1_PIN_SEL == 1
#define FTM0_FLT1_GPIO       USBDM::GpioB<10>
#define FTM0_FLT1_FN         6
#elif FTM0_FLT1_PIN_SEL == 2
#define FTM0_FLT1_GPIO       USBDM::GpioD<7>
#define FTM0_FLT1_FN         6
#endif

// Pin Mapping for FTM0_FLT2 signal
//   <o> FTM0_FLT2 [PTA18, PTB11]<name=FTM0_FLT2_PIN_SEL>
//   <i> Shows which pin FTM0_FLT2 is mapped to
//     <0=> Disabled
//     <1=> PTA18<selection=PTA18_SIG_SEL,FTM0_FLT2>
//     <2=> PTB11 (Alias:A3)<selection=PTB11_SIG_SEL,FTM0_FLT2>
//     <0=> Default
#define FTM0_FLT2_PIN_SEL    0
#if FTM0_FLT2_PIN_SEL == 1
#define FTM0_FLT2_GPIO       USBDM::GpioA<18>
#define FTM0_FLT2_FN         3
#elif FTM0_FLT2_PIN_SEL == 2
#define FTM0_FLT2_GPIO       USBDM::GpioB<11>
#define FTM0_FLT2_FN         6
#endif

// Pin Mapping for FTM0_FLT3 signal
//   <o> FTM0_FLT3 [PTB2]<name=FTM0_FLT3_PIN_SEL>
//   <i> Shows which pin FTM0_FLT3 is mapped to
//     <0=> Disabled
//     <1=> PTB2 (Alias:A0)<selection=PTB2_SIG_SEL,FTM0_FLT3>
//     <0=> Default
#define FTM0_FLT3_PIN_SEL    0
#if FTM0_FLT3_PIN_SEL == 1
#define FTM0_FLT3_GPIO       USBDM::GpioB<2>
#define FTM0_FLT3_FN         6
#endif

// </h>

// <h> FlexTimer (FTM1)

// Pin Mapping for FTM1_CH0 signal
//   <o> FTM1_CH0 [PTA8, PTA12, PTB0, PTB12]<name=FTM1_CH0_PIN_SEL>
//   <i> Shows which pin FTM1_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTA8<selection=PTA8_SIG_SEL,FTM1_CH0>
//     <2=> PTA12<selection=PTA12_SIG_SEL,FTM1_CH0>
//     <3=> PTB0<selection=PTB0_SIG_SEL,FTM1_CH0>
//     <4=> PTB12<selection=PTB12_SIG_SEL,FTM1_CH0>
//     <0=> Default
#define FTM1_CH0_PIN_SEL     0
#if FTM1_CH0_PIN_SEL == 1
#define FTM1_CH0_GPIO        USBDM::GpioA<8>
#define FTM1_CH0_FN          3
#elif FTM1_CH0_PIN_SEL == 2
#define FTM1_CH0_GPIO        USBDM::GpioA<12>
#define FTM1_CH0_FN          3
#elif FTM1_CH0_PIN_SEL == 3
#define FTM1_CH0_GPIO        USBDM::GpioB<0>
#define FTM1_CH0_FN          3
#elif FTM1_CH0_PIN_SEL == 4
#define FTM1_CH0_GPIO        USBDM::GpioB<12>
#define FTM1_CH0_FN          3
#endif

// Pin Mapping for FTM1_CH1 signal
//   <o> FTM1_CH1 [PTA9, PTA13, PTB1, PTB13]<name=FTM1_CH1_PIN_SEL>
//   <i> Shows which pin FTM1_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTA9<selection=PTA9_SIG_SEL,FTM1_CH1>
//     <2=> PTA13<selection=PTA13_SIG_SEL,FTM1_CH1>
//     <3=> PTB1<selection=PTB1_SIG_SEL,FTM1_CH1>
//     <4=> PTB13<selection=PTB13_SIG_SEL,FTM1_CH1>
//     <0=> Default
#define FTM1_CH1_PIN_SEL     0
#if FTM1_CH1_PIN_SEL == 1
#define FTM1_CH1_GPIO        USBDM::GpioA<9>
#define FTM1_CH1_FN          3
#elif FTM1_CH1_PIN_SEL == 2
#define FTM1_CH1_GPIO        USBDM::GpioA<13>
#define FTM1_CH1_FN          3
#elif FTM1_CH1_PIN_SEL == 3
#define FTM1_CH1_GPIO        USBDM::GpioB<1>
#define FTM1_CH1_FN          3
#elif FTM1_CH1_PIN_SEL == 4
#define FTM1_CH1_GPIO        USBDM::GpioB<13>
#define FTM1_CH1_FN          3
#endif

// Pin Mapping for FTM1_FLT0 signal
//   <o> FTM1_FLT0 [PTA19, PTB4]<name=FTM1_FLT0_PIN_SEL>
//   <i> Shows which pin FTM1_FLT0 is mapped to
//     <0=> Disabled
//     <1=> PTA19<selection=PTA19_SIG_SEL,FTM1_FLT0>
//     <2=> PTB4<selection=PTB4_SIG_SEL,FTM1_FLT0>
//     <0=> Default
#define FTM1_FLT0_PIN_SEL    0
#if FTM1_FLT0_PIN_SEL == 1
#define FTM1_FLT0_GPIO       USBDM::GpioA<19>
#define FTM1_FLT0_FN         3
#elif FTM1_FLT0_PIN_SEL == 2
#define FTM1_FLT0_GPIO       USBDM::GpioB<4>
#define FTM1_FLT0_FN         6
#endif

// Pin Mapping for FTM1_QD_PHA signal
//   <o> FTM1_QD_PHA [PTA8, PTB0, PTB12, PTA12]<name=FTM1_QD_PHA_PIN_SEL>
//   <i> Shows which pin FTM1_QD_PHA is mapped to
//     <0=> Disabled
//     <1=> PTA8<selection=PTA8_SIG_SEL,FTM1_QD_PHA>
//     <2=> PTB0<selection=PTB0_SIG_SEL,FTM1_QD_PHA>
//     <3=> PTB12<selection=PTB12_SIG_SEL,FTM1_QD_PHA>
//     <4=> PTA12<selection=PTA12_SIG_SEL,FTM1_QD_PHA>
//     <0=> Default
#define FTM1_QD_PHA_PIN_SEL  0
#if FTM1_QD_PHA_PIN_SEL == 1
#define FTM1_QD_PHA_GPIO     USBDM::GpioA<8>
#define FTM1_QD_PHA_FN       6
#elif FTM1_QD_PHA_PIN_SEL == 2
#define FTM1_QD_PHA_GPIO     USBDM::GpioB<0>
#define FTM1_QD_PHA_FN       6
#elif FTM1_QD_PHA_PIN_SEL == 3
#define FTM1_QD_PHA_GPIO     USBDM::GpioB<12>
#define FTM1_QD_PHA_FN       6
#elif FTM1_QD_PHA_PIN_SEL == 4
#define FTM1_QD_PHA_GPIO     USBDM::GpioA<12>
#define FTM1_QD_PHA_FN       7
#endif

// Pin Mapping for FTM1_QD_PHB signal
//   <o> FTM1_QD_PHB [PTA9, PTB1, PTB13, PTA13]<name=FTM1_QD_PHB_PIN_SEL>
//   <i> Shows which pin FTM1_QD_PHB is mapped to
//     <0=> Disabled
//     <1=> PTA9<selection=PTA9_SIG_SEL,FTM1_QD_PHB>
//     <2=> PTB1<selection=PTB1_SIG_SEL,FTM1_QD_PHB>
//     <3=> PTB13<selection=PTB13_SIG_SEL,FTM1_QD_PHB>
//     <4=> PTA13<selection=PTA13_SIG_SEL,FTM1_QD_PHB>
//     <0=> Default
#define FTM1_QD_PHB_PIN_SEL  0
#if FTM1_QD_PHB_PIN_SEL == 1
#define FTM1_QD_PHB_GPIO     USBDM::GpioA<9>
#define FTM1_QD_PHB_FN       6
#elif FTM1_QD_PHB_PIN_SEL == 2
#define FTM1_QD_PHB_GPIO     USBDM::GpioB<1>
#define FTM1_QD_PHB_FN       6
#elif FTM1_QD_PHB_PIN_SEL == 3
#define FTM1_QD_PHB_GPIO     USBDM::GpioB<13>
#define FTM1_QD_PHB_FN       6
#elif FTM1_QD_PHB_PIN_SEL == 4
#define FTM1_QD_PHB_GPIO     USBDM::GpioA<13>
#define FTM1_QD_PHB_FN       7
#endif

