podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// </h>

// <h> FlexTimer (FTM2)

// Pin Mapping for FTM2_CH0 signal
//   <o> FTM2_CH0 [PTA10, PTB18]<name=FTM2_CH0_PIN_SEL>
//   <i> Shows which pin FTM2_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTA10<selection=PTA10_SIG_SEL,FTM2_CH0>
//     <2=> PTB18<selection=PTB18_SIG_SEL,FTM2_CH0>
//     <0=> Default
#define FTM2_CH0_PIN_SEL     0
#if FTM2_CH0_PIN_SEL == 1
#define FTM2_CH0_GPIO        USBDM::GpioA<10>
#define FTM2_CH0_FN          3
#elif FTM2_CH0_PIN_SEL == 2
#define FTM2_CH0_GPIO        USBDM::GpioB<18>
#define FTM2_CH0_FN          3
#endif

// Pin Mapping for FTM2_CH1 signal
//   <o> FTM2_CH1 [PTA11, PTB19]<name=FTM2_CH1_PIN_SEL>
//   <i> Shows which pin FTM2_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTA11<selection=PTA11_SIG_SEL,FTM2_CH1>
//     <2=> PTB19<selection=PTB19_SIG_SEL,FTM2_CH1>
//     <0=> Default
#define FTM2_CH1_PIN_SEL     0
#if FTM2_CH1_PIN_SEL == 1
#define FTM2_CH1_GPIO        USBDM::GpioA<11>
#define FTM2_CH1_FN          3
#elif FTM2_CH1_PIN_SEL == 2
#define FTM2_CH1_GPIO        USBDM::GpioB<19>
#define FTM2_CH1_FN          3
#endif

// Pin Mapping for FTM2_FLT0 signal
//   <o> FTM2_FLT0 [PTB5, PTC9]<name=FTM2_FLT0_PIN_SEL>
//   <i> Shows which pin FTM2_FLT0 is mapped to
//     <0=> Disabled
//     <1=> PTB5<selection=PTB5_SIG_SEL,FTM2_FLT0>
//     <2=> PTC9<selection=PTC9_SIG_SEL,FTM2_FLT0>
//     <0=> Default
#define FTM2_FLT0_PIN_SEL    0
#if FTM2_FLT0_PIN_SEL == 1
#define FTM2_FLT0_GPIO       USBDM::GpioB<5>
#define FTM2_FLT0_FN         6
#elif FTM2_FLT0_PIN_SEL == 2
#define FTM2_FLT0_GPIO       USBDM::GpioC<9>
#define FTM2_FLT0_FN         6
#endif

// Pin Mapping for FTM2_QD_PHA signal
//   <o> FTM2_QD_PHA [PTA10, PTB18]<name=FTM2_QD_PHA_PIN_SEL>
//   <i> Shows which pin FTM2_QD_PHA is mapped to
//     <0=> Disabled
//     <1=> PTA10<selection=PTA10_SIG_SEL,FTM2_QD_PHA>
//     <2=> PTB18<selection=PTB18_SIG_SEL,FTM2_QD_PHA>
//     <0=> Default
#define FTM2_QD_PHA_PIN_SEL  0
#if FTM2_QD_PHA_PIN_SEL == 1
#define FTM2_QD_PHA_GPIO     USBDM::GpioA<10>
#define FTM2_QD_PHA_FN       6
#elif FTM2_QD_PHA_PIN_SEL == 2
#define FTM2_QD_PHA_GPIO     USBDM::GpioB<18>
#define FTM2_QD_PHA_FN       6
#endif

// Pin Mapping for FTM2_QD_PHB signal
//   <o> FTM2_QD_PHB [PTA11, PTB19]<name=FTM2_QD_PHB_PIN_SEL>
//   <i> Shows which pin FTM2_QD_PHB is mapped to
//     <0=> Disabled
//     <1=> PTA11<selection=PTA11_SIG_SEL,FTM2_QD_PHB>
//     <2=> PTB19<selection=PTB19_SIG_SEL,FTM2_QD_PHB>
//     <0=> Default
#define FTM2_QD_PHB_PIN_SEL  0
#if FTM2_QD_PHB_PIN_SEL == 1
#define FTM2_QD_PHB_GPIO     USBDM::GpioA<11>
#define FTM2_QD_PHB_FN       6
#elif FTM2_QD_PHB_PIN_SEL == 2
#define FTM2_QD_PHB_GPIO     USBDM::GpioB<19>
#define FTM2_QD_PHB_FN       6
#endif

// </h>

// <h> FlexTimer (FTM3)

// Pin Mapping for FTM3_CH0 signal
//   <o> FTM3_CH0 [PTD0, PTE5]<name=FTM3_CH0_PIN_SEL>
//   <i> Shows which pin FTM3_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTD0 (Alias:D10)<selection=PTD0_SIG_SEL,FTM3_CH0>
//     <2=> PTE5<selection=PTE5_SIG_SEL,FTM3_CH0>
//     <0=> Default
#define FTM3_CH0_PIN_SEL     0
#if FTM3_CH0_PIN_SEL == 1
#define FTM3_CH0_GPIO        USBDM::GpioD<0>
#define FTM3_CH0_FN          4
#elif FTM3_CH0_PIN_SEL == 2
#define FTM3_CH0_GPIO        USBDM::GpioE<5>
#define FTM3_CH0_FN          6
#endif

// Pin Mapping for FTM3_CH1 signal
//   <o> FTM3_CH1 [PTD1, PTE6]<name=FTM3_CH1_PIN_SEL>
//   <i> Shows which pin FTM3_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTD1 (Alias:D13)<selection=PTD1_SIG_SEL,FTM3_CH1>
//     <2=> PTE6<selection=PTE6_SIG_SEL,FTM3_CH1>
//     <0=> Default
#define FTM3_CH1_PIN_SEL     0
#if FTM3_CH1_PIN_SEL == 1
#define FTM3_CH1_GPIO        USBDM::GpioD<1>
#define FTM3_CH1_FN          4
#elif FTM3_CH1_PIN_SEL == 2
#define FTM3_CH1_GPIO        USBDM::GpioE<6>
#define FTM3_CH1_FN          6
#endif

// Pin Mapping for FTM3_CH2 signal
//   <o> FTM3_CH2 [PTD2, PTE7]<name=FTM3_CH2_PIN_SEL>
//   <i> Shows which pin FTM3_CH2 is mapped to
//     <0=> Disabled
//     <1=> PTD2 (Alias:D11)<selection=PTD2_SIG_SEL,FTM3_CH2>
//     <2=> PTE7<selection=PTE7_SIG_SEL,FTM3_CH2>
//     <0=> Default
#define FTM3_CH2_PIN_SEL     0
#if FTM3_CH2_PIN_SEL == 1
#define FTM3_CH2_GPIO        USBDM::GpioD<2>
#define FTM3_CH2_FN          4
#elif FTM3_CH2_PIN_SEL == 2
#define FTM3_CH2_GPIO        USBDM::GpioE<7>
#define FTM3_CH2_FN          6
#endif

// Pin Mapping for FTM3_CH3 signal
//   <o> FTM3_CH3 [PTD3, PTE8]<name=FTM3_CH3_PIN_SEL>
//   <i> Shows which pin FTM3_CH3 is mapped to
//     <0=> Disabled
//     <1=> PTD3 (Alias:D12)<selection=PTD3_SIG_SEL,FTM3_CH3>
//     <2=> PTE8<selection=PTE8_SIG_SEL,FTM3_CH3>
//     <0=> Default
#define FTM3_CH3_PIN_SEL     0
#if FTM3_CH3_PIN_SEL == 1
#define FTM3_CH3_GPIO        USBDM::GpioD<3>
#define FTM3_CH3_FN          4
#elif FTM3_CH3_PIN_SEL == 2
#define FTM3_CH3_GPIO        USBDM::GpioE<8>
#define FTM3_CH3_FN          6
#endif

// Pin Mapping for FTM3_CH4 signal
//   <o> FTM3_CH4 [PTC8, PTE9]<name=FTM3_CH4_PIN_SEL>
//   <i> Shows which pin FTM3_CH4 is mapped to
//     <0=> Disabled
//     <1=> PTC8<selection=PTC8_SIG_SEL,FTM3_CH4>
//     <2=> PTE9<selection=PTE9_SIG_SEL,FTM3_CH4>
//     <0=> Default
#define FTM3_CH4_PIN_SEL     0
#if FTM3_CH4_PIN_SEL == 1
#define FTM3_CH4_GPIO        USBDM::GpioC<8>
#define FTM3_CH4_FN          3
#elif FTM3_CH4_PIN_SEL == 2
#define FTM3_CH4_GPIO        USBDM::GpioE<9>
#define FTM3_CH4_FN          6
#endif

// Pin Mapping for FTM3_CH5 signal
//   <o> FTM3_CH5 [PTC9, PTE10]<name=FTM3_CH5_PIN_SEL>
//   <i> Shows which pin FTM3_CH5 is mapped to
//     <0=> Disabled
//     <1=> PTC9<selection=PTC9_SIG_SEL,FTM3_CH5>
//     <2=> PTE10<selection=PTE10_SIG_SEL,FTM3_CH5>
//     <0=> Default
#define FTM3_CH5_PIN_SEL     0
#if FTM3_CH5_PIN_SEL == 1
#define FTM3_CH5_GPIO        USBDM::GpioC<9>
#define FTM3_CH5_FN          3
#elif FTM3_CH5_PIN_SEL == 2
#define FTM3_CH5_GPIO        USBDM::GpioE<10>
#define FTM3_CH5_FN          6
#endif

// Pin Mapping for FTM3_CH6 signal
//   <o> FTM3_CH6 [PTC10, PTE11]<name=FTM3_CH6_PIN_SEL>
//   <i> Shows which pin FTM3_CH6 is mapped to
//     <0=> Disabled
//     <1=> PTC10 (Alias:A5)<selection=PTC10_SIG_SEL,FTM3_CH6>
//     <2=> PTE11<selection=PTE11_SIG_SEL,FTM3_CH6>
//     <0=> Default
#define FTM3_CH6_PIN_SEL     0
#if FTM3_CH6_PIN_SEL == 1
#define FTM3_CH6_GPIO        USBDM::GpioC<10>
#define FTM3_CH6_FN          3
#elif FTM3_CH6_PIN_SEL == 2
#define FTM3_CH6_GPIO        USBDM::GpioE<11>
#define FTM3_CH6_FN          6
#endif

