podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for GPIOD_9 signal
//   <o> GPIOD_9 [PTD9]<name=GPIOD_9_PIN_SEL>
//   <i> Shows which pin GPIOD_9 is mapped to
//     <0=> Disabled
//     <1=> PTD9<selection=PTD9_SIG_SEL,GPIOD_9>
//     <0=> Default
#define GPIOD_9_PIN_SEL      0
#if GPIOD_9_PIN_SEL == 1
#define GPIOD_9_GPIO         USBDM::GpioD<9>
#define GPIOD_9_FN           1
#endif

// Pin Mapping for GPIOD_10 signal
//   <o> GPIOD_10 [PTD10]<name=GPIOD_10_PIN_SEL>
//   <i> Shows which pin GPIOD_10 is mapped to
//     <0=> Disabled
//     <1=> PTD10<selection=PTD10_SIG_SEL,GPIOD_10>
//     <0=> Default
#define GPIOD_10_PIN_SEL     0
#if GPIOD_10_PIN_SEL == 1
#define GPIOD_10_GPIO        USBDM::GpioD<10>
#define GPIOD_10_FN          1
#endif

// Pin Mapping for GPIOD_11 signal
//   <o> GPIOD_11 [PTD11]<name=GPIOD_11_PIN_SEL>
//   <i> Shows which pin GPIOD_11 is mapped to
//     <0=> Disabled
//     <1=> PTD11<selection=PTD11_SIG_SEL,GPIOD_11>
//     <0=> Default
#define GPIOD_11_PIN_SEL     0
#if GPIOD_11_PIN_SEL == 1
#define GPIOD_11_GPIO        USBDM::GpioD<11>
#define GPIOD_11_FN          1
#endif

// Pin Mapping for GPIOD_12 signal
//   <o> GPIOD_12 [PTD12]<name=GPIOD_12_PIN_SEL>
//   <i> Shows which pin GPIOD_12 is mapped to
//     <0=> Disabled
//     <1=> PTD12<selection=PTD12_SIG_SEL,GPIOD_12>
//     <0=> Default
#define GPIOD_12_PIN_SEL     0
#if GPIOD_12_PIN_SEL == 1
#define GPIOD_12_GPIO        USBDM::GpioD<12>
#define GPIOD_12_FN          1
#endif

// Pin Mapping for GPIOD_13 signal
//   <o> GPIOD_13 [PTD13]<name=GPIOD_13_PIN_SEL>
//   <i> Shows which pin GPIOD_13 is mapped to
//     <0=> Disabled
//     <1=> PTD13<selection=PTD13_SIG_SEL,GPIOD_13>
//     <0=> Default
#define GPIOD_13_PIN_SEL     0
#if GPIOD_13_PIN_SEL == 1
#define GPIOD_13_GPIO        USBDM::GpioD<13>
#define GPIOD_13_FN          1
#endif

// Pin Mapping for GPIOD_14 signal
//   <o> GPIOD_14 [PTD14]<name=GPIOD_14_PIN_SEL>
//   <i> Shows which pin GPIOD_14 is mapped to
//     <0=> Disabled
//     <1=> PTD14<selection=PTD14_SIG_SEL,GPIOD_14>
//     <0=> Default
#define GPIOD_14_PIN_SEL     0
#if GPIOD_14_PIN_SEL == 1
#define GPIOD_14_GPIO        USBDM::GpioD<14>
#define GPIOD_14_FN          1
#endif

// Pin Mapping for GPIOD_15 signal
//   <o> GPIOD_15 [PTD15]<name=GPIOD_15_PIN_SEL>
//   <i> Shows which pin GPIOD_15 is mapped to
//     <0=> Disabled
//     <1=> PTD15<selection=PTD15_SIG_SEL,GPIOD_15>
//     <0=> Default
#define GPIOD_15_PIN_SEL     0
#if GPIOD_15_PIN_SEL == 1
#define GPIOD_15_GPIO        USBDM::GpioD<15>
#define GPIOD_15_FN          1
#endif

// </h>

// <h> General Purpose I/O (GPIOE)

// Pin Mapping for GPIOE_0 signal
//   <o> GPIOE_0 [PTE0]<name=GPIOE_0_PIN_SEL>
//   <i> Shows which pin GPIOE_0 is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,GPIOE_0>
//     <0=> Default
#define GPIOE_0_PIN_SEL      0
#if GPIOE_0_PIN_SEL == 1
#define GPIOE_0_GPIO         USBDM::GpioE<0>
#define GPIOE_0_FN           1
#endif

// Pin Mapping for GPIOE_1 signal
//   <o> GPIOE_1 [PTE1]<name=GPIOE_1_PIN_SEL>
//   <i> Shows which pin GPIOE_1 is mapped to
//     <0=> Disabled
//     <1=> PTE1<selection=PTE1_SIG_SEL,GPIOE_1/LLWU_P0>
//     <0=> Default
#define GPIOE_1_PIN_SEL      0
#if GPIOE_1_PIN_SEL == 1
#define GPIOE_1_GPIO         USBDM::GpioE<1>
#define GPIOE_1_FN           1
#endif

// Pin Mapping for GPIOE_2 signal
//   <o> GPIOE_2 [PTE2]<name=GPIOE_2_PIN_SEL>
//   <i> Shows which pin GPIOE_2 is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,GPIOE_2/LLWU_P1>
//     <0=> Default
#define GPIOE_2_PIN_SEL      0
#if GPIOE_2_PIN_SEL == 1
#define GPIOE_2_GPIO         USBDM::GpioE<2>
#define GPIOE_2_FN           1
#endif

// Pin Mapping for GPIOE_3 signal
//   <o> GPIOE_3 [PTE3]<name=GPIOE_3_PIN_SEL>
//   <i> Shows which pin GPIOE_3 is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,GPIOE_3>
//     <0=> Default
#define GPIOE_3_PIN_SEL      0
#if GPIOE_3_PIN_SEL == 1
#define GPIOE_3_GPIO         USBDM::GpioE<3>
#define GPIOE_3_FN           1
#endif

// Pin Mapping for GPIOE_4 signal
//   <o> GPIOE_4 [PTE4]<name=GPIOE_4_PIN_SEL>
//   <i> Shows which pin GPIOE_4 is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,GPIOE_4/LLWU_P2>
//     <0=> Default
#define GPIOE_4_PIN_SEL      0
#if GPIOE_4_PIN_SEL == 1
#define GPIOE_4_GPIO         USBDM::GpioE<4>
#define GPIOE_4_FN           1
#endif

// Pin Mapping for GPIOE_5 signal
//   <o> GPIOE_5 [PTE5]<name=GPIOE_5_PIN_SEL>
//   <i> Shows which pin GPIOE_5 is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,GPIOE_5>
//     <0=> Default
#define GPIOE_5_PIN_SEL      0
#if GPIOE_5_PIN_SEL == 1
#define GPIOE_5_GPIO         USBDM::GpioE<5>
#define GPIOE_5_FN           1
#endif

// Pin Mapping for GPIOE_6 signal
//   <o> GPIOE_6 [PTE6]<name=GPIOE_6_PIN_SEL>
//   <i> Shows which pin GPIOE_6 is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,GPIOE_6>
//     <0=> Default
#define GPIOE_6_PIN_SEL      0
#if GPIOE_6_PIN_SEL == 1
#define GPIOE_6_GPIO         USBDM::GpioE<6>
#define GPIOE_6_FN           1
#endif

// Pin Mapping for GPIOE_7 signal
//   <o> GPIOE_7 [PTE7]<name=GPIOE_7_PIN_SEL>
//   <i> Shows which pin GPIOE_7 is mapped to
//     <0=> Disabled
//     <1=> PTE7<selection=PTE7_SIG_SEL,GPIOE_7>
//     <0=> Default
#define GPIOE_7_PIN_SEL      0
#if GPIOE_7_PIN_SEL == 1
#define GPIOE_7_GPIO         USBDM::GpioE<7>
#define GPIOE_7_FN           1
#endif

// Pin Mapping for GPIOE_8 signal
//   <o> GPIOE_8 [PTE8]<name=GPIOE_8_PIN_SEL>
//   <i> Shows which pin GPIOE_8 is mapped to
//     <0=> Disabled
//     <1=> PTE8<selection=PTE8_SIG_SEL,GPIOE_8>
//     <0=> Default
#define GPIOE_8_PIN_SEL      0
#if GPIOE_8_PIN_SEL == 1
#define GPIOE_8_GPIO         USBDM::GpioE<8>
#define GPIOE_8_FN           1
#endif

// Pin Mapping for GPIOE_9 signal
//   <o> GPIOE_9 [PTE9]<name=GPIOE_9_PIN_SEL>
//   <i> Shows which pin GPIOE_9 is mapped to
//     <0=> Disabled
//     <1=> PTE9<selection=PTE9_SIG_SEL,GPIOE_9>
//     <0=> Default
#define GPIOE_9_PIN_SEL      0
#if GPIOE_9_PIN_SEL == 1
#define GPIOE_9_GPIO         USBDM::GpioE<9>
#define GPIOE_9_FN           1
#endif

// Pin Mapping for GPIOE_10 signal
//   <o> GPIOE_10 [PTE10]<name=GPIOE_10_PIN_SEL>
//   <i> Shows which pin GPIOE_10 is mapped to
//     <0=> Disabled
//     <1=> PTE10<selection=PTE10_SIG_SEL,GPIOE_10>
//     <0=> Default
#define GPIOE_10_PIN_SEL     0
#if GPIOE_10_PIN_SEL == 1
#define GPIOE_10_GPIO        USBDM::GpioE<10>
#define GPIOE_10_FN          1
#endif

