podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for GPIOE_11 signal
//   <o> GPIOE_11 [PTE11]<name=GPIOE_11_PIN_SEL>
//   <i> Shows which pin GPIOE_11 is mapped to
//     <0=> Disabled
//     <1=> PTE11<selection=PTE11_SIG_SEL,GPIOE_11>
//     <0=> Default
#define GPIOE_11_PIN_SEL     0
#if GPIOE_11_PIN_SEL == 1
#define GPIOE_11_GPIO        USBDM::GpioE<11>
#define GPIOE_11_FN          1
#endif

// Pin Mapping for GPIOE_12 signal
//   <o> GPIOE_12 [PTE12]<name=GPIOE_12_PIN_SEL>
//   <i> Shows which pin GPIOE_12 is mapped to
//     <0=> Disabled
//     <1=> PTE12<selection=PTE12_SIG_SEL,GPIOE_12>
//     <0=> Default
#define GPIOE_12_PIN_SEL     0
#if GPIOE_12_PIN_SEL == 1
#define GPIOE_12_GPIO        USBDM::GpioE<12>
#define GPIOE_12_FN          1
#endif

// Pin Mapping for GPIOE_24 signal
//   <o> GPIOE_24 [PTE24]<name=GPIOE_24_PIN_SEL>
//   <i> Shows which pin GPIOE_24 is mapped to
//     <0=> Disabled
//     <1=> PTE24 (Alias:D15)<selection=PTE24_SIG_SEL,GPIOE_24>
//     <1=> Default
#define GPIOE_24_PIN_SEL     1
#if GPIOE_24_PIN_SEL == 1
#define GPIOE_24_GPIO        USBDM::GpioE<24>
#define GPIOE_24_FN          1
#endif

// Pin Mapping for GPIOE_25 signal
//   <o> GPIOE_25 [PTE25]<name=GPIOE_25_PIN_SEL>
//   <i> Shows which pin GPIOE_25 is mapped to
//     <0=> Disabled
//     <1=> PTE25 (Alias:D14)<selection=PTE25_SIG_SEL,GPIOE_25>
//     <1=> Default
#define GPIOE_25_PIN_SEL     1
#if GPIOE_25_PIN_SEL == 1
#define GPIOE_25_GPIO        USBDM::GpioE<25>
#define GPIOE_25_FN          1
#endif

// Pin Mapping for GPIOE_26 signal
//   <o> GPIOE_26 [PTE26]<name=GPIOE_26_PIN_SEL>
//   <i> Shows which pin GPIOE_26 is mapped to
//     <0=> Disabled
//     <1=> PTE26 (Alias:LED_GREEN)<selection=PTE26_SIG_SEL,GPIOE_26>
//     <1=> Default
#define GPIOE_26_PIN_SEL     1
#if GPIOE_26_PIN_SEL == 1
#define GPIOE_26_GPIO        USBDM::GpioE<26>
#define GPIOE_26_FN          1
#endif

// Pin Mapping for GPIOE_27 signal
//   <o> GPIOE_27 [PTE27]<name=GPIOE_27_PIN_SEL>
//   <i> Shows which pin GPIOE_27 is mapped to
//     <0=> Disabled
//     <1=> PTE27<selection=PTE27_SIG_SEL,GPIOE_27>
//     <0=> Default
#define GPIOE_27_PIN_SEL     0
#if GPIOE_27_PIN_SEL == 1
#define GPIOE_27_GPIO        USBDM::GpioE<27>
#define GPIOE_27_FN          1
#endif

// Pin Mapping for GPIOE_28 signal
//   <o> GPIOE_28 [PTE28]<name=GPIOE_28_PIN_SEL>
//   <i> Shows which pin GPIOE_28 is mapped to
//     <0=> Disabled
//     <1=> PTE28<selection=PTE28_SIG_SEL,GPIOE_28>
//     <0=> Default
#define GPIOE_28_PIN_SEL     0
#if GPIOE_28_PIN_SEL == 1
#define GPIOE_28_GPIO        USBDM::GpioE<28>
#define GPIOE_28_FN          1
#endif

// </h>

// <h> Inter-Integrated Circuit (I2C0)

// Pin Mapping for I2C0_SCL signal
//   <o> I2C0_SCL [PTB0, PTB2, PTD8, PTE24, PTD2]<name=I2C0_SCL_PIN_SEL>
//   <i> Shows which pin I2C0_SCL is mapped to
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,I2C0_SCL>
//     <2=> PTB2 (Alias:A0)<selection=PTB2_SIG_SEL,I2C0_SCL>
//     <3=> PTD8<selection=PTD8_SIG_SEL,I2C0_SCL>
//     <4=> PTE24 (Alias:D15)<selection=PTE24_SIG_SEL,I2C0_SCL>
//     <5=> PTD2 (Alias:D11)<selection=PTD2_SIG_SEL,I2C0_SCL>
//     <0=> Default
#define I2C0_SCL_PIN_SEL     0
#if I2C0_SCL_PIN_SEL == 1
#define I2C0_SCL_GPIO        USBDM::GpioB<0>
#define I2C0_SCL_FN          2
#elif I2C0_SCL_PIN_SEL == 2
#define I2C0_SCL_GPIO        USBDM::GpioB<2>
#define I2C0_SCL_FN          2
#elif I2C0_SCL_PIN_SEL == 3
#define I2C0_SCL_GPIO        USBDM::GpioD<8>
#define I2C0_SCL_FN          2
#elif I2C0_SCL_PIN_SEL == 4
#define I2C0_SCL_GPIO        USBDM::GpioE<24>
#define I2C0_SCL_FN          5
#elif I2C0_SCL_PIN_SEL == 5
#define I2C0_SCL_GPIO        USBDM::GpioD<2>
#define I2C0_SCL_FN          7
#endif

// Pin Mapping for I2C0_SDA signal
//   <o> I2C0_SDA [PTB1, PTB3, PTD9, PTE25, PTD3]<name=I2C0_SDA_PIN_SEL>
//   <i> Shows which pin I2C0_SDA is mapped to
//     <0=> Disabled
//     <1=> PTB1<selection=PTB1_SIG_SEL,I2C0_SDA>
//     <2=> PTB3 (Alias:A1)<selection=PTB3_SIG_SEL,I2C0_SDA>
//     <3=> PTD9<selection=PTD9_SIG_SEL,I2C0_SDA>
//     <4=> PTE25 (Alias:D14)<selection=PTE25_SIG_SEL,I2C0_SDA>
//     <5=> PTD3 (Alias:D12)<selection=PTD3_SIG_SEL,I2C0_SDA>
//     <0=> Default
#define I2C0_SDA_PIN_SEL     0
#if I2C0_SDA_PIN_SEL == 1
#define I2C0_SDA_GPIO        USBDM::GpioB<1>
#define I2C0_SDA_FN          2
#elif I2C0_SDA_PIN_SEL == 2
#define I2C0_SDA_GPIO        USBDM::GpioB<3>
#define I2C0_SDA_FN          2
#elif I2C0_SDA_PIN_SEL == 3
#define I2C0_SDA_GPIO        USBDM::GpioD<9>
#define I2C0_SDA_FN          2
#elif I2C0_SDA_PIN_SEL == 4
#define I2C0_SDA_GPIO        USBDM::GpioE<25>
#define I2C0_SDA_FN          5
#elif I2C0_SDA_PIN_SEL == 5
#define I2C0_SDA_GPIO        USBDM::GpioD<3>
#define I2C0_SDA_FN          7
#endif

// </h>

// <h> Inter-Integrated Circuit (I2C1)

// Pin Mapping for I2C1_SDA signal
//   <o> I2C1_SDA [PTC11, PTE0]<name=I2C1_SDA_PIN_SEL>
//   <i> Shows which pin I2C1_SDA is mapped to
//     <0=> Disabled
//     <1=> PTC11 (Alias:A4)<selection=PTC11_SIG_SEL,I2C1_SDA>
//     <2=> PTE0<selection=PTE0_SIG_SEL,I2C1_SDA>
//     <0=> Default
#define I2C1_SDA_PIN_SEL     0
#if I2C1_SDA_PIN_SEL == 1
#define I2C1_SDA_GPIO        USBDM::GpioC<11>
#define I2C1_SDA_FN          2
#elif I2C1_SDA_PIN_SEL == 2
#define I2C1_SDA_GPIO        USBDM::GpioE<0>
#define I2C1_SDA_FN          6
#endif

// Pin Mapping for I2C1_SCL signal
//   <o> I2C1_SCL [PTC10, PTE1]<name=I2C1_SCL_PIN_SEL>
//   <i> Shows which pin I2C1_SCL is mapped to
//     <0=> Disabled
//     <1=> PTC10 (Alias:A5)<selection=PTC10_SIG_SEL,I2C1_SCL>
//     <2=> PTE1<selection=PTE1_SIG_SEL,I2C1_SCL>
//     <0=> Default
#define I2C1_SCL_PIN_SEL     0
#if I2C1_SCL_PIN_SEL == 1
#define I2C1_SCL_GPIO        USBDM::GpioC<10>
#define I2C1_SCL_FN          2
#elif I2C1_SCL_PIN_SEL == 2
#define I2C1_SCL_GPIO        USBDM::GpioE<1>
#define I2C1_SCL_FN          6
#endif

// </h>

// <h> Inter-Integrated Circuit (I2C2)

// Pin Mapping for I2C2_SDA signal
//   <o> I2C2_SDA [PTA11, PTA13]<name=I2C2_SDA_PIN_SEL>
//   <i> Shows which pin I2C2_SDA is mapped to
//     <0=> Disabled
//     <1=> PTA11<selection=PTA11_SIG_SEL,I2C2_SDA>
//     <2=> PTA13<selection=PTA13_SIG_SEL,I2C2_SDA>
//     <0=> Default
#define I2C2_SDA_PIN_SEL     0
#if I2C2_SDA_PIN_SEL == 1
#define I2C2_SDA_GPIO        USBDM::GpioA<11>
#define I2C2_SDA_FN          5
#elif I2C2_SDA_PIN_SEL == 2
#define I2C2_SDA_GPIO        USBDM::GpioA<13>
#define I2C2_SDA_FN          5
#endif

// Pin Mapping for I2C2_SCL signal
//   <o> I2C2_SCL [PTA12, PTA14]<name=I2C2_SCL_PIN_SEL>
//   <i> Shows which pin I2C2_SCL is mapped to
//     <0=> Disabled
//     <1=> PTA12<selection=PTA12_SIG_SEL,I2C2_SCL>
//     <2=> PTA14<selection=PTA14_SIG_SEL,I2C2_SCL>
//     <0=> Default
#define I2C2_SCL_PIN_SEL     0
#if I2C2_SCL_PIN_SEL == 1
#define I2C2_SCL_GPIO        USBDM::GpioA<12>
#define I2C2_SCL_FN          5
#elif I2C2_SCL_PIN_SEL == 2
#define I2C2_SCL_GPIO        USBDM::GpioA<14>
#define I2C2_SCL_FN          5
#endif

