podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// </h>

// <h> Integrated Interchip Sound (I2S0)

// Pin Mapping for I2S0_RX_BCLK signal
//   <o> I2S0_RX_BCLK [PTC6, PTC9, PTE9, PTA14]<name=I2S0_RX_BCLK_PIN_SEL>
//   <i> Shows which pin I2S0_RX_BCLK is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,I2S0_RX_BCLK>
//     <2=> PTC9<selection=PTC9_SIG_SEL,I2S0_RX_BCLK>
//     <3=> PTE9<selection=PTE9_SIG_SEL,I2S0_RX_BCLK>
//     <4=> PTA14<selection=PTA14_SIG_SEL,I2S0_RX_BCLK>
//     <0=> Default
#define I2S0_RX_BCLK_PIN_SEL 0
#if I2S0_RX_BCLK_PIN_SEL == 1
#define I2S0_RX_BCLK_GPIO    USBDM::GpioC<6>
#define I2S0_RX_BCLK_FN      4
#elif I2S0_RX_BCLK_PIN_SEL == 2
#define I2S0_RX_BCLK_GPIO    USBDM::GpioC<9>
#define I2S0_RX_BCLK_FN      4
#elif I2S0_RX_BCLK_PIN_SEL == 3
#define I2S0_RX_BCLK_GPIO    USBDM::GpioE<9>
#define I2S0_RX_BCLK_FN      4
#elif I2S0_RX_BCLK_PIN_SEL == 4
#define I2S0_RX_BCLK_GPIO    USBDM::GpioA<14>
#define I2S0_RX_BCLK_FN      6
#endif

// Pin Mapping for I2S0_TX_FS signal
//   <o> I2S0_TX_FS [PTB19, PTE11, PTA13, PTC2]<name=I2S0_TX_FS_PIN_SEL>
//   <i> Shows which pin I2S0_TX_FS is mapped to
//     <0=> Disabled
//     <1=> PTB19<selection=PTB19_SIG_SEL,I2S0_TX_FS>
//     <2=> PTE11<selection=PTE11_SIG_SEL,I2S0_TX_FS>
//     <3=> PTA13<selection=PTA13_SIG_SEL,I2S0_TX_FS>
//     <4=> PTC2 (Alias:D6)<selection=PTC2_SIG_SEL,I2S0_TX_FS>
//     <0=> Default
#define I2S0_TX_FS_PIN_SEL   0
#if I2S0_TX_FS_PIN_SEL == 1
#define I2S0_TX_FS_GPIO      USBDM::GpioB<19>
#define I2S0_TX_FS_FN        4
#elif I2S0_TX_FS_PIN_SEL == 2
#define I2S0_TX_FS_GPIO      USBDM::GpioE<11>
#define I2S0_TX_FS_FN        4
#elif I2S0_TX_FS_PIN_SEL == 3
#define I2S0_TX_FS_GPIO      USBDM::GpioA<13>
#define I2S0_TX_FS_FN        6
#elif I2S0_TX_FS_PIN_SEL == 4
#define I2S0_TX_FS_GPIO      USBDM::GpioC<2>
#define I2S0_TX_FS_FN        6
#endif

// Pin Mapping for I2S0_MCLK signal
//   <o> I2S0_MCLK [PTC8, PTE6, PTA17, PTC6]<name=I2S0_MCLK_PIN_SEL>
//   <i> Shows which pin I2S0_MCLK is mapped to
//     <0=> Disabled
//     <1=> PTC8<selection=PTC8_SIG_SEL,I2S0_MCLK>
//     <2=> PTE6<selection=PTE6_SIG_SEL,I2S0_MCLK>
//     <3=> PTA17<selection=PTA17_SIG_SEL,I2S0_MCLK>
//     <4=> PTC6<selection=PTC6_SIG_SEL,I2S0_MCLK>
//     <0=> Default
#define I2S0_MCLK_PIN_SEL    0
#if I2S0_MCLK_PIN_SEL == 1
#define I2S0_MCLK_GPIO       USBDM::GpioC<8>
#define I2S0_MCLK_FN         4
#elif I2S0_MCLK_PIN_SEL == 2
#define I2S0_MCLK_GPIO       USBDM::GpioE<6>
#define I2S0_MCLK_FN         4
#elif I2S0_MCLK_PIN_SEL == 3
#define I2S0_MCLK_GPIO       USBDM::GpioA<17>
#define I2S0_MCLK_FN         6
#elif I2S0_MCLK_PIN_SEL == 4
#define I2S0_MCLK_GPIO       USBDM::GpioC<6>
#define I2S0_MCLK_FN         6
#endif

// Pin Mapping for I2S0_RX_FS signal
//   <o> I2S0_RX_FS [PTC7, PTC10, PTE8, PTA16]<name=I2S0_RX_FS_PIN_SEL>
//   <i> Shows which pin I2S0_RX_FS is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,I2S0_RX_FS>
//     <2=> PTC10 (Alias:A5)<selection=PTC10_SIG_SEL,I2S0_RX_FS>
//     <3=> PTE8<selection=PTE8_SIG_SEL,I2S0_RX_FS>
//     <4=> PTA16<selection=PTA16_SIG_SEL,I2S0_RX_FS>
//     <0=> Default
#define I2S0_RX_FS_PIN_SEL   0
#if I2S0_RX_FS_PIN_SEL == 1
#define I2S0_RX_FS_GPIO      USBDM::GpioC<7>
#define I2S0_RX_FS_FN        4
#elif I2S0_RX_FS_PIN_SEL == 2
#define I2S0_RX_FS_GPIO      USBDM::GpioC<10>
#define I2S0_RX_FS_FN        4
#elif I2S0_RX_FS_PIN_SEL == 3
#define I2S0_RX_FS_GPIO      USBDM::GpioE<8>
#define I2S0_RX_FS_FN        4
#elif I2S0_RX_FS_PIN_SEL == 4
#define I2S0_RX_FS_GPIO      USBDM::GpioA<16>
#define I2S0_RX_FS_FN        6
#endif

// Pin Mapping for I2S0_TX_BCLK signal
//   <o> I2S0_TX_BCLK [PTB18, PTE12, PTA5, PTC3]<name=I2S0_TX_BCLK_PIN_SEL>
//   <i> Shows which pin I2S0_TX_BCLK is mapped to
//     <0=> Disabled
//     <1=> PTB18<selection=PTB18_SIG_SEL,I2S0_TX_BCLK>
//     <2=> PTE12<selection=PTE12_SIG_SEL,I2S0_TX_BCLK>
//     <3=> PTA5<selection=PTA5_SIG_SEL,I2S0_TX_BCLK>
//     <4=> PTC3 (Alias:D7)<selection=PTC3_SIG_SEL,I2S0_TX_BCLK>
//     <0=> Default
#define I2S0_TX_BCLK_PIN_SEL 0
#if I2S0_TX_BCLK_PIN_SEL == 1
#define I2S0_TX_BCLK_GPIO    USBDM::GpioB<18>
#define I2S0_TX_BCLK_FN      4
#elif I2S0_TX_BCLK_PIN_SEL == 2
#define I2S0_TX_BCLK_GPIO    USBDM::GpioE<12>
#define I2S0_TX_BCLK_FN      4
#elif I2S0_TX_BCLK_PIN_SEL == 3
#define I2S0_TX_BCLK_GPIO    USBDM::GpioA<5>
#define I2S0_TX_BCLK_FN      6
#elif I2S0_TX_BCLK_PIN_SEL == 4
#define I2S0_TX_BCLK_GPIO    USBDM::GpioC<3>
#define I2S0_TX_BCLK_FN      6
#endif

// Pin Mapping for I2S0_TXD1 signal
//   <o> I2S0_TXD1 [PTE9, PTC0, PTA14]<name=I2S0_TXD1_PIN_SEL>
//   <i> Shows which pin I2S0_TXD1 is mapped to
//     <0=> Disabled
//     <1=> PTE9<selection=PTE9_SIG_SEL,I2S0_TXD1>
//     <2=> PTC0<selection=PTC0_SIG_SEL,I2S0_TXD1>
//     <3=> PTA14<selection=PTA14_SIG_SEL,I2S0_TXD1>
//     <0=> Default
#define I2S0_TXD1_PIN_SEL    0
#if I2S0_TXD1_PIN_SEL == 1
#define I2S0_TXD1_GPIO       USBDM::GpioE<9>
#define I2S0_TXD1_FN         2
#elif I2S0_TXD1_PIN_SEL == 2
#define I2S0_TXD1_GPIO       USBDM::GpioC<0>
#define I2S0_TXD1_FN         6
#elif I2S0_TXD1_PIN_SEL == 3
#define I2S0_TXD1_GPIO       USBDM::GpioA<14>
#define I2S0_TXD1_FN         7
#endif

// Pin Mapping for I2S0_TXD0 signal
//   <o> I2S0_TXD0 [PTE10, PTA12, PTC1]<name=I2S0_TXD0_PIN_SEL>
//   <i> Shows which pin I2S0_TXD0 is mapped to
//     <0=> Disabled
//     <1=> PTE10<selection=PTE10_SIG_SEL,I2S0_TXD0>
//     <2=> PTA12<selection=PTA12_SIG_SEL,I2S0_TXD0>
//     <3=> PTC1<selection=PTC1_SIG_SEL,I2S0_TXD0>
//     <0=> Default
#define I2S0_TXD0_PIN_SEL    0
#if I2S0_TXD0_PIN_SEL == 1
#define I2S0_TXD0_GPIO       USBDM::GpioE<10>
#define I2S0_TXD0_FN         4
#elif I2S0_TXD0_PIN_SEL == 2
#define I2S0_TXD0_GPIO       USBDM::GpioA<12>
#define I2S0_TXD0_FN         6
#elif I2S0_TXD0_PIN_SEL == 3
#define I2S0_TXD0_GPIO       USBDM::GpioC<1>
#define I2S0_TXD0_FN         6
#endif

// Pin Mapping for I2S0_RXD1 signal
//   <o> I2S0_RXD1 [PTE8, PTC11, PTA16]<name=I2S0_RXD1_PIN_SEL>
//   <i> Shows which pin I2S0_RXD1 is mapped to
//     <0=> Disabled
//     <1=> PTE8<selection=PTE8_SIG_SEL,I2S0_RXD1>
//     <2=> PTC11 (Alias:A4)<selection=PTC11_SIG_SEL,I2S0_RXD1>
//     <3=> PTA16<selection=PTA16_SIG_SEL,I2S0_RXD1>
//     <0=> Default
#define I2S0_RXD1_PIN_SEL    0
#if I2S0_RXD1_PIN_SEL == 1
#define I2S0_RXD1_GPIO       USBDM::GpioE<8>
#define I2S0_RXD1_FN         2
#elif I2S0_RXD1_PIN_SEL == 2
#define I2S0_RXD1_GPIO       USBDM::GpioC<11>
#define I2S0_RXD1_FN         4
#elif I2S0_RXD1_PIN_SEL == 3
#define I2S0_RXD1_GPIO       USBDM::GpioA<16>
#define I2S0_RXD1_FN         7
#endif

// Pin Mapping for I2S0_RXD0 signal
//   <o> I2S0_RXD0 [PTC5, PTE7, PTA15]<name=I2S0_RXD0_PIN_SEL>
//   <i> Shows which pin I2S0_RXD0 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,I2S0_RXD0>
//     <2=> PTE7<selection=PTE7_SIG_SEL,I2S0_RXD0>
//     <3=> PTA15<selection=PTA15_SIG_SEL,I2S0_RXD0>
//     <0=> Default
#define I2S0_RXD0_PIN_SEL    0
#if I2S0_RXD0_PIN_SEL == 1
#define I2S0_RXD0_GPIO       USBDM::GpioC<5>
#define I2S0_RXD0_FN         4
#elif I2S0_RXD0_PIN_SEL == 2
#define I2S0_RXD0_GPIO       USBDM::GpioE<7>
#define I2S0_RXD0_FN         4
#elif I2S0_RXD0_PIN_SEL == 3
#define I2S0_RXD0_GPIO       USBDM::GpioA<15>
#define I2S0_RXD0_FN         6
#endif

