podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// </h>

// <h> Debug and Control

// Pin Mapping for JTAG_TCLK signal
//   <o> JTAG_TCLK [PTA0]<name=JTAG_TCLK_PIN_SEL>
//   <i> Shows which pin JTAG_TCLK is mapped to
//     <0=> Disabled
//     <1=> PTA0 (Alias:D8) (reset default)<selection=PTA0_SIG_SEL,JTAG_TCLK/SWD_CLK (reset default)>
//     <2=> PTA0 (Alias:D8)<selection=PTA0_SIG_SEL,JTAG_TCLK/SWD_CLK>
//     <1=> Default
#define JTAG_TCLK_PIN_SEL    1
#if JTAG_TCLK_PIN_SEL == 2
#define JTAG_TCLK_GPIO       USBDM::GpioA<0>
#define JTAG_TCLK_FN         7
#endif

// Pin Mapping for JTAG_TDI signal
//   <o> JTAG_TDI [PTA1]<name=JTAG_TDI_PIN_SEL>
//   <i> Shows which pin JTAG_TDI is mapped to
//     <0=> Disabled
//     <1=> PTA1 (Alias:D3) (reset default)<selection=PTA1_SIG_SEL,JTAG_TDI (reset default)>
//     <2=> PTA1 (Alias:D3)<selection=PTA1_SIG_SEL,JTAG_TDI>
//     <0=> Default
#define JTAG_TDI_PIN_SEL     0
#if JTAG_TDI_PIN_SEL == 2
#define JTAG_TDI_GPIO        USBDM::GpioA<1>
#define JTAG_TDI_FN          7
#endif

// Pin Mapping for JTAG_TDO signal
//   <o> JTAG_TDO [PTA2]<name=JTAG_TDO_PIN_SEL>
//   <i> Shows which pin JTAG_TDO is mapped to
//     <0=> Disabled
//     <1=> PTA2 (Alias:D5) (reset default)<selection=PTA2_SIG_SEL,JTAG_TDO/TRACE_SWO (reset default)>
//     <2=> PTA2 (Alias:D5)<selection=PTA2_SIG_SEL,JTAG_TDO/TRACE_SWO>
//     <0=> Default
#define JTAG_TDO_PIN_SEL     0
#if JTAG_TDO_PIN_SEL == 2
#define JTAG_TDO_GPIO        USBDM::GpioA<2>
#define JTAG_TDO_FN          7
#endif

// Pin Mapping for JTAG_TMS signal
//   <o> JTAG_TMS [PTA3]<name=JTAG_TMS_PIN_SEL>
//   <i> Shows which pin JTAG_TMS is mapped to
//     <0=> Disabled
//     <1=> PTA3 (reset default)<selection=PTA3_SIG_SEL,JTAG_TMS/SWD_DIO (reset default)>
//     <2=> PTA3<selection=PTA3_SIG_SEL,JTAG_TMS/SWD_DIO>
//     <1=> Default
#define JTAG_TMS_PIN_SEL     1
#if JTAG_TMS_PIN_SEL == 2
#define JTAG_TMS_GPIO        USBDM::GpioA<3>
#define JTAG_TMS_FN          7
#endif

// Pin Mapping for JTAG_TRST_b signal
//   <o> JTAG_TRST_b [PTA5]<name=JTAG_TRST_b_PIN_SEL>
//   <i> Shows which pin JTAG_TRST_b is mapped to
//     <0=> Disabled
//     <1=> PTA5 (reset default)<selection=PTA5_SIG_SEL,JTAG_TRST_b (reset default)>
//     <2=> PTA5<selection=PTA5_SIG_SEL,JTAG_TRST_b>
//     <1=> Default
#define JTAG_TRST_b_PIN_SEL  1
#if JTAG_TRST_b_PIN_SEL == 2
#define JTAG_TRST_b_GPIO     USBDM::GpioA<5>
#define JTAG_TRST_b_FN       7
#endif

// Pin Mapping for NMI_b signal
//   <o> NMI_b [PTA4]<name=NMI_b_PIN_SEL>
//   <i> Shows which pin NMI_b is mapped to
//     <0=> Disabled
//     <1=> PTA4 (reset default)<selection=PTA4_SIG_SEL,NMI_b (reset default)>
//     <2=> PTA4<selection=PTA4_SIG_SEL,NMI_b>
//     <1=> Default
#define NMI_b_PIN_SEL        1
#if NMI_b_PIN_SEL == 2
#define NMI_b_GPIO           USBDM::GpioA<4>
#define NMI_b_FN             7
#endif

// Pin Mapping for SWD_CLK signal
//   <o> SWD_CLK [PTA0]<name=SWD_CLK_PIN_SEL>
//   <i> Shows which pin SWD_CLK is mapped to
//     <0=> Disabled
//     <1=> PTA0 (Alias:D8) (reset default)<selection=PTA0_SIG_SEL,JTAG_TCLK/SWD_CLK (reset default)>
//     <2=> PTA0 (Alias:D8)<selection=PTA0_SIG_SEL,JTAG_TCLK/SWD_CLK>
//     <1=> Default
#define SWD_CLK_PIN_SEL      1
#if SWD_CLK_PIN_SEL == 2
#define SWD_CLK_GPIO         USBDM::GpioA<0>
#define SWD_CLK_FN           7
#endif

// Pin Mapping for SWD_DIO signal
//   <o> SWD_DIO [PTA3]<name=SWD_DIO_PIN_SEL>
//   <i> Shows which pin SWD_DIO is mapped to
//     <0=> Disabled
//     <1=> PTA3 (reset default)<selection=PTA3_SIG_SEL,JTAG_TMS/SWD_DIO (reset default)>
//     <2=> PTA3<selection=PTA3_SIG_SEL,JTAG_TMS/SWD_DIO>
//     <1=> Default
#define SWD_DIO_PIN_SEL      1
#if SWD_DIO_PIN_SEL == 2
#define SWD_DIO_GPIO         USBDM::GpioA<3>
#define SWD_DIO_FN           7
#endif

// Pin Mapping for TRACE_CLKOUT signal
//   <o> TRACE_CLKOUT [PTE0, PTA6]<name=TRACE_CLKOUT_PIN_SEL>
//   <i> Shows which pin TRACE_CLKOUT is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,TRACE_CLKOUT>
//     <2=> PTA6<selection=PTA6_SIG_SEL,TRACE_CLKOUT>
//     <0=> Default
#define TRACE_CLKOUT_PIN_SEL 0
#if TRACE_CLKOUT_PIN_SEL == 1
#define TRACE_CLKOUT_GPIO    USBDM::GpioE<0>
#define TRACE_CLKOUT_FN      5
#elif TRACE_CLKOUT_PIN_SEL == 2
#define TRACE_CLKOUT_GPIO    USBDM::GpioA<6>
#define TRACE_CLKOUT_FN      7
#endif

// Pin Mapping for TRACE_D0 signal
//   <o> TRACE_D0 [PTE4, PTA10]<name=TRACE_D0_PIN_SEL>
//   <i> Shows which pin TRACE_D0 is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,TRACE_D0>
//     <2=> PTA10<selection=PTA10_SIG_SEL,TRACE_D0>
//     <0=> Default
#define TRACE_D0_PIN_SEL     0
#if TRACE_D0_PIN_SEL == 1
#define TRACE_D0_GPIO        USBDM::GpioE<4>
#define TRACE_D0_FN          5
#elif TRACE_D0_PIN_SEL == 2
#define TRACE_D0_GPIO        USBDM::GpioA<10>
#define TRACE_D0_FN          7
#endif

// Pin Mapping for TRACE_D1 signal
//   <o> TRACE_D1 [PTE3, PTA9]<name=TRACE_D1_PIN_SEL>
//   <i> Shows which pin TRACE_D1 is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,TRACE_D1>
//     <2=> PTA9<selection=PTA9_SIG_SEL,TRACE_D1>
//     <0=> Default
#define TRACE_D1_PIN_SEL     0
#if TRACE_D1_PIN_SEL == 1
#define TRACE_D1_GPIO        USBDM::GpioE<3>
#define TRACE_D1_FN          5
#elif TRACE_D1_PIN_SEL == 2
#define TRACE_D1_GPIO        USBDM::GpioA<9>
#define TRACE_D1_FN          7
#endif

// Pin Mapping for TRACE_D2 signal
//   <o> TRACE_D2 [PTE2, PTA8]<name=TRACE_D2_PIN_SEL>
//   <i> Shows which pin TRACE_D2 is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,TRACE_D2>
//     <2=> PTA8<selection=PTA8_SIG_SEL,TRACE_D2>
//     <0=> Default
#define TRACE_D2_PIN_SEL     0
#if TRACE_D2_PIN_SEL == 1
#define TRACE_D2_GPIO        USBDM::GpioE<2>
#define TRACE_D2_FN          5
#elif TRACE_D2_PIN_SEL == 2
#define TRACE_D2_GPIO        USBDM::GpioA<8>
#define TRACE_D2_FN          7
#endif

// Pin Mapping for TRACE_D3 signal
//   <o> TRACE_D3 [PTE1, PTA7]<name=TRACE_D3_PIN_SEL>
//   <i> Shows which pin TRACE_D3 is mapped to
//     <0=> Disabled
//     <1=> PTE1<selection=PTE1_SIG_SEL,TRACE_D3>
//     <2=> PTA7<selection=PTA7_SIG_SEL,TRACE_D3>
//     <0=> Default
#define TRACE_D3_PIN_SEL     0
#if TRACE_D3_PIN_SEL == 1
#define TRACE_D3_GPIO        USBDM::GpioE<1>
#define TRACE_D3_FN          5
#elif TRACE_D3_PIN_SEL == 2
#define TRACE_D3_GPIO        USBDM::GpioA<7>
#define TRACE_D3_FN          7
#endif

// Pin Mapping for TRACE_SWO signal
//   <o> TRACE_SWO [PTA2]<name=TRACE_SWO_PIN_SEL>
//   <i> Shows which pin TRACE_SWO is mapped to
//     <0=> Disabled
//     <1=> PTA2 (Alias:D5) (reset default)<selection=PTA2_SIG_SEL,JTAG_TDO/TRACE_SWO (reset default)>
//     <2=> PTA2 (Alias:D5)<selection=PTA2_SIG_SEL,JTAG_TDO/TRACE_SWO>
//     <0=> Default
#define TRACE_SWO_PIN_SEL    0
#if TRACE_SWO_PIN_SEL == 2
#define TRACE_SWO_GPIO       USBDM::GpioA<2>
#define TRACE_SWO_FN         7
#endif

