podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// </h>

// <h> Low Power Timer (LPTMR)

// Pin Mapping for LPTMR0_ALT1 signal
//   <o> LPTMR0_ALT1 [PTA19]<name=LPTMR0_ALT1_PIN_SEL>
//   <i> Shows which pin LPTMR0_ALT1 is mapped to
//     <0=> Disabled
//     <1=> PTA19<selection=PTA19_SIG_SEL,LPTMR0_ALT1>
//     <0=> Default
#define LPTMR0_ALT1_PIN_SEL  0
#if LPTMR0_ALT1_PIN_SEL == 1
#define LPTMR0_ALT1_GPIO     USBDM::GpioA<19>
#define LPTMR0_ALT1_FN       6
#endif

// Pin Mapping for LPTMR0_ALT2 signal
//   <o> LPTMR0_ALT2 [PTC5]<name=LPTMR0_ALT2_PIN_SEL>
//   <i> Shows which pin LPTMR0_ALT2 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,LPTMR0_ALT2>
//     <0=> Default
#define LPTMR0_ALT2_PIN_SEL  0
#if LPTMR0_ALT2_PIN_SEL == 1
#define LPTMR0_ALT2_GPIO     USBDM::GpioC<5>
#define LPTMR0_ALT2_FN       3
#endif

// </h>

// <h> Ethernet (MII0)

// Pin Mapping for MII0_COL signal
//   <o> MII0_COL [PTA29]<name=MII0_COL_PIN_SEL>
//   <i> Shows which pin MII0_COL is mapped to
//     <0=> Disabled
//     <1=> PTA29<selection=PTA29_SIG_SEL,MII0_COL>
//     <0=> Default
#define MII0_COL_PIN_SEL     0
#if MII0_COL_PIN_SEL == 1
#define MII0_COL_GPIO        USBDM::GpioA<29>
#define MII0_COL_FN          4
#endif

// Pin Mapping for MII0_CRS signal
//   <o> MII0_CRS [PTA27]<name=MII0_CRS_PIN_SEL>
//   <i> Shows which pin MII0_CRS is mapped to
//     <0=> Disabled
//     <1=> PTA27<selection=PTA27_SIG_SEL,MII0_CRS>
//     <0=> Default
#define MII0_CRS_PIN_SEL     0
#if MII0_CRS_PIN_SEL == 1
#define MII0_CRS_GPIO        USBDM::GpioA<27>
#define MII0_CRS_FN          4
#endif

// Pin Mapping for MII0_MDC signal
//   <o> MII0_MDC [PTB1]<name=MII0_MDC_PIN_SEL>
//   <i> Shows which pin MII0_MDC is mapped to
//     <0=> Disabled
//     <1=> PTB1<selection=PTB1_SIG_SEL,RMII0_MDC/MII0_MDC>
//     <0=> Default
#define MII0_MDC_PIN_SEL     0
#if MII0_MDC_PIN_SEL == 1
#define MII0_MDC_GPIO        USBDM::GpioB<1>
#define MII0_MDC_FN          4
#endif

// Pin Mapping for MII0_MDIO signal
//   <o> MII0_MDIO [PTB0]<name=MII0_MDIO_PIN_SEL>
//   <i> Shows which pin MII0_MDIO is mapped to
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,RMII0_MDIO/MII0_MDIO>
//     <0=> Default
#define MII0_MDIO_PIN_SEL    0
#if MII0_MDIO_PIN_SEL == 1
#define MII0_MDIO_GPIO       USBDM::GpioB<0>
#define MII0_MDIO_FN         4
#endif

// Pin Mapping for MII0_RXCLK signal
//   <o> MII0_RXCLK [PTA11]<name=MII0_RXCLK_PIN_SEL>
//   <i> Shows which pin MII0_RXCLK is mapped to
//     <0=> Disabled
//     <1=> PTA11<selection=PTA11_SIG_SEL,MII0_RXCLK>
//     <0=> Default
#define MII0_RXCLK_PIN_SEL   0
#if MII0_RXCLK_PIN_SEL == 1
#define MII0_RXCLK_GPIO      USBDM::GpioA<11>
#define MII0_RXCLK_FN        4
#endif

// Pin Mapping for MII0_RXD0 signal
//   <o> MII0_RXD0 [PTA13]<name=MII0_RXD0_PIN_SEL>
//   <i> Shows which pin MII0_RXD0 is mapped to
//     <0=> Disabled
//     <1=> PTA13<selection=PTA13_SIG_SEL,RMII0_RXD0/MII0_RXD0>
//     <0=> Default
#define MII0_RXD0_PIN_SEL    0
#if MII0_RXD0_PIN_SEL == 1
#define MII0_RXD0_GPIO       USBDM::GpioA<13>
#define MII0_RXD0_FN         4
#endif

// Pin Mapping for MII0_RXD1 signal
//   <o> MII0_RXD1 [PTA12]<name=MII0_RXD1_PIN_SEL>
//   <i> Shows which pin MII0_RXD1 is mapped to
//     <0=> Disabled
//     <1=> PTA12<selection=PTA12_SIG_SEL,RMII0_RXD1/MII0_RXD1>
//     <0=> Default
#define MII0_RXD1_PIN_SEL    0
#if MII0_RXD1_PIN_SEL == 1
#define MII0_RXD1_GPIO       USBDM::GpioA<12>
#define MII0_RXD1_FN         4
#endif

// Pin Mapping for MII0_RXD2 signal
//   <o> MII0_RXD2 [PTA10]<name=MII0_RXD2_PIN_SEL>
//   <i> Shows which pin MII0_RXD2 is mapped to
//     <0=> Disabled
//     <1=> PTA10<selection=PTA10_SIG_SEL,MII0_RXD2>
//     <0=> Default
#define MII0_RXD2_PIN_SEL    0
#if MII0_RXD2_PIN_SEL == 1
#define MII0_RXD2_GPIO       USBDM::GpioA<10>
#define MII0_RXD2_FN         4
#endif

// Pin Mapping for MII0_RXD3 signal
//   <o> MII0_RXD3 [PTA9]<name=MII0_RXD3_PIN_SEL>
//   <i> Shows which pin MII0_RXD3 is mapped to
//     <0=> Disabled
//     <1=> PTA9<selection=PTA9_SIG_SEL,MII0_RXD3>
//     <0=> Default
#define MII0_RXD3_PIN_SEL    0
#if MII0_RXD3_PIN_SEL == 1
#define MII0_RXD3_GPIO       USBDM::GpioA<9>
#define MII0_RXD3_FN         4
#endif

// Pin Mapping for MII0_RXDV signal
//   <o> MII0_RXDV [PTA14]<name=MII0_RXDV_PIN_SEL>
//   <i> Shows which pin MII0_RXDV is mapped to
//     <0=> Disabled
//     <1=> PTA14<selection=PTA14_SIG_SEL,RMII0_CRS_DV/MII0_RXDV>
//     <0=> Default
#define MII0_RXDV_PIN_SEL    0
#if MII0_RXDV_PIN_SEL == 1
#define MII0_RXDV_GPIO       USBDM::GpioA<14>
#define MII0_RXDV_FN         4
#endif

// Pin Mapping for MII0_RXER signal
//   <o> MII0_RXER [PTA5]<name=MII0_RXER_PIN_SEL>
//   <i> Shows which pin MII0_RXER is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,RMII0_RXER/MII0_RXER>
//     <0=> Default
#define MII0_RXER_PIN_SEL    0
#if MII0_RXER_PIN_SEL == 1
#define MII0_RXER_GPIO       USBDM::GpioA<5>
#define MII0_RXER_FN         4
#endif

// Pin Mapping for MII0_TXCLK signal
//   <o> MII0_TXCLK [PTA25]<name=MII0_TXCLK_PIN_SEL>
//   <i> Shows which pin MII0_TXCLK is mapped to
//     <0=> Disabled
//     <1=> PTA25<selection=PTA25_SIG_SEL,MII0_TXCLK>
//     <0=> Default
#define MII0_TXCLK_PIN_SEL   0
#if MII0_TXCLK_PIN_SEL == 1
#define MII0_TXCLK_GPIO      USBDM::GpioA<25>
#define MII0_TXCLK_FN        4
#endif

// Pin Mapping for MII0_TXD0 signal
//   <o> MII0_TXD0 [PTA16]<name=MII0_TXD0_PIN_SEL>
//   <i> Shows which pin MII0_TXD0 is mapped to
//     <0=> Disabled
//     <1=> PTA16<selection=PTA16_SIG_SEL,RMII0_TXD0/MII0_TXD0>
//     <0=> Default
#define MII0_TXD0_PIN_SEL    0
#if MII0_TXD0_PIN_SEL == 1
#define MII0_TXD0_GPIO       USBDM::GpioA<16>
#define MII0_TXD0_FN         4
#endif

// Pin Mapping for MII0_TXD1 signal
//   <o> MII0_TXD1 [PTA17]<name=MII0_TXD1_PIN_SEL>
//   <i> Shows which pin MII0_TXD1 is mapped to
//     <0=> Disabled
//     <1=> PTA17<selection=PTA17_SIG_SEL,RMII0_TXD1/MII0_TXD1>
//     <0=> Default
#define MII0_TXD1_PIN_SEL    0
#if MII0_TXD1_PIN_SEL == 1
#define MII0_TXD1_GPIO       USBDM::GpioA<17>
#define MII0_TXD1_FN         4
#endif

// Pin Mapping for MII0_TXD2 signal
//   <o> MII0_TXD2 [PTA24]<name=MII0_TXD2_PIN_SEL>
//   <i> Shows which pin MII0_TXD2 is mapped to
//     <0=> Disabled
//     <1=> PTA24<selection=PTA24_SIG_SEL,MII0_TXD2>
//     <0=> Default
#define MII0_TXD2_PIN_SEL    0
#if MII0_TXD2_PIN_SEL == 1
#define MII0_TXD2_GPIO       USBDM::GpioA<24>
#define MII0_TXD2_FN         4
#endif

// Pin Mapping for MII0_TXD3 signal
//   <o> MII0_TXD3 [PTA26]<name=MII0_TXD3_PIN_SEL>
//   <i> Shows which pin MII0_TXD3 is mapped to
//     <0=> Disabled
//     <1=> PTA26<selection=PTA26_SIG_SEL,MII0_TXD3>
//     <0=> Default
#define MII0_TXD3_PIN_SEL    0
#if MII0_TXD3_PIN_SEL == 1
#define MII0_TXD3_GPIO       USBDM::GpioA<26>
#define MII0_TXD3_FN         4
#endif

// Pin Mapping for MII0_TXEN signal
//   <o> MII0_TXEN [PTA15]<name=MII0_TXEN_PIN_SEL>
//   <i> Shows which pin MII0_TXEN is mapped to
//     <0=> Disabled
//     <1=> PTA15<selection=PTA15_SIG_SEL,RMII0_TXEN/MII0_TXEN>
//     <0=> Default
#define MII0_TXEN_PIN_SEL    0
#if MII0_TXEN_PIN_SEL == 1
#define MII0_TXEN_GPIO       USBDM::GpioA<15>
#define MII0_TXEN_FN         4
#endif

// Pin Mapping for MII0_TXER signal
//   <o> MII0_TXER [PTA28]<name=MII0_TXER_PIN_SEL>
//   <i> Shows which pin MII0_TXER is mapped to
//     <0=> Disabled
//     <1=> PTA28<selection=PTA28_SIG_SEL,MII0_TXER>
//     <0=> Default
#define MII0_TXER_PIN_SEL    0
#if MII0_TXER_PIN_SEL == 1
#define MII0_TXER_GPIO       USBDM::GpioA<28>
#define MII0_TXER_FN         4
#endif

