podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// </h>

// <h> Programmable Delay Block (PDB0)

// Pin Mapping for PDB0_EXTRG signal
//   <o> PDB0_EXTRG [PTC0, PTC6]<name=PDB0_EXTRG_PIN_SEL>
//   <i> Shows which pin PDB0_EXTRG is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,PDB0_EXTRG>
//     <2=> PTC6<selection=PTC6_SIG_SEL,PDB0_EXTRG>
//     <0=> Default
#define PDB0_EXTRG_PIN_SEL   0
#if PDB0_EXTRG_PIN_SEL == 1
#define PDB0_EXTRG_GPIO      USBDM::GpioC<0>
#define PDB0_EXTRG_FN        3
#elif PDB0_EXTRG_PIN_SEL == 2
#define PDB0_EXTRG_GPIO      USBDM::GpioC<6>
#define PDB0_EXTRG_FN        3
#endif

// </h>

// <h> Ethernet (RMII0)

// Pin Mapping for RMII0_CRS_DV signal
//   <o> RMII0_CRS_DV [PTA14]<name=RMII0_CRS_DV_PIN_SEL>
//   <i> Shows which pin RMII0_CRS_DV is mapped to
//     <0=> Disabled
//     <1=> PTA14<selection=PTA14_SIG_SEL,RMII0_CRS_DV/MII0_RXDV>
//     <0=> Default
#define RMII0_CRS_DV_PIN_SEL 0
#if RMII0_CRS_DV_PIN_SEL == 1
#define RMII0_CRS_DV_GPIO    USBDM::GpioA<14>
#define RMII0_CRS_DV_FN      4
#endif

// Pin Mapping for RMII0_MDC signal
//   <o> RMII0_MDC [PTB1]<name=RMII0_MDC_PIN_SEL>
//   <i> Shows which pin RMII0_MDC is mapped to
//     <0=> Disabled
//     <1=> PTB1<selection=PTB1_SIG_SEL,RMII0_MDC/MII0_MDC>
//     <0=> Default
#define RMII0_MDC_PIN_SEL    0
#if RMII0_MDC_PIN_SEL == 1
#define RMII0_MDC_GPIO       USBDM::GpioB<1>
#define RMII0_MDC_FN         4
#endif

// Pin Mapping for RMII0_MDIO signal
//   <o> RMII0_MDIO [PTB0]<name=RMII0_MDIO_PIN_SEL>
//   <i> Shows which pin RMII0_MDIO is mapped to
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,RMII0_MDIO/MII0_MDIO>
//     <0=> Default
#define RMII0_MDIO_PIN_SEL   0
#if RMII0_MDIO_PIN_SEL == 1
#define RMII0_MDIO_GPIO      USBDM::GpioB<0>
#define RMII0_MDIO_FN        4
#endif

// Pin Mapping for RMII0_RXD0 signal
//   <o> RMII0_RXD0 [PTA13]<name=RMII0_RXD0_PIN_SEL>
//   <i> Shows which pin RMII0_RXD0 is mapped to
//     <0=> Disabled
//     <1=> PTA13<selection=PTA13_SIG_SEL,RMII0_RXD0/MII0_RXD0>
//     <0=> Default
#define RMII0_RXD0_PIN_SEL   0
#if RMII0_RXD0_PIN_SEL == 1
#define RMII0_RXD0_GPIO      USBDM::GpioA<13>
#define RMII0_RXD0_FN        4
#endif

// Pin Mapping for RMII0_RXD1 signal
//   <o> RMII0_RXD1 [PTA12]<name=RMII0_RXD1_PIN_SEL>
//   <i> Shows which pin RMII0_RXD1 is mapped to
//     <0=> Disabled
//     <1=> PTA12<selection=PTA12_SIG_SEL,RMII0_RXD1/MII0_RXD1>
//     <0=> Default
#define RMII0_RXD1_PIN_SEL   0
#if RMII0_RXD1_PIN_SEL == 1
#define RMII0_RXD1_GPIO      USBDM::GpioA<12>
#define RMII0_RXD1_FN        4
#endif

// Pin Mapping for RMII0_RXER signal
//   <o> RMII0_RXER [PTA5]<name=RMII0_RXER_PIN_SEL>
//   <i> Shows which pin RMII0_RXER is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,RMII0_RXER/MII0_RXER>
//     <0=> Default
#define RMII0_RXER_PIN_SEL   0
#if RMII0_RXER_PIN_SEL == 1
#define RMII0_RXER_GPIO      USBDM::GpioA<5>
#define RMII0_RXER_FN        4
#endif

// Pin Mapping for RMII0_TXD0 signal
//   <o> RMII0_TXD0 [PTA16]<name=RMII0_TXD0_PIN_SEL>
//   <i> Shows which pin RMII0_TXD0 is mapped to
//     <0=> Disabled
//     <1=> PTA16<selection=PTA16_SIG_SEL,RMII0_TXD0/MII0_TXD0>
//     <0=> Default
#define RMII0_TXD0_PIN_SEL   0
#if RMII0_TXD0_PIN_SEL == 1
#define RMII0_TXD0_GPIO      USBDM::GpioA<16>
#define RMII0_TXD0_FN        4
#endif

// Pin Mapping for RMII0_TXD1 signal
//   <o> RMII0_TXD1 [PTA17]<name=RMII0_TXD1_PIN_SEL>
//   <i> Shows which pin RMII0_TXD1 is mapped to
//     <0=> Disabled
//     <1=> PTA17<selection=PTA17_SIG_SEL,RMII0_TXD1/MII0_TXD1>
//     <0=> Default
#define RMII0_TXD1_PIN_SEL   0
#if RMII0_TXD1_PIN_SEL == 1
#define RMII0_TXD1_GPIO      USBDM::GpioA<17>
#define RMII0_TXD1_FN        4
#endif

// Pin Mapping for RMII0_TXEN signal
//   <o> RMII0_TXEN [PTA15]<name=RMII0_TXEN_PIN_SEL>
//   <i> Shows which pin RMII0_TXEN is mapped to
//     <0=> Disabled
//     <1=> PTA15<selection=PTA15_SIG_SEL,RMII0_TXEN/MII0_TXEN>
//     <0=> Default
#define RMII0_TXEN_PIN_SEL   0
#if RMII0_TXEN_PIN_SEL == 1
#define RMII0_TXEN_GPIO      USBDM::GpioA<15>
#define RMII0_TXEN_FN        4
#endif

// </h>

// <h> Secured Digital Host Controller (SDHC0)

// Pin Mapping for SDHC0_CLKIN signal
//   <o> SDHC0_CLKIN [PTD11]<name=SDHC0_CLKIN_PIN_SEL>
//   <i> Shows which pin SDHC0_CLKIN is mapped to
//     <0=> Disabled
//     <1=> PTD11<selection=PTD11_SIG_SEL,SDHC0_CLKIN>
//     <0=> Default
#define SDHC0_CLKIN_PIN_SEL  0
#if SDHC0_CLKIN_PIN_SEL == 1
#define SDHC0_CLKIN_GPIO     USBDM::GpioD<11>
#define SDHC0_CLKIN_FN       4
#endif

// Pin Mapping for SDHC0_CMD signal
//   <o> SDHC0_CMD [PTE3]<name=SDHC0_CMD_PIN_SEL>
//   <i> Shows which pin SDHC0_CMD is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,SDHC0_CMD>
//     <0=> Default
#define SDHC0_CMD_PIN_SEL    0
#if SDHC0_CMD_PIN_SEL == 1
#define SDHC0_CMD_GPIO       USBDM::GpioE<3>
#define SDHC0_CMD_FN         4
#endif

// Pin Mapping for SDHC0_D0 signal
//   <o> SDHC0_D0 [PTE1]<name=SDHC0_D0_PIN_SEL>
//   <i> Shows which pin SDHC0_D0 is mapped to
//     <0=> Disabled
//     <1=> PTE1<selection=PTE1_SIG_SEL,SDHC0_D0>
//     <0=> Default
#define SDHC0_D0_PIN_SEL     0
#if SDHC0_D0_PIN_SEL == 1
#define SDHC0_D0_GPIO        USBDM::GpioE<1>
#define SDHC0_D0_FN          4
#endif

// Pin Mapping for SDHC0_D1 signal
//   <o> SDHC0_D1 [PTE0]<name=SDHC0_D1_PIN_SEL>
//   <i> Shows which pin SDHC0_D1 is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,SDHC0_D1>
//     <0=> Default
#define SDHC0_D1_PIN_SEL     0
#if SDHC0_D1_PIN_SEL == 1
#define SDHC0_D1_GPIO        USBDM::GpioE<0>
#define SDHC0_D1_FN          4
#endif

// Pin Mapping for SDHC0_D2 signal
//   <o> SDHC0_D2 [PTE5]<name=SDHC0_D2_PIN_SEL>
//   <i> Shows which pin SDHC0_D2 is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,SDHC0_D2>
//     <0=> Default
#define SDHC0_D2_PIN_SEL     0
#if SDHC0_D2_PIN_SEL == 1
#define SDHC0_D2_GPIO        USBDM::GpioE<5>
#define SDHC0_D2_FN          4
#endif

// Pin Mapping for SDHC0_D3 signal
//   <o> SDHC0_D3 [PTE4]<name=SDHC0_D3_PIN_SEL>
//   <i> Shows which pin SDHC0_D3 is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,SDHC0_D3>
//     <0=> Default
#define SDHC0_D3_PIN_SEL     0
#if SDHC0_D3_PIN_SEL == 1
#define SDHC0_D3_GPIO        USBDM::GpioE<4>
#define SDHC0_D3_FN          4
#endif

