podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for SDHC0_D4 signal
//   <o> SDHC0_D4 [PTD12]<name=SDHC0_D4_PIN_SEL>
//   <i> Shows which pin SDHC0_D4 is mapped to
//     <0=> Disabled
//     <1=> PTD12<selection=PTD12_SIG_SEL,SDHC0_D4>
//     <0=> Default
#define SDHC0_D4_PIN_SEL     0
#if SDHC0_D4_PIN_SEL == 1
#define SDHC0_D4_GPIO        USBDM::GpioD<12>
#define SDHC0_D4_FN          4
#endif

// Pin Mapping for SDHC0_D5 signal
//   <o> SDHC0_D5 [PTD13]<name=SDHC0_D5_PIN_SEL>
//   <i> Shows which pin SDHC0_D5 is mapped to
//     <0=> Disabled
//     <1=> PTD13<selection=PTD13_SIG_SEL,SDHC0_D5>
//     <0=> Default
#define SDHC0_D5_PIN_SEL     0
#if SDHC0_D5_PIN_SEL == 1
#define SDHC0_D5_GPIO        USBDM::GpioD<13>
#define SDHC0_D5_FN          4
#endif

// Pin Mapping for SDHC0_D6 signal
//   <o> SDHC0_D6 [PTD14]<name=SDHC0_D6_PIN_SEL>
//   <i> Shows which pin SDHC0_D6 is mapped to
//     <0=> Disabled
//     <1=> PTD14<selection=PTD14_SIG_SEL,SDHC0_D6>
//     <0=> Default
#define SDHC0_D6_PIN_SEL     0
#if SDHC0_D6_PIN_SEL == 1
#define SDHC0_D6_GPIO        USBDM::GpioD<14>
#define SDHC0_D6_FN          4
#endif

// Pin Mapping for SDHC0_D7 signal
//   <o> SDHC0_D7 [PTD15]<name=SDHC0_D7_PIN_SEL>
//   <i> Shows which pin SDHC0_D7 is mapped to
//     <0=> Disabled
//     <1=> PTD15<selection=PTD15_SIG_SEL,SDHC0_D7>
//     <0=> Default
#define SDHC0_D7_PIN_SEL     0
#if SDHC0_D7_PIN_SEL == 1
#define SDHC0_D7_GPIO        USBDM::GpioD<15>
#define SDHC0_D7_FN          4
#endif

// Pin Mapping for SDHC0_DCLK signal
//   <o> SDHC0_DCLK [PTE2]<name=SDHC0_DCLK_PIN_SEL>
//   <i> Shows which pin SDHC0_DCLK is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,SDHC0_DCLK>
//     <0=> Default
#define SDHC0_DCLK_PIN_SEL   0
#if SDHC0_DCLK_PIN_SEL == 1
#define SDHC0_DCLK_GPIO      USBDM::GpioE<2>
#define SDHC0_DCLK_FN        4
#endif

// </h>

// <h> Serial Peripheral Interface (SPI0)

// Pin Mapping for SPI0_PCS0 signal
//   <o> SPI0_PCS0 [PTA14, PTC4, PTD0]<name=SPI0_PCS0_PIN_SEL>
//   <i> Shows which pin SPI0_PCS0 is mapped to
//     <0=> Disabled
//     <1=> PTA14<selection=PTA14_SIG_SEL,SPI0_PCS0>
//     <2=> PTC4 (Alias:D9)<selection=PTC4_SIG_SEL,SPI0_PCS0>
//     <3=> PTD0 (Alias:D10)<selection=PTD0_SIG_SEL,SPI0_PCS0>
//     <0=> Default
#define SPI0_PCS0_PIN_SEL    0
#if SPI0_PCS0_PIN_SEL == 1
#define SPI0_PCS0_GPIO       USBDM::GpioA<14>
#define SPI0_PCS0_FN         2
#elif SPI0_PCS0_PIN_SEL == 2
#define SPI0_PCS0_GPIO       USBDM::GpioC<4>
#define SPI0_PCS0_FN         2
#elif SPI0_PCS0_PIN_SEL == 3
#define SPI0_PCS0_GPIO       USBDM::GpioD<0>
#define SPI0_PCS0_FN         2
#endif

// Pin Mapping for SPI0_PCS1 signal
//   <o> SPI0_PCS1 [PTC3, PTD4]<name=SPI0_PCS1_PIN_SEL>
//   <i> Shows which pin SPI0_PCS1 is mapped to
//     <0=> Disabled
//     <1=> PTC3 (Alias:D7)<selection=PTC3_SIG_SEL,SPI0_PCS1>
//     <2=> PTD4 (Alias:nRF24L01_cs)<selection=PTD4_SIG_SEL,SPI0_PCS1>
//     <0=> Default
#define SPI0_PCS1_PIN_SEL    0
#if SPI0_PCS1_PIN_SEL == 1
#define SPI0_PCS1_GPIO       USBDM::GpioC<3>
#define SPI0_PCS1_FN         2
#elif SPI0_PCS1_PIN_SEL == 2
#define SPI0_PCS1_GPIO       USBDM::GpioD<4>
#define SPI0_PCS1_FN         2
#endif

// Pin Mapping for SPI0_PCS2 signal
//   <o> SPI0_PCS2 [PTC2, PTD5]<name=SPI0_PCS2_PIN_SEL>
//   <i> Shows which pin SPI0_PCS2 is mapped to
//     <0=> Disabled
//     <1=> PTC2 (Alias:D6)<selection=PTC2_SIG_SEL,SPI0_PCS2>
//     <2=> PTD5 (Alias:nRF24L01_sck)<selection=PTD5_SIG_SEL,SPI0_PCS2>
//     <0=> Default
#define SPI0_PCS2_PIN_SEL    0
#if SPI0_PCS2_PIN_SEL == 1
#define SPI0_PCS2_GPIO       USBDM::GpioC<2>
#define SPI0_PCS2_FN         2
#elif SPI0_PCS2_PIN_SEL == 2
#define SPI0_PCS2_GPIO       USBDM::GpioD<5>
#define SPI0_PCS2_FN         2
#endif

// Pin Mapping for SPI0_PCS3 signal
//   <o> SPI0_PCS3 [PTC1, PTD6]<name=SPI0_PCS3_PIN_SEL>
//   <i> Shows which pin SPI0_PCS3 is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,SPI0_PCS3>
//     <2=> PTD6 (Alias:nRF24L01_mosi)<selection=PTD6_SIG_SEL,SPI0_PCS3>
//     <0=> Default
#define SPI0_PCS3_PIN_SEL    0
#if SPI0_PCS3_PIN_SEL == 1
#define SPI0_PCS3_GPIO       USBDM::GpioC<1>
#define SPI0_PCS3_FN         2
#elif SPI0_PCS3_PIN_SEL == 2
#define SPI0_PCS3_GPIO       USBDM::GpioD<6>
#define SPI0_PCS3_FN         2
#endif

// Pin Mapping for SPI0_PCS4 signal
//   <o> SPI0_PCS4 [PTC0]<name=SPI0_PCS4_PIN_SEL>
//   <i> Shows which pin SPI0_PCS4 is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,SPI0_PCS4>
//     <0=> Default
#define SPI0_PCS4_PIN_SEL    0
#if SPI0_PCS4_PIN_SEL == 1
#define SPI0_PCS4_GPIO       USBDM::GpioC<0>
#define SPI0_PCS4_FN         2
#endif

// Pin Mapping for SPI0_PCS5 signal
//   <o> SPI0_PCS5 [PTB23]<name=SPI0_PCS5_PIN_SEL>
//   <i> Shows which pin SPI0_PCS5 is mapped to
//     <0=> Disabled
//     <1=> PTB23 (Alias:D4)<selection=PTB23_SIG_SEL,SPI0_PCS5>
//     <0=> Default
#define SPI0_PCS5_PIN_SEL    0
#if SPI0_PCS5_PIN_SEL == 1
#define SPI0_PCS5_GPIO       USBDM::GpioB<23>
#define SPI0_PCS5_FN         3
#endif

// Pin Mapping for SPI0_SCK signal
//   <o> SPI0_SCK [PTA15, PTC5, PTD1]<name=SPI0_SCK_PIN_SEL>
//   <i> Shows which pin SPI0_SCK is mapped to
//     <0=> Disabled
//     <1=> PTA15<selection=PTA15_SIG_SEL,SPI0_SCK>
//     <2=> PTC5<selection=PTC5_SIG_SEL,SPI0_SCK>
//     <3=> PTD1 (Alias:D13)<selection=PTD1_SIG_SEL,SPI0_SCK>
//     <0=> Default
#define SPI0_SCK_PIN_SEL     0
#if SPI0_SCK_PIN_SEL == 1
#define SPI0_SCK_GPIO        USBDM::GpioA<15>
#define SPI0_SCK_FN          2
#elif SPI0_SCK_PIN_SEL == 2
#define SPI0_SCK_GPIO        USBDM::GpioC<5>
#define SPI0_SCK_FN          2
#elif SPI0_SCK_PIN_SEL == 3
#define SPI0_SCK_GPIO        USBDM::GpioD<1>
#define SPI0_SCK_FN          2
#endif

// Pin Mapping for SPI0_SIN signal
//   <o> SPI0_SIN [PTA17, PTC7, PTD3]<name=SPI0_SIN_PIN_SEL>
//   <i> Shows which pin SPI0_SIN is mapped to
//     <0=> Disabled
//     <1=> PTA17<selection=PTA17_SIG_SEL,SPI0_SIN>
//     <2=> PTC7<selection=PTC7_SIG_SEL,SPI0_SIN>
//     <3=> PTD3 (Alias:D12)<selection=PTD3_SIG_SEL,SPI0_SIN>
//     <0=> Default
#define SPI0_SIN_PIN_SEL     0
#if SPI0_SIN_PIN_SEL == 1
#define SPI0_SIN_GPIO        USBDM::GpioA<17>
#define SPI0_SIN_FN          2
#elif SPI0_SIN_PIN_SEL == 2
#define SPI0_SIN_GPIO        USBDM::GpioC<7>
#define SPI0_SIN_FN          2
#elif SPI0_SIN_PIN_SEL == 3
#define SPI0_SIN_GPIO        USBDM::GpioD<3>
#define SPI0_SIN_FN          2
#endif

