podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for SPI0_SOUT signal
//   <o> SPI0_SOUT [PTA16, PTC6, PTD2]<name=SPI0_SOUT_PIN_SEL>
//   <i> Shows which pin SPI0_SOUT is mapped to
//     <0=> Disabled
//     <1=> PTA16<selection=PTA16_SIG_SEL,SPI0_SOUT>
//     <2=> PTC6<selection=PTC6_SIG_SEL,SPI0_SOUT>
//     <3=> PTD2 (Alias:D11)<selection=PTD2_SIG_SEL,SPI0_SOUT>
//     <0=> Default
#define SPI0_SOUT_PIN_SEL    0
#if SPI0_SOUT_PIN_SEL == 1
#define SPI0_SOUT_GPIO       USBDM::GpioA<16>
#define SPI0_SOUT_FN         2
#elif SPI0_SOUT_PIN_SEL == 2
#define SPI0_SOUT_GPIO       USBDM::GpioC<6>
#define SPI0_SOUT_FN         2
#elif SPI0_SOUT_PIN_SEL == 3
#define SPI0_SOUT_GPIO       USBDM::GpioD<2>
#define SPI0_SOUT_FN         2
#endif

// </h>

// <h> Serial Peripheral Interface (SPI1)

// Pin Mapping for SPI1_PCS0 signal
//   <o> SPI1_PCS0 [PTB10, PTE4, PTD4]<name=SPI1_PCS0_PIN_SEL>
//   <i> Shows which pin SPI1_PCS0 is mapped to
//     <0=> Disabled
//     <1=> PTB10 (Alias:A2)<selection=PTB10_SIG_SEL,SPI1_PCS0>
//     <2=> PTE4<selection=PTE4_SIG_SEL,SPI1_PCS0>
//     <3=> PTD4 (Alias:nRF24L01_cs)<selection=PTD4_SIG_SEL,SPI1_PCS0>
//     <3=> Default
#define SPI1_PCS0_PIN_SEL    3
#if SPI1_PCS0_PIN_SEL == 1
#define SPI1_PCS0_GPIO       USBDM::GpioB<10>
#define SPI1_PCS0_FN         2
#elif SPI1_PCS0_PIN_SEL == 2
#define SPI1_PCS0_GPIO       USBDM::GpioE<4>
#define SPI1_PCS0_FN         2
#elif SPI1_PCS0_PIN_SEL == 3
#define SPI1_PCS0_GPIO       USBDM::GpioD<4>
#define SPI1_PCS0_FN         7
#endif

// Pin Mapping for SPI1_PCS1 signal
//   <o> SPI1_PCS1 [PTB9, PTE0]<name=SPI1_PCS1_PIN_SEL>
//   <i> Shows which pin SPI1_PCS1 is mapped to
//     <0=> Disabled
//     <1=> PTB9 (Alias:D2)<selection=PTB9_SIG_SEL,SPI1_PCS1>
//     <2=> PTE0<selection=PTE0_SIG_SEL,SPI1_PCS1>
//     <0=> Default
#define SPI1_PCS1_PIN_SEL    0
#if SPI1_PCS1_PIN_SEL == 1
#define SPI1_PCS1_GPIO       USBDM::GpioB<9>
#define SPI1_PCS1_FN         2
#elif SPI1_PCS1_PIN_SEL == 2
#define SPI1_PCS1_GPIO       USBDM::GpioE<0>
#define SPI1_PCS1_FN         2
#endif

// Pin Mapping for SPI1_PCS2 signal
//   <o> SPI1_PCS2 [PTE5]<name=SPI1_PCS2_PIN_SEL>
//   <i> Shows which pin SPI1_PCS2 is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,SPI1_PCS2>
//     <0=> Default
#define SPI1_PCS2_PIN_SEL    0
#if SPI1_PCS2_PIN_SEL == 1
#define SPI1_PCS2_GPIO       USBDM::GpioE<5>
#define SPI1_PCS2_FN         2
#endif

// Pin Mapping for SPI1_PCS3 signal
//   <o> SPI1_PCS3 [PTE6]<name=SPI1_PCS3_PIN_SEL>
//   <i> Shows which pin SPI1_PCS3 is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,SPI1_PCS3>
//     <0=> Default
#define SPI1_PCS3_PIN_SEL    0
#if SPI1_PCS3_PIN_SEL == 1
#define SPI1_PCS3_GPIO       USBDM::GpioE<6>
#define SPI1_PCS3_FN         2
#endif

// Pin Mapping for SPI1_SCK signal
//   <o> SPI1_SCK [PTB11, PTE2, PTD5]<name=SPI1_SCK_PIN_SEL>
//   <i> Shows which pin SPI1_SCK is mapped to
//     <0=> Disabled
//     <1=> PTB11 (Alias:A3)<selection=PTB11_SIG_SEL,SPI1_SCK>
//     <2=> PTE2<selection=PTE2_SIG_SEL,SPI1_SCK>
//     <3=> PTD5 (Alias:nRF24L01_sck)<selection=PTD5_SIG_SEL,SPI1_SCK>
//     <3=> Default
#define SPI1_SCK_PIN_SEL     3
#if SPI1_SCK_PIN_SEL == 1
#define SPI1_SCK_GPIO        USBDM::GpioB<11>
#define SPI1_SCK_FN          2
#elif SPI1_SCK_PIN_SEL == 2
#define SPI1_SCK_GPIO        USBDM::GpioE<2>
#define SPI1_SCK_FN          2
#elif SPI1_SCK_PIN_SEL == 3
#define SPI1_SCK_GPIO        USBDM::GpioD<5>
#define SPI1_SCK_FN          7
#endif

// Pin Mapping for SPI1_SIN signal
//   <o> SPI1_SIN [PTB17, PTE3, PTD7, PTE1]<name=SPI1_SIN_PIN_SEL>
//   <i> Shows which pin SPI1_SIN is mapped to
//     <0=> Disabled
//     <1=> PTB17<selection=PTB17_SIG_SEL,SPI1_SIN>
//     <2=> PTE3<selection=PTE3_SIG_SEL,SPI1_SIN>
//     <3=> PTD7 (Alias:nRF24L01_miso)<selection=PTD7_SIG_SEL,SPI1_SIN>
//     <4=> PTE1<selection=PTE1_SIG_SEL,SPI1_SIN>
//     <3=> Default
#define SPI1_SIN_PIN_SEL     3
#if SPI1_SIN_PIN_SEL == 1
#define SPI1_SIN_GPIO        USBDM::GpioB<17>
#define SPI1_SIN_FN          2
#elif SPI1_SIN_PIN_SEL == 2
#define SPI1_SIN_GPIO        USBDM::GpioE<3>
#define SPI1_SIN_FN          2
#elif SPI1_SIN_PIN_SEL == 3
#define SPI1_SIN_GPIO        USBDM::GpioD<7>
#define SPI1_SIN_FN          7
#elif SPI1_SIN_PIN_SEL == 4
#define SPI1_SIN_GPIO        USBDM::GpioE<1>
#define SPI1_SIN_FN          7
#endif

// Pin Mapping for SPI1_SOUT signal
//   <o> SPI1_SOUT [PTB16, PTE1, PTD6, PTE3]<name=SPI1_SOUT_PIN_SEL>
//   <i> Shows which pin SPI1_SOUT is mapped to
//     <0=> Disabled
//     <1=> PTB16<selection=PTB16_SIG_SEL,SPI1_SOUT>
//     <2=> PTE1<selection=PTE1_SIG_SEL,SPI1_SOUT>
//     <3=> PTD6 (Alias:nRF24L01_mosi)<selection=PTD6_SIG_SEL,SPI1_SOUT>
//     <4=> PTE3<selection=PTE3_SIG_SEL,SPI1_SOUT>
//     <3=> Default
#define SPI1_SOUT_PIN_SEL    3
#if SPI1_SOUT_PIN_SEL == 1
#define SPI1_SOUT_GPIO       USBDM::GpioB<16>
#define SPI1_SOUT_FN         2
#elif SPI1_SOUT_PIN_SEL == 2
#define SPI1_SOUT_GPIO       USBDM::GpioE<1>
#define SPI1_SOUT_FN         2
#elif SPI1_SOUT_PIN_SEL == 3
#define SPI1_SOUT_GPIO       USBDM::GpioD<6>
#define SPI1_SOUT_FN         7
#elif SPI1_SOUT_PIN_SEL == 4
#define SPI1_SOUT_GPIO       USBDM::GpioE<3>
#define SPI1_SOUT_FN         7
#endif

// </h>

// <h> Serial Peripheral Interface (SPI2)

// Pin Mapping for SPI2_PCS0 signal
//   <o> SPI2_PCS0 [PTB20, PTD11]<name=SPI2_PCS0_PIN_SEL>
//   <i> Shows which pin SPI2_PCS0 is mapped to
//     <0=> Disabled
//     <1=> PTB20<selection=PTB20_SIG_SEL,SPI2_PCS0>
//     <2=> PTD11<selection=PTD11_SIG_SEL,SPI2_PCS0>
//     <0=> Default
#define SPI2_PCS0_PIN_SEL    0
#if SPI2_PCS0_PIN_SEL == 1
#define SPI2_PCS0_GPIO       USBDM::GpioB<20>
#define SPI2_PCS0_FN         2
#elif SPI2_PCS0_PIN_SEL == 2
#define SPI2_PCS0_GPIO       USBDM::GpioD<11>
#define SPI2_PCS0_FN         2
#endif

// Pin Mapping for SPI2_PCS1 signal
//   <o> SPI2_PCS1 [PTD15]<name=SPI2_PCS1_PIN_SEL>
//   <i> Shows which pin SPI2_PCS1 is mapped to
//     <0=> Disabled
//     <1=> PTD15<selection=PTD15_SIG_SEL,SPI2_PCS1>
//     <0=> Default
#define SPI2_PCS1_PIN_SEL    0
#if SPI2_PCS1_PIN_SEL == 1
#define SPI2_PCS1_GPIO       USBDM::GpioD<15>
#define SPI2_PCS1_FN         2
#endif

