podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for SPI2_SCK signal
//   <o> SPI2_SCK [PTB21, PTD12]<name=SPI2_SCK_PIN_SEL>
//   <i> Shows which pin SPI2_SCK is mapped to
//     <0=> Disabled
//     <1=> PTB21 (Alias:LED_BLUE)<selection=PTB21_SIG_SEL,SPI2_SCK>
//     <2=> PTD12<selection=PTD12_SIG_SEL,SPI2_SCK>
//     <0=> Default
#define SPI2_SCK_PIN_SEL     0
#if SPI2_SCK_PIN_SEL == 1
#define SPI2_SCK_GPIO        USBDM::GpioB<21>
#define SPI2_SCK_FN          2
#elif SPI2_SCK_PIN_SEL == 2
#define SPI2_SCK_GPIO        USBDM::GpioD<12>
#define SPI2_SCK_FN          2
#endif

// Pin Mapping for SPI2_SIN signal
//   <o> SPI2_SIN [PTB23, PTD14]<name=SPI2_SIN_PIN_SEL>
//   <i> Shows which pin SPI2_SIN is mapped to
//     <0=> Disabled
//     <1=> PTB23 (Alias:D4)<selection=PTB23_SIG_SEL,SPI2_SIN>
//     <2=> PTD14<selection=PTD14_SIG_SEL,SPI2_SIN>
//     <0=> Default
#define SPI2_SIN_PIN_SEL     0
#if SPI2_SIN_PIN_SEL == 1
#define SPI2_SIN_GPIO        USBDM::GpioB<23>
#define SPI2_SIN_FN          2
#elif SPI2_SIN_PIN_SEL == 2
#define SPI2_SIN_GPIO        USBDM::GpioD<14>
#define SPI2_SIN_FN          2
#endif

// Pin Mapping for SPI2_SOUT signal
//   <o> SPI2_SOUT [PTB22, PTD13]<name=SPI2_SOUT_PIN_SEL>
//   <i> Shows which pin SPI2_SOUT is mapped to
//     <0=> Disabled
//     <1=> PTB22 (Alias:LED_RED)<selection=PTB22_SIG_SEL,SPI2_SOUT>
//     <2=> PTD13<selection=PTD13_SIG_SEL,SPI2_SOUT>
//     <0=> Default
#define SPI2_SOUT_PIN_SEL    0
#if SPI2_SOUT_PIN_SEL == 1
#define SPI2_SOUT_GPIO       USBDM::GpioB<22>
#define SPI2_SOUT_FN         2
#elif SPI2_SOUT_PIN_SEL == 2
#define SPI2_SOUT_GPIO       USBDM::GpioD<13>
#define SPI2_SOUT_FN         2
#endif

// </h>

// <h> Universal Asynchronous Rx/Tx (UART0)

// Pin Mapping for UART0_COL_b signal
//   <o> UART0_COL_b [PTA0, PTA16, PTB3, PTD5]<name=UART0_COL_b_PIN_SEL>
//   <i> Shows which pin UART0_COL_b is mapped to
//     <0=> Disabled
//     <1=> PTA0 (Alias:D8)<selection=PTA0_SIG_SEL,UART0_CTS_b/UART0_COL_b>
//     <2=> PTA16<selection=PTA16_SIG_SEL,UART0_CTS_b/UART0_COL_b>
//     <3=> PTB3 (Alias:A1)<selection=PTB3_SIG_SEL,UART0_CTS_b/UART0_COL_b>
//     <4=> PTD5 (Alias:nRF24L01_sck)<selection=PTD5_SIG_SEL,UART0_CTS_b/UART0_COL_b>
//     <0=> Default
#define UART0_COL_b_PIN_SEL  0
#if UART0_COL_b_PIN_SEL == 1
#define UART0_COL_b_GPIO     USBDM::GpioA<0>
#define UART0_COL_b_FN       2
#elif UART0_COL_b_PIN_SEL == 2
#define UART0_COL_b_GPIO     USBDM::GpioA<16>
#define UART0_COL_b_FN       3
#elif UART0_COL_b_PIN_SEL == 3
#define UART0_COL_b_GPIO     USBDM::GpioB<3>
#define UART0_COL_b_FN       3
#elif UART0_COL_b_PIN_SEL == 4
#define UART0_COL_b_GPIO     USBDM::GpioD<5>
#define UART0_COL_b_FN       3
#endif

// Pin Mapping for UART0_CTS_b signal
//   <o> UART0_CTS_b [PTA0, PTA16, PTB3, PTD5]<name=UART0_CTS_b_PIN_SEL>
//   <i> Shows which pin UART0_CTS_b is mapped to
//     <0=> Disabled
//     <1=> PTA0 (Alias:D8)<selection=PTA0_SIG_SEL,UART0_CTS_b/UART0_COL_b>
//     <2=> PTA16<selection=PTA16_SIG_SEL,UART0_CTS_b/UART0_COL_b>
//     <3=> PTB3 (Alias:A1)<selection=PTB3_SIG_SEL,UART0_CTS_b/UART0_COL_b>
//     <4=> PTD5 (Alias:nRF24L01_sck)<selection=PTD5_SIG_SEL,UART0_CTS_b/UART0_COL_b>
//     <0=> Default
#define UART0_CTS_b_PIN_SEL  0
#if UART0_CTS_b_PIN_SEL == 1
#define UART0_CTS_b_GPIO     USBDM::GpioA<0>
#define UART0_CTS_b_FN       2
#elif UART0_CTS_b_PIN_SEL == 2
#define UART0_CTS_b_GPIO     USBDM::GpioA<16>
#define UART0_CTS_b_FN       3
#elif UART0_CTS_b_PIN_SEL == 3
#define UART0_CTS_b_GPIO     USBDM::GpioB<3>
#define UART0_CTS_b_FN       3
#elif UART0_CTS_b_PIN_SEL == 4
#define UART0_CTS_b_GPIO     USBDM::GpioD<5>
#define UART0_CTS_b_FN       3
#endif

// Pin Mapping for UART0_RTS_b signal
//   <o> UART0_RTS_b [PTA3, PTA17, PTB2, PTD4]<name=UART0_RTS_b_PIN_SEL>
//   <i> Shows which pin UART0_RTS_b is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,UART0_RTS_b>
//     <2=> PTA17<selection=PTA17_SIG_SEL,UART0_RTS_b>
//     <3=> PTB2 (Alias:A0)<selection=PTB2_SIG_SEL,UART0_RTS_b>
//     <4=> PTD4 (Alias:nRF24L01_cs)<selection=PTD4_SIG_SEL,UART0_RTS_b>
//     <0=> Default
#define UART0_RTS_b_PIN_SEL  0
#if UART0_RTS_b_PIN_SEL == 1
#define UART0_RTS_b_GPIO     USBDM::GpioA<3>
#define UART0_RTS_b_FN       2
#elif UART0_RTS_b_PIN_SEL == 2
#define UART0_RTS_b_GPIO     USBDM::GpioA<17>
#define UART0_RTS_b_FN       3
#elif UART0_RTS_b_PIN_SEL == 3
#define UART0_RTS_b_GPIO     USBDM::GpioB<2>
#define UART0_RTS_b_FN       3
#elif UART0_RTS_b_PIN_SEL == 4
#define UART0_RTS_b_GPIO     USBDM::GpioD<4>
#define UART0_RTS_b_FN       3
#endif

// Pin Mapping for UART0_RX signal
//   <o> UART0_RX [PTA1, PTA15, PTB16, PTD6]<name=UART0_RX_PIN_SEL>
//   <i> Shows which pin UART0_RX is mapped to
//     <0=> Disabled
//     <1=> PTA1 (Alias:D3)<selection=PTA1_SIG_SEL,UART0_RX>
//     <2=> PTA15<selection=PTA15_SIG_SEL,UART0_RX>
//     <3=> PTB16<selection=PTB16_SIG_SEL,UART0_RX>
//     <4=> PTD6 (Alias:nRF24L01_mosi)<selection=PTD6_SIG_SEL,UART0_RX>
//     <0=> Default
#define UART0_RX_PIN_SEL     0
#if UART0_RX_PIN_SEL == 1
#define UART0_RX_GPIO        USBDM::GpioA<1>
#define UART0_RX_FN          2
#elif UART0_RX_PIN_SEL == 2
#define UART0_RX_GPIO        USBDM::GpioA<15>
#define UART0_RX_FN          3
#elif UART0_RX_PIN_SEL == 3
#define UART0_RX_GPIO        USBDM::GpioB<16>
#define UART0_RX_FN          3
#elif UART0_RX_PIN_SEL == 4
#define UART0_RX_GPIO        USBDM::GpioD<6>
#define UART0_RX_FN          3
#endif

// Pin Mapping for UART0_TX signal
//   <o> UART0_TX [PTA2, PTA14, PTB17, PTD7]<name=UART0_TX_PIN_SEL>
//   <i> Shows which pin UART0_TX is mapped to
//     <0=> Disabled
//     <1=> PTA2 (Alias:D5)<selection=PTA2_SIG_SEL,UART0_TX>
//     <2=> PTA14<selection=PTA14_SIG_SEL,UART0_TX>
//     <3=> PTB17<selection=PTB17_SIG_SEL,UART0_TX>
//     <4=> PTD7 (Alias:nRF24L01_miso)<selection=PTD7_SIG_SEL,UART0_TX>
//     <0=> Default
#define UART0_TX_PIN_SEL     0
#if UART0_TX_PIN_SEL == 1
#define UART0_TX_GPIO        USBDM::GpioA<2>
#define UART0_TX_FN          2
#elif UART0_TX_PIN_SEL == 2
#define UART0_TX_GPIO        USBDM::GpioA<14>
#define UART0_TX_FN          3
#elif UART0_TX_PIN_SEL == 3
#define UART0_TX_GPIO        USBDM::GpioB<17>
#define UART0_TX_FN          3
#elif UART0_TX_PIN_SEL == 4
#define UART0_TX_GPIO        USBDM::GpioD<7>
#define UART0_TX_FN          3
#endif

