podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// </h>

// <h> Universal Asynchronous Rx/Tx (UART1)

// Pin Mapping for UART1_CTS_b signal
//   <o> UART1_CTS_b [PTC2, PTE2]<name=UART1_CTS_b_PIN_SEL>
//   <i> Shows which pin UART1_CTS_b is mapped to
//     <0=> Disabled
//     <1=> PTC2 (Alias:D6)<selection=PTC2_SIG_SEL,UART1_CTS_b>
//     <2=> PTE2<selection=PTE2_SIG_SEL,UART1_CTS_b>
//     <0=> Default
#define UART1_CTS_b_PIN_SEL  0
#if UART1_CTS_b_PIN_SEL == 1
#define UART1_CTS_b_GPIO     USBDM::GpioC<2>
#define UART1_CTS_b_FN       3
#elif UART1_CTS_b_PIN_SEL == 2
#define UART1_CTS_b_GPIO     USBDM::GpioE<2>
#define UART1_CTS_b_FN       3
#endif

// Pin Mapping for UART1_RTS_b signal
//   <o> UART1_RTS_b [PTC1, PTE3]<name=UART1_RTS_b_PIN_SEL>
//   <i> Shows which pin UART1_RTS_b is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,UART1_RTS_b>
//     <2=> PTE3<selection=PTE3_SIG_SEL,UART1_RTS_b>
//     <0=> Default
#define UART1_RTS_b_PIN_SEL  0
#if UART1_RTS_b_PIN_SEL == 1
#define UART1_RTS_b_GPIO     USBDM::GpioC<1>
#define UART1_RTS_b_FN       3
#elif UART1_RTS_b_PIN_SEL == 2
#define UART1_RTS_b_GPIO     USBDM::GpioE<3>
#define UART1_RTS_b_FN       3
#endif

// Pin Mapping for UART1_RX signal
//   <o> UART1_RX [PTC3, PTE1]<name=UART1_RX_PIN_SEL>
//   <i> Shows which pin UART1_RX is mapped to
//     <0=> Disabled
//     <1=> PTC3 (Alias:D7)<selection=PTC3_SIG_SEL,UART1_RX>
//     <2=> PTE1<selection=PTE1_SIG_SEL,UART1_RX>
//     <0=> Default
#define UART1_RX_PIN_SEL     0
#if UART1_RX_PIN_SEL == 1
#define UART1_RX_GPIO        USBDM::GpioC<3>
#define UART1_RX_FN          3
#elif UART1_RX_PIN_SEL == 2
#define UART1_RX_GPIO        USBDM::GpioE<1>
#define UART1_RX_FN          3
#endif

// Pin Mapping for UART1_TX signal
//   <o> UART1_TX [PTC4, PTE0]<name=UART1_TX_PIN_SEL>
//   <i> Shows which pin UART1_TX is mapped to
//     <0=> Disabled
//     <1=> PTC4 (Alias:D9)<selection=PTC4_SIG_SEL,UART1_TX>
//     <2=> PTE0<selection=PTE0_SIG_SEL,UART1_TX>
//     <0=> Default
#define UART1_TX_PIN_SEL     0
#if UART1_TX_PIN_SEL == 1
#define UART1_TX_GPIO        USBDM::GpioC<4>
#define UART1_TX_FN          3
#elif UART1_TX_PIN_SEL == 2
#define UART1_TX_GPIO        USBDM::GpioE<0>
#define UART1_TX_FN          3
#endif

// </h>

// <h> Universal Asynchronous Rx/Tx (UART2)

// Pin Mapping for UART2_CTS_b signal
//   <o> UART2_CTS_b [PTD1]<name=UART2_CTS_b_PIN_SEL>
//   <i> Shows which pin UART2_CTS_b is mapped to
//     <0=> Disabled
//     <1=> PTD1 (Alias:D13)<selection=PTD1_SIG_SEL,UART2_CTS_b>
//     <0=> Default
#define UART2_CTS_b_PIN_SEL  0
#if UART2_CTS_b_PIN_SEL == 1
#define UART2_CTS_b_GPIO     USBDM::GpioD<1>
#define UART2_CTS_b_FN       3
#endif

// Pin Mapping for UART2_RTS_b signal
//   <o> UART2_RTS_b [PTD0]<name=UART2_RTS_b_PIN_SEL>
//   <i> Shows which pin UART2_RTS_b is mapped to
//     <0=> Disabled
//     <1=> PTD0 (Alias:D10)<selection=PTD0_SIG_SEL,UART2_RTS_b>
//     <0=> Default
#define UART2_RTS_b_PIN_SEL  0
#if UART2_RTS_b_PIN_SEL == 1
#define UART2_RTS_b_GPIO     USBDM::GpioD<0>
#define UART2_RTS_b_FN       3
#endif

// Pin Mapping for UART2_RX signal
//   <o> UART2_RX [PTD2]<name=UART2_RX_PIN_SEL>
//   <i> Shows which pin UART2_RX is mapped to
//     <0=> Disabled
//     <1=> PTD2 (Alias:D11)<selection=PTD2_SIG_SEL,UART2_RX>
//     <0=> Default
#define UART2_RX_PIN_SEL     0
#if UART2_RX_PIN_SEL == 1
#define UART2_RX_GPIO        USBDM::GpioD<2>
#define UART2_RX_FN          3
#endif

// Pin Mapping for UART2_TX signal
//   <o> UART2_TX [PTD3]<name=UART2_TX_PIN_SEL>
//   <i> Shows which pin UART2_TX is mapped to
//     <0=> Disabled
//     <1=> PTD3 (Alias:D12)<selection=PTD3_SIG_SEL,UART2_TX>
//     <0=> Default
#define UART2_TX_PIN_SEL     0
#if UART2_TX_PIN_SEL == 1
#define UART2_TX_GPIO        USBDM::GpioD<3>
#define UART2_TX_FN          3
#endif

// </h>

// <h> Universal Asynchronous Rx/Tx (UART3)

// Pin Mapping for UART3_CTS_b signal
//   <o> UART3_CTS_b [PTB13, PTB9, PTC19, PTE6]<name=UART3_CTS_b_PIN_SEL>
//   <i> Shows which pin UART3_CTS_b is mapped to
//     <0=> Disabled
//     <1=> PTB13<selection=PTB13_SIG_SEL,UART3_CTS_b>
//     <2=> PTB9 (Alias:D2)<selection=PTB9_SIG_SEL,UART3_CTS_b>
//     <3=> PTC19<selection=PTC19_SIG_SEL,UART3_CTS_b>
//     <4=> PTE6<selection=PTE6_SIG_SEL,UART3_CTS_b>
//     <0=> Default
#define UART3_CTS_b_PIN_SEL  0
#if UART3_CTS_b_PIN_SEL == 1
#define UART3_CTS_b_GPIO     USBDM::GpioB<13>
#define UART3_CTS_b_FN       2
#elif UART3_CTS_b_PIN_SEL == 2
#define UART3_CTS_b_GPIO     USBDM::GpioB<9>
#define UART3_CTS_b_FN       3
#elif UART3_CTS_b_PIN_SEL == 3
#define UART3_CTS_b_GPIO     USBDM::GpioC<19>
#define UART3_CTS_b_FN       3
#elif UART3_CTS_b_PIN_SEL == 4
#define UART3_CTS_b_GPIO     USBDM::GpioE<6>
#define UART3_CTS_b_FN       3
#endif

// Pin Mapping for UART3_RTS_b signal
//   <o> UART3_RTS_b [PTB12, PTB8, PTC18, PTE7]<name=UART3_RTS_b_PIN_SEL>
//   <i> Shows which pin UART3_RTS_b is mapped to
//     <0=> Disabled
//     <1=> PTB12<selection=PTB12_SIG_SEL,UART3_RTS_b>
//     <2=> PTB8<selection=PTB8_SIG_SEL,UART3_RTS_b>
//     <3=> PTC18<selection=PTC18_SIG_SEL,UART3_RTS_b>
//     <4=> PTE7<selection=PTE7_SIG_SEL,UART3_RTS_b>
//     <0=> Default
#define UART3_RTS_b_PIN_SEL  0
#if UART3_RTS_b_PIN_SEL == 1
#define UART3_RTS_b_GPIO     USBDM::GpioB<12>
#define UART3_RTS_b_FN       2
#elif UART3_RTS_b_PIN_SEL == 2
#define UART3_RTS_b_GPIO     USBDM::GpioB<8>
#define UART3_RTS_b_FN       3
#elif UART3_RTS_b_PIN_SEL == 3
#define UART3_RTS_b_GPIO     USBDM::GpioC<18>
#define UART3_RTS_b_FN       3
#elif UART3_RTS_b_PIN_SEL == 4
#define UART3_RTS_b_GPIO     USBDM::GpioE<7>
#define UART3_RTS_b_FN       3
#endif

// Pin Mapping for UART3_RX signal
//   <o> UART3_RX [PTB10, PTC16, PTE5]<name=UART3_RX_PIN_SEL>
//   <i> Shows which pin UART3_RX is mapped to
//     <0=> Disabled
//     <1=> PTB10 (Alias:A2)<selection=PTB10_SIG_SEL,UART3_RX>
//     <2=> PTC16 (Alias:D0)<selection=PTC16_SIG_SEL,UART3_RX>
//     <3=> PTE5<selection=PTE5_SIG_SEL,UART3_RX>
//     <0=> Default
#define UART3_RX_PIN_SEL     0
#if UART3_RX_PIN_SEL == 1
#define UART3_RX_GPIO        USBDM::GpioB<10>
#define UART3_RX_FN          3
#elif UART3_RX_PIN_SEL == 2
#define UART3_RX_GPIO        USBDM::GpioC<16>
#define UART3_RX_FN          3
#elif UART3_RX_PIN_SEL == 3
#define UART3_RX_GPIO        USBDM::GpioE<5>
#define UART3_RX_FN          3
#endif

