podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MK64F12.h
// Pin Mapping for UART3_TX signal
//   <o> UART3_TX [PTB11, PTC17, PTE4]<name=UART3_TX_PIN_SEL>
//   <i> Shows which pin UART3_TX is mapped to
//     <0=> Disabled
//     <1=> PTB11 (Alias:A3)<selection=PTB11_SIG_SEL,UART3_TX>
//     <2=> PTC17 (Alias:D1)<selection=PTC17_SIG_SEL,UART3_TX>
//     <3=> PTE4<selection=PTE4_SIG_SEL,UART3_TX>
//     <0=> Default
#define UART3_TX_PIN_SEL     0
#if UART3_TX_PIN_SEL == 1
#define UART3_TX_GPIO        USBDM::GpioB<11>
#define UART3_TX_FN          3
#elif UART3_TX_PIN_SEL == 2
#define UART3_TX_GPIO        USBDM::GpioC<17>
#define UART3_TX_FN          3
#elif UART3_TX_PIN_SEL == 3
#define UART3_TX_GPIO        USBDM::GpioE<4>
#define UART3_TX_FN          3
#endif

// </h>

// <h> Universal Asynchronous Rx/Tx (UART4)

// Pin Mapping for UART4_CTS_b signal
//   <o> UART4_CTS_b [PTC13, PTE26]<name=UART4_CTS_b_PIN_SEL>
//   <i> Shows which pin UART4_CTS_b is mapped to
//     <0=> Disabled
//     <1=> PTC13<selection=PTC13_SIG_SEL,UART4_CTS_b>
//     <2=> PTE26 (Alias:LED_GREEN)<selection=PTE26_SIG_SEL,UART4_CTS_b>
//     <0=> Default
#define UART4_CTS_b_PIN_SEL  0
#if UART4_CTS_b_PIN_SEL == 1
#define UART4_CTS_b_GPIO     USBDM::GpioC<13>
#define UART4_CTS_b_FN       3
#elif UART4_CTS_b_PIN_SEL == 2
#define UART4_CTS_b_GPIO     USBDM::GpioE<26>
#define UART4_CTS_b_FN       3
#endif

// Pin Mapping for UART4_RTS_b signal
//   <o> UART4_RTS_b [PTC12, PTE27]<name=UART4_RTS_b_PIN_SEL>
//   <i> Shows which pin UART4_RTS_b is mapped to
//     <0=> Disabled
//     <1=> PTC12<selection=PTC12_SIG_SEL,UART4_RTS_b>
//     <2=> PTE27<selection=PTE27_SIG_SEL,UART4_RTS_b>
//     <0=> Default
#define UART4_RTS_b_PIN_SEL  0
#if UART4_RTS_b_PIN_SEL == 1
#define UART4_RTS_b_GPIO     USBDM::GpioC<12>
#define UART4_RTS_b_FN       3
#elif UART4_RTS_b_PIN_SEL == 2
#define UART4_RTS_b_GPIO     USBDM::GpioE<27>
#define UART4_RTS_b_FN       3
#endif

// Pin Mapping for UART4_RX signal
//   <o> UART4_RX [PTC14, PTE25]<name=UART4_RX_PIN_SEL>
//   <i> Shows which pin UART4_RX is mapped to
//     <0=> Disabled
//     <1=> PTC14<selection=PTC14_SIG_SEL,UART4_RX>
//     <2=> PTE25 (Alias:D14)<selection=PTE25_SIG_SEL,UART4_RX>
//     <0=> Default
#define UART4_RX_PIN_SEL     0
#if UART4_RX_PIN_SEL == 1
#define UART4_RX_GPIO        USBDM::GpioC<14>
#define UART4_RX_FN          3
#elif UART4_RX_PIN_SEL == 2
#define UART4_RX_GPIO        USBDM::GpioE<25>
#define UART4_RX_FN          3
#endif

// Pin Mapping for UART4_TX signal
//   <o> UART4_TX [PTC15, PTE24]<name=UART4_TX_PIN_SEL>
//   <i> Shows which pin UART4_TX is mapped to
//     <0=> Disabled
//     <1=> PTC15<selection=PTC15_SIG_SEL,UART4_TX>
//     <2=> PTE24 (Alias:D15)<selection=PTE24_SIG_SEL,UART4_TX>
//     <0=> Default
#define UART4_TX_PIN_SEL     0
#if UART4_TX_PIN_SEL == 1
#define UART4_TX_GPIO        USBDM::GpioC<15>
#define UART4_TX_FN          3
#elif UART4_TX_PIN_SEL == 2
#define UART4_TX_GPIO        USBDM::GpioE<24>
#define UART4_TX_FN          3
#endif

// </h>

// <h> Universal Asynchronous Rx/Tx (UART5)

// Pin Mapping for UART5_CTS_b signal
//   <o> UART5_CTS_b [PTD11, PTE10]<name=UART5_CTS_b_PIN_SEL>
//   <i> Shows which pin UART5_CTS_b is mapped to
//     <0=> Disabled
//     <1=> PTD11<selection=PTD11_SIG_SEL,UART5_CTS_b>
//     <2=> PTE10<selection=PTE10_SIG_SEL,UART5_CTS_b>
//     <0=> Default
#define UART5_CTS_b_PIN_SEL  0
#if UART5_CTS_b_PIN_SEL == 1
#define UART5_CTS_b_GPIO     USBDM::GpioD<11>
#define UART5_CTS_b_FN       3
#elif UART5_CTS_b_PIN_SEL == 2
#define UART5_CTS_b_GPIO     USBDM::GpioE<10>
#define UART5_CTS_b_FN       3
#endif

// Pin Mapping for UART5_RTS_b signal
//   <o> UART5_RTS_b [PTD10, PTE11]<name=UART5_RTS_b_PIN_SEL>
//   <i> Shows which pin UART5_RTS_b is mapped to
//     <0=> Disabled
//     <1=> PTD10<selection=PTD10_SIG_SEL,UART5_RTS_b>
//     <2=> PTE11<selection=PTE11_SIG_SEL,UART5_RTS_b>
//     <0=> Default
#define UART5_RTS_b_PIN_SEL  0
#if UART5_RTS_b_PIN_SEL == 1
#define UART5_RTS_b_GPIO     USBDM::GpioD<10>
#define UART5_RTS_b_FN       3
#elif UART5_RTS_b_PIN_SEL == 2
#define UART5_RTS_b_GPIO     USBDM::GpioE<11>
#define UART5_RTS_b_FN       3
#endif

// Pin Mapping for UART5_RX signal
//   <o> UART5_RX [PTD8, PTE9]<name=UART5_RX_PIN_SEL>
//   <i> Shows which pin UART5_RX is mapped to
//     <0=> Disabled
//     <1=> PTD8<selection=PTD8_SIG_SEL,UART5_RX>
//     <2=> PTE9<selection=PTE9_SIG_SEL,UART5_RX>
//     <0=> Default
#define UART5_RX_PIN_SEL     0
#if UART5_RX_PIN_SEL == 1
#define UART5_RX_GPIO        USBDM::GpioD<8>
#define UART5_RX_FN          3
#elif UART5_RX_PIN_SEL == 2
#define UART5_RX_GPIO        USBDM::GpioE<9>
#define UART5_RX_FN          3
#endif

// Pin Mapping for UART5_TX signal
//   <o> UART5_TX [PTD9, PTE8]<name=UART5_TX_PIN_SEL>
//   <i> Shows which pin UART5_TX is mapped to
//     <0=> Disabled
//     <1=> PTD9<selection=PTD9_SIG_SEL,UART5_TX>
//     <2=> PTE8<selection=PTE8_SIG_SEL,UART5_TX>
//     <0=> Default
#define UART5_TX_PIN_SEL     0
#if UART5_TX_PIN_SEL == 1
#define UART5_TX_GPIO        USBDM::GpioD<9>
#define UART5_TX_FN          3
#elif UART5_TX_PIN_SEL == 2
#define UART5_TX_GPIO        USBDM::GpioE<8>
#define UART5_TX_FN          3
#endif

// </h>

// <h> Universal Serial Bus

// Pin Mapping for USB_CLKIN signal
//   <o> USB_CLKIN [PTA5, PTE26]<name=USB_CLKIN_PIN_SEL>
//   <i> Shows which pin USB_CLKIN is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,USB_CLKIN>
//     <2=> PTE26 (Alias:LED_GREEN)<selection=PTE26_SIG_SEL,USB_CLKIN>
//     <0=> Default
#define USB_CLKIN_PIN_SEL    0
#if USB_CLKIN_PIN_SEL == 1
#define USB_CLKIN_GPIO       USBDM::GpioA<5>
#define USB_CLKIN_FN         2
#elif USB_CLKIN_PIN_SEL == 2
#define USB_CLKIN_GPIO       USBDM::GpioE<26>
#define USB_CLKIN_FN         7
#endif

// Pin Mapping for USB_SOF_OUT signal
//   <o> USB_SOF_OUT [PTC7, PTC0, PTE6]<name=USB_SOF_OUT_PIN_SEL>
//   <i> Shows which pin USB_SOF_OUT is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,USB_SOF_OUT>
//     <2=> PTC0<selection=PTC0_SIG_SEL,USB_SOF_OUT>
//     <3=> PTE6<selection=PTE6_SIG_SEL,USB_SOF_OUT>
//     <0=> Default
#define USB_SOF_OUT_PIN_SEL  0
#if USB_SOF_OUT_PIN_SEL == 1
#define USB_SOF_OUT_GPIO     USBDM::GpioC<7>
#define USB_SOF_OUT_FN       3
#elif USB_SOF_OUT_PIN_SEL == 2
#define USB_SOF_OUT_GPIO     USBDM::GpioC<0>
#define USB_SOF_OUT_FN       4
#elif USB_SOF_OUT_PIN_SEL == 3
#define USB_SOF_OUT_GPIO     USBDM::GpioE<6>
#define USB_SOF_OUT_FN       7
#endif

